{"title":"Stephen.Fry.in.Central.America.s01e04.EN.SUB.WEBRIP.[MPup]","uid":12503598,"size":540942345,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:01121ba8f7885aed08571a86a1423c9a55aa4236&amp;dn=Stephen.Fry.in.Central.America.s01e04.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1443415622,"description":"Stephen.Fry.in.Central.America.s01e04.EN.SUB.WEBRIP.[MPup]\r\n\r\nStephen Fry in Central America s01e04 EN SUB WEBRIP [MPup] Costa Rica to Panama\r\n\r\nFormat: MPEG-4\r\nSize: 704x396\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]4 of 4[/b]\r\n\r\n[i]FINALLY the subs have been released! Enjoy.[/i]\r\n\r\nIn the concluding episode, Stephen Fry visits Costa Rica - often considered to be the Switzerland of Central America - and Panama before reaching journey's end.\r\n\r\n[img]http://extraimago.com/images/2015/09/28/d0b21fdd2b88146327dbf45f6f6fa0c5.jpg[/img]\r\n\r\nIn episode four, Stephen’s journey continues through Costa Rica and Panama.  In Costa Rica he discovers a country, which is a marked contrast to the rest of Central America. With no army or civil wars it boasts a stable democracy with an enviable living standard that has propelled it to the top of the UN Happiness Index.  \r\n \r\nWith virgin rainforests teaming with exotic wildlife and stunning natural beauty, it has become a leading light in conservation and ecotourism. \r\n \r\nBeginning his journey on The San Juan River, that forms the border between Nicaragua and Costa Rica, Stephen tries his hand at tarpon fishing with Dan Wise, a retired lawyer from Mississippi, who cites his reason for coming here as being that Costa Rica is the Switzerland of Central America. \r\n \r\nAt the La Selva Biological research station Stephen learns how to extract the queen from a colony of 4 million leaf cutter ants, meets poison dart frogs and handles the smallest bat in the world who has a nose extension, so it can eat fruit and chocolate at the same time.\r\n \r\nHe also enjoys Costa Rica’s stunning outdoors by ascending active volcanoes, white water rafting on rivers and experiencing the passion of a derby football match in the capital, San Jose. \r\n \r\nAt the Clinico Biblico he meets a surgeon who perform keyhole operations for an increasing number of medical tourists coming from the USA and finally, gets up close and personal with baby sloths and howler monkeys at an animal rehabilitation centre.\r\n \r\nCrossing into Panama he visits the Guna people to witness the extraordinary nightime arrival of the giant leatherback turtles, as they come ashore to lay their eggs.  Taking the train to Panama City he joins in a drug busting exercise and learns how to dredge the canal before bidding farewell to his faithful school bus at the end of his epic journey","torrent":{"xt":"urn:btih:01121ba8f7885aed08571a86a1423c9a55aa4236","amp;dn":"Stephen.Fry.in.Central.America.s01e04.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01121ba8f7885aed08571a86a1423c9a55aa4236","infoHashBuffer":{"type":"Buffer","data":[1,18,27,168,247,136,90,237,8,87,26,134,161,66,60,154,85,170,66,54]},"announce":[],"urlList":[]}}