{"title":"DARK VOID-msi-RELOADED (missing msi file)","uid":5292406,"size":6325544,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:029d72d7bf5c39248668fb1f37d2a1e225cb7686&amp;dn=DARK+VOID-msi-RELOADED+%28missing+msi+file%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thenoobish","files":4,"time":1263938540,"description":"missing file\n\nnERv\n\nDark Void (c) Capcom\n\n01/2010 :..... RELEASE.DATE .. PROTECTION .......: Securom\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\n\nNote: In our haste to pack this, we somehow missed a file (setup.exe).\nHere is a repack. This release is not needed if you have already downloaded\nthe previous release; you can install by clicking the DARK VOID.msi file on\nthe DVD.\n\nDark Void is a sci-fi action-adventure game that combines an\nadrenaline-fueled blend of aerial and ground-pounding combat. Set in a\nparallel universe called The Void, players take on the role of Will, a\npilot dropped into incredible circumstances within the mysterious Void. This\nunlikely hero soon finds himself swept into a desperate struggle for\nsurvival, joining forces with a rebel human group called The Survivors.\nTrapped in the Void, these resistance fighters are battling to hold off a\nmysterious alien race that plans to threaten Earth.\n\nDark Voids unique combination of jet pack-booster aerial dog fighting and\nthird-person combat brings a thrilling new gameplay dynamic to the\nthird-person shooter experience. Taking 3D action to a whole new level, Dark\nVoids unique vertical combat system allows players to dangle from thousand\nfoot drops as they take cover and hurl enemies to their doom, bringing a\nwhole new sense of tension and thrill to the player. Will is also equipped\nwith a powerful rocket pack which allows for fierce in-air combat, hurtling\nthrough the Void at blistering speeds while shooting down anything that gets\nin his path.\n\nhope this wil work for you that already dl ","torrent":{"xt":"urn:btih:029d72d7bf5c39248668fb1f37d2a1e225cb7686","amp;dn":"DARK+VOID-msi-RELOADED+%28missing+msi+file%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"029d72d7bf5c39248668fb1f37d2a1e225cb7686","infoHashBuffer":{"type":"Buffer","data":[2,157,114,215,191,92,57,36,134,104,251,31,55,210,161,226,37,203,118,134]},"announce":[],"urlList":[]}}