{"title":"PES 2010 - SMoKE Patch 2.0","uid":5288525,"size":564998849,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:06438542327054b589280aea3aaf3d10573409b8&amp;dn=PES+2010+-+SMoKE+Patch+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dido_SMK","files":9,"time":1263774033,"description":"Pro Evolution Soccer 2010 - PES SMoKE Patch 2.0\n\n----------------------------------------------------------------------------------\n\nSome of the features:\n\n- A lot of new clubs and national teams with correct kits.\n- Correct Champions league teams.\n- New HD emblems and flags.\n- Added Bundesliga (Eredivisie still in the game).\n- 217 overall Clubs, 96 overall national teams.\n- New faces (all face slots used), balls, boots, stadiums, replay, scoreboard...\n- SMoKE special Chants for most teams.\n- GDB correct kits for all teams (3 missing).\n- Most teams formation and starting lineups are up to date.\n- Most national teams are updated according latest national matches.\n- Hundreds of new players.\n- Revised player stats (SMoKE special rating system).\n- No duplicated players or names including ML hidden players.\n- Correct names for everything.\n- And much much more...\n\n----------------------------------------------------------------------------------\n\n- National Teams in Game (96): \n\nAlbania, Austria, Belarus, Belgium, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, England, Finland, France, Georgia, Germany, Greece, Hungary, Ireland, Israel, Italy, Lithuania, Montenegro, Netherlands, Northern Ireland, Norway, Poland, Portugal, Romania, Russia, Scotland, Serbia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, Ukraine, Wales /// Algeria, Angola, Cameroon, Cote d'Ivoire, Egypt, Ghana, Guinea, Mali, Morocco, Nigeria, Senegal, South Africa, Togo, Tunisia /// Canada, Costa Rica, Honduras, Mexico, Trinidad and Tobago, USA /// Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay, Venezuela /// Australia, Bahrain, China, India, Iran, Iraq, Japan, Kuwait, North Korea, Oman, New Zealand, Saudi Arabia, Qatar, Korea Republic, Syria, Thailand, UAE, Uzbekistan /// Classic Italy, Classic France, Classic England, Classic Brazil, Classic Argentina, Classic Netherlands \n\n\n- Clubs in Game (217): \n\nArsenal, Aston Villa, Blackburn Rovers, Bolton Wanderers, Chelsea, Everton, Fulham, Hull City, Liverpool, Manchester City, Manchester United, Birmingham City, Burnley, Portsmouth, Stoke City, Sunderland, Tottenham Hotspur, Wolverhampton, West Ham United, Wigan Athletic /// Auxerre, Girondins de Bordeaux, Boulogne, Grenoble Foot, RC Lens, LE Mans, Losc Lille, FC Lorient, Olympique Lyonnais, Olympique Marseille, AS Monaco, Nancy Lorraine, Montpellier, OGC Nice, Paris Saint-Germain, Stade Rennais, Saint-Etienne, Sochaux, Toulouse, Valenciennes /// Atalanta, Bari, Bologna, Cagliari Calcio, Calcio Catania, Chievo Verona, Fiorentina, Genoa, Inter Milan, Juventus, Lazio, Livorno, AC Milan, Napoli, Palermo, Parma, Roma, Sampdoria, Siena, Udinese /// Ado Den Haag, Ajax, AZ Alkmaar, Feyenoord, Groningen, Heerenveen, Heracles Almelo, NAC Breda, NEC Nijmegen, PSV Eindhoven, Roda JC, Sparta Rotterdam, FC Twente, FC Utrecht, Vitesse Arnheim, VVV Venlo, RKC Waalwijk, Willem II /// Mainz 05, Bayer Leverkusen, Bayern MÃƒÂ¼nchen, Bochum, Freiburg, Borussia Dortmund, Eintracht Frankfurt, Hamburger, Hannover, Hertha Berlin, 1899 Hoffenheim, NÃƒÂ¼rnberg, Koln, Borussia M'Gladbach, Schalke 04, Stuttgart, Werder Bremen, Wolfsburg /// Almeria, Athletic Bilbao, Barcelona, Deportivo LA CoruÃƒÂ±a, Espanyol, Getafe, Sporting Gijon, Atletico Madrid, Real Madrid, Malaga, Mallorca, Osasuna, Racing Santander, Sevilla, Tenerife, Valencia, Real Valladolid, Villarreal, Xerez, Real Zaragosa /// Austria Wien, SK Sturm Graz, Red Bull Salzburg, Rapid Wien, BATE Borisov, Anderlecht, Club Brugge, Standard de Liege, KAA Gent, Litex Lovech, CSKA Sofia, Levski Sofia, Dinamo Zagreb, Hajduk Split, Slavia Praha, Sparta Praha, Banik Ostrava, Apoel FC, Anorthosis, Brondby IF, Copenhagen, HJK Helsinki, AEK Athens, Olympiacos, Panathinaikos, PAOK Thessaloniki, Debreceni VSC, Fehervar, Hapoel Tel Aviv, Maccabi Haifa, Ventspils, Sheriff Tiraspol, Rosenborg Ballklub, Wisla Krakow, Legia Warszawa, Lech Poznan, Benfica, SC Braga, Porto, Sporting, Nacional Madeira, Dinamo Bucuresti, CFR Cluj, Steaua Bucuresti, Unirea Urziceni, Timisoara, CSKA Moscow, Lokomotiv Moscow, Spartak Moscow, Zenit, Rubin Kazan, Aberdeen, Celtic, Hearts, Rangers, Crvena Zvezda, Partizan, AIK, IFK Goteborg, Hammarby Fotboll, Kalmar FF, Basel 1893, Zurich, Besiktas, Fenerbahce, Galatasaray, Sivasspor, Trabzonspor, Shakhtar Donetsk, Metalist Kharkiv, Dynamo Kyiv, Boca Juniors, River Plate, Banfield, Independiente, San Lorenzo, Internacional, Corinthians, Gremio, Sao Paulo FC, Palmeiras, Cruzeiro, Flamengo, Colo Colo, Universidad, Liga de Quito, Club Nacional de Football, Penarol, Galaxy, Seattle Sounders, Club Africain, Esperance Sportive, Etoile du Sahel, Al Ahly, Zamalek, Al Ismaily, Al Ittihad Jeddah, Al Hilal Riyadh, Wydad Casablanca, Raja Casablanca, Persepolis, Esteghlal.\n\n\n----------------------------------------------------------------------------------\n\nInstallation (ON A NEW COPY OF PES):\n**all steps are required**\n\n\n1. Decompress the file (extract only one part, all parts will be be extracted in the same place)\n\n2. Copy (PES2010_EDIT01.bin) and (PES2010_OPTION01.bin) from the save folder in the patch to the SAVE folder of the game, should be (C:Documents and SettingsUSERMy DocumentsKONAMIPro Evolution Soccer 2010save), replace old files if it asks.\n\n3. Backup then Replace (pes2010.exe) and (settings.exe) with the ones from the patch.\n\n4. Copy the kitserver folder in the Pro Evolution Soccer 2010 installation folder, should be: (C:Program FilesKONAMIPro Evolution Soccer 2010), then open the kitserver folder and run manager.exe then click attach, then close.\n\n\nP.S.: Directories are the ones by default installation, if you have changed the defaults use your directories.\n\nP.S.: Do not update the game after installing the patch.\n\n----------------------------------------------------------------------------------\n\n\nNews and polls at main website, pes-smoke-patch. blog spot. com","torrent":{"xt":"urn:btih:06438542327054b589280aea3aaf3d10573409b8","amp;dn":"PES+2010+-+SMoKE+Patch+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06438542327054b589280aea3aaf3d10573409b8","infoHashBuffer":{"type":"Buffer","data":[6,67,133,66,50,112,84,181,137,40,10,234,58,175,61,16,87,52,9,184]},"announce":[],"urlList":[]}}