{"title":"The Fearless Vampire Killers","uid":12496511,"size":1700542318,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a6cfa63f8b357c35144b1e3c0dcfc96f4f5834c&amp;dn=The+Fearless+Vampire+Killers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"IImultipleII","files":3,"time":1443276053,"description":"IT'S no wonder Roman Polanski would prefer to repudiate the cut of his new film, The Fearless Vampire Killers or Pardon Me, But Your Teeth Are in My Neck, which was put on, despite his objections, yesterday at the Baronet. For this beautifully produced, superbly scenic and excitingly photographed spoof of old-fashioned horror movies is as dismal and dead as a blood-drained corpse.\r\nIt appears to be hopefully intended as a sort of Grand Guignological farce about a studious investigation of vampires in an ancient castle in Transylvania by a nutty, bewhiskered professor and his younger and nuttier associate. And it looks at the very beginning, when these two come careering up to a crowded inn in a Transylvania village to begin their abnormal search, that it may be headed for imaginative regions and may turn out to be good fun.\r\nJack MacGowran as the nutty professor looks mad enough to be a front-running clown, and Mr. Polanski as his pinch-nosed associate seems just the fellow to act his foolish, frantic foil. Alfie Bass is expansive and propitious as the comical proprietor of the inn, and Sharon Tate looks precisely the sort of bat-bait into which you may expect any lurking vampire to sink his teeth.\r\nAlso the style of the production, which runs to flatulent forms and somber hues, is appropriate to the mephitic spirit of an anticipated black-humored spoof.\r\nBut, heavens, how bleakly unproductive of wit it is as it goes along, and how sluggishly heavy and obvious are the fumblings towards haunted-house fun. Ferdy Wayne looks a promising vampire, in his elegant count's costume, his Bela Lugosi manner and his mouth full of bright, incipient fangs, and Terry Downes clomps around appropriately as his buck-toothed and hunch-backed slave. But they are used to no advantage whatsoever in the hackneyed working out of the play.\r\nEvidently Mr. Polanski feels his film has been so badly cut (from 107 to 88 minutes) and so ineffectually dubbed with new voices in many scenes that whatever he had in the picture originally has been largely lost. Therefore he has asked that his name be removed.\r\nPerhaps his film has been mutilated, but I cannot imagine what might have been so rich about the excised material that would cause it to make the film better than it is. It could only have been more ponderous clowning, more vampires risen from their midnight graves with terrible teeth gleaming in the moonlight, more elaboration of a tedious spoof.\r\nThere is no sign that Mr. Polanski was pointing towards some sly satiric jest, some arrangement of weird allegory so that his society of vampires would have significance apt for today. He was evidently only trying to make fun of horror films, forgetting that horror films, played straight, are now more often funny—unconsciously to—than horrible.\r\nFor the New York Times: Bosley Crowther, November 14, 1967\r\n\r\n\r\nTitle\r\nThe Fearless Vampire Killers\r\n\r\nYear\r\n1966\r\n\r\nDirector\r\nRoman Polanski\r\n\r\nProduced by\r\nGene Gutowski\r\n\r\nStory &amp; Screenplay\r\nGerard Brach &amp; Roman Polanski\r\n\r\nMusic\r\nKrysztof Komeda\r\n\r\nStarring\r\nJack MacGowran - Sharon Tate - Alfie Bass\r\nand\r\nFerdy Mayne\r\n\r\nTime\r\n107m\r\n\r\n\r\nFilesize\r\n1580 Mb\r\n\r\nFormat\r\nXviD - AVI\r\n\r\nLanguages\r\nItalian - English\r\n\r\nSubtitles\r\nItaliano Non Udenti - English SDH","torrent":{"xt":"urn:btih:0a6cfa63f8b357c35144b1e3c0dcfc96f4f5834c","amp;dn":"The+Fearless+Vampire+Killers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a6cfa63f8b357c35144b1e3c0dcfc96f4f5834c","infoHashBuffer":{"type":"Buffer","data":[10,108,250,99,248,179,87,195,81,68,177,227,192,220,252,150,244,245,131,76]},"announce":[],"urlList":[]}}