{"title":"Midwinter.of.the.Spirit.s01e02.EN.SUB.WEBRIP.[MPup]","uid":12523338,"size":538902026,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ad376a9e72388c813a6e65811c7dfc4a19be7a3&amp;dn=Midwinter.of.the.Spirit.s01e02.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1443958386,"description":"Midwinter.of.the.Spirit.s01e02.EN.SUB.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 896x504\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]2 of 3[/b]\r\n\r\nPart two of a supernatural thriller. Priest Merrily Watkins assists police investigating two murders, a desecrated church and the apparent suicide of a clergyman.\r\n\r\n[img]http://extraimago.com/images/2015/10/02/a5b184eb9d5c5bf44f8ac96fd9994ef5.jpg[/img]\r\n\r\nA murder, a desecrated church and the apparent ‘suicide’ of a clergyman, sends Merrily on a quest for answers. Although she suspects a Satanic group may be at work, nothing can prepare Merrily for what she uncovers next.\r\n \r\nDespite the evidence, Merrily doesn’t believe for one minute that Dobbs’ took his own life and when her services are required to bless a desecrated church, she can’t help but think that, after Dobbs and the crucifixion, this sacrificial act is more than just coincidence. DCI Annie Howe, on the other hand, doesn’t feel that a dead crow is a police matter. As Huw Owen guides Merrily through the ceremony of lesser exorcism she ‘sees’ the evil Denzil Joy and runs from the church. Shaken.\r\n \r\nDobbs’ cleaner claims that Dobbs was a good man who deteriorated after a visit from a bearded stranger. She would hear chanting coming from the TV and he forever had his head in a book about Medieval Hereford Bishop, St Thomas Cantilupe. Having promised to return Edna’s key, Merrily lets herself into Dobbs’ home in search of clues.  What she discovers sickens her to the core and prompts the police to step up their investigation and order a new post mortem for Dobbs.\r\n \r\nAfter a shaky start, Merrily confides in Lol; her workload is taking its toll on her home-life.  Lol’s ears prick up at the mention of a crow at the desecrated church; his client, Rowenna, found a crow on her doorstep just days earlier.  When he confronts her, Rowenna is blasé about the whole thing, claiming an affinity with the creatures. His concerns far from put to rest, Lol delves into Rowenna’s past, which is disturbed to say the least.  \r\n \r\nFearing that she is losing her daughter Merrily has it out with Jane, demanding to know just who she is hanging out with.  Jane tells her that she’s dating Hereford’s ‘Boy Bishop’, James Lyden.  She thought her mother might be pleased about that, but no!  The questioning only serves to drive a bigger wedge between the two of them. Jane delivers some home truths leaving Merrily broken.  Merrily seeks solace in the church, alone in prayer, or is she?","torrent":{"xt":"urn:btih:0ad376a9e72388c813a6e65811c7dfc4a19be7a3","amp;dn":"Midwinter.of.the.Spirit.s01e02.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ad376a9e72388c813a6e65811c7dfc4a19be7a3","infoHashBuffer":{"type":"Buffer","data":[10,211,118,169,231,35,136,200,19,166,230,88,17,199,223,196,161,155,231,163]},"announce":[],"urlList":[]}}