{"title":"Robert Day - The Haunted Strangler (1958)","uid":5299985,"size":1406464258,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0cd4ef6a2d9c714d176d1e08fedad577b505a881&amp;dn=Robert+Day+-+The+Haunted+Strangler+%281958%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"lord_terabyte","files":-1,"time":1264187334,"description":"Robert Day - The Haunted Strangler AKA Grip of the Strangler (1958)\n\ndual audio with Criterion extras\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0051706&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0051706&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img248.imageshack.us/img248/3271/stranglercover2ko.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img248.imageshack.us/img248/3271/stranglercover2ko.jpg&lt;/a&gt;\n\nIn England in 1860, a one-armed man is hung as the Haymarket Strangler; twenty years later, a crusading novelist researching the case discovers that the dead man was not the guilty party after all--a theory proven when the killer returns!\n\nBoris Karloff stars in The Haunted Strangler as James Rankin, a writer with an interest in curing society's ills. He intends to use his latest effort to prove that due to the fact that the impoverished can't afford proper legal aid, innocent men are often condemned. Doing just a little detective work with his assistant, Dr. McColl (Tim Turner), Rankin begins to create an alternate theory regarding the young doctor who both performed the autopsies on all of the murdered women and can be placed at the scene when the hanged man was identified. The Haymarket Strangler's modus operandi was to choke his female victims with one hand, and when that had done as much damage as it could, he would slice them up with a knife. Thus, when a dancing girl, Cora (Jean Kent), saw a one-armed man fleeing after murdering one of her co-workers, the case was apparently cracked.\n\n\n\nExcept that there could have been other explanations for the killer only using one arm, and new clues lead Rankin to believe that the key to the case is the missing knife used by the killer. Find it, and maybe then the connection to the missing doctor will follow. Believing that the instrument of death was stashed with the corpse of the wrongfully accused, Rankin digs up the casket. Inside, amongst the dirt and bones, he finds what he seeks, but he also gets more than he bargained for. With the surgical scalpel in hand, Rankin is transformed into the Haymarket Strangler!\n\nThe Haunted Strangler (known as Grip of the Strangler in the UK) was the inaugural production effort of Richard Gordon, whose film background had included publicity and distribution before Boris Karloff convinced him to put up the cash for a story writer Jan Read had put together for the legendary horror actor. Made simultaneously with the sci-fi shocker Fiend Without a Face, Gordon dialed into the exploitation formula from the get-go. Though The Haunted Strangler makes pretenses of being about greater social issues, it's the luridness of the plot and the setting that dominates. Karloff's Rankin may be interested in correcting injustices, and the subtext in regards to whom the victims are, both the hanged man and the strangler's women, is that there is a segment of society that exists beyond the benefit of law and order. All such concerns are quickly set aside, however, making way for the brutal descriptions of the sexually motivated slayings and the scuffles between the possessed writer and police. Shots of whipped prisoners with bloody lashes across their backs or Karloff slicing up a guard's face with broken glass are pretty graphic for 1958, as is the twisted psychology that motivates the murders. Multiple scenes of cancan girls and a champagne spilled down Vera Day's cleavage also add to the idea that The Haunted Strangler wasn't really a high-falutin' social drama. Screams and titillation are the order of the day!\n\n\n\nAre these shots just for cheap gawking, or are they foreshadowing of the defilement to come? Pretty soon, that pretty neck will be wrung and that porcelain skin will be stained with blood.\n\n\n\nThe picture was designed specifically for Karloff, and it's very much his vehicle. His transformation from moralistic novelist to psycho killer is done without the benefit of make-up or prosthetics. Karloff's only special effect is his body. He gnarls his hand into a claw and contorts his face so that one side looks like it's stuck in a permanent flinch, like he was punched and never recovered. Though it looks slightly comical by today's standards, Karloff gives 100% of himself to the performance. There seems to be added psychology in the fact that the malformed arm and the pinched half of his face are on two different sides of his body. He's no mere Jekyll and Hyde split in twain, but a far more twisted creature.\n\nThe story here, complete with the scenes of grave robbing and mental asylums, reminds me of two pictures Karloff made under the aegis of producer Val Lewton a decade prior: The Body Snatcher and Bedlam. As with those two movies, here Karloff and director Robert Day relied less on scare tactics and more on the overall spooky mood they were able to draw out of the settings and situations. Though not as tightly crafted as the Lewton pictures (the skeletons in the graveyard here are laughably fake), The Haunted Strangler still succeeds as pure popcorn entertainment. The Gordon Bros. (sibling Alex got into the movie game, as well) made up for a lack of budget by giving the kind of visceral sights and frights they knew audiences wanted, and the pleasures are simple and universal enough, that they still have kick half a century later.\n\n\n\nThe Haunted Strangler is part of the four-movie Monsters and Madmen boxed set, and I'd be remiss if I didn't note that the cover artwork was created by popular comic book artist Darwyn Cooke, creator of DC: The New Frontier and currently at work adapting the Richard Stark series of Parker crime novels into a series of comics. Cooke uses a style here that is both reminiscent of 1950s movie posters as well pulp and sci-fi novels, but still with enough of a personal twist that they match his own unique vision. For The Haunted Strangler, he fulfills Rankin's goal of keeping the victim front and center, but also matches the exploitation style by dressing the dead girl in a sexy cancan outfit. Karloff's mangled visage occupies the background, looming over the deceased as well as the tinier image of Rankin digging in the graveyard in the lower right corner. With its streaks of blood and muddy color palette, it's an evocative piece that makes the consumer want to see the movie and then rewards us even further after we have, when knowing what all the symbols mean gives the picture added power.\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard01-21.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard01-21.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard02-20.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard02-20.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard03-22.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard03-22.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard04-22.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard04-22.png&lt;/a&gt;\n\n-------my rip---\n\n~~~~~~ The Haunted Strangler.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,205,450,752                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:18:44                \nFrame Count:....................................113242             \nFrame Width (pixels):...........................640                  \nFrame Height (pixels):..........................480                  \nAspect Ratio:...................................1.333                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1771                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.240&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................128                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\n\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE \n\n\n","torrent":{"xt":"urn:btih:0cd4ef6a2d9c714d176d1e08fedad577b505a881","amp;dn":"Robert+Day+-+The+Haunted+Strangler+%281958%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cd4ef6a2d9c714d176d1e08fedad577b505a881","infoHashBuffer":{"type":"Buffer","data":[12,212,239,106,45,156,113,77,23,109,30,8,254,218,213,119,181,5,168,129]},"announce":[],"urlList":[]}}