{"title":"Ted.2.2015.UNRATED.FRENCH.WEBRiP.XViD-AViTECH","uid":12522178,"size":1468516352,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1044d16762a83e67d1fc5c6e1cf3ed5017c242cb&amp;dn=Ted.2.2015.UNRATED.FRENCH.WEBRiP.XViD-AViTECH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"annuaireweb","files":1,"time":1443895716,"description":"Les deux meilleurs amis du monde vont cette fois-ci s’aventurer en territoire totalement inconnu : le moment est venu de légaliser l’existence de Ted. Nos deux compères vivent toujours à Boston, mais alors que John est désormais célibataire, Ted a emménagé avec Tamy Lynn, la bombe de ses rêves. Alors qu’ils traversent leurs premiers orages maritaux, ils décident de faire un enfant pour consolider leur couple. Leurs espoirs sont brisés lorsque la cour du Massachussetts refuse de reconnaître le statut de personne à Ted, et lui octroie celui de « propriété », ce qui le rend inapte à l’adoption. Il est licencié de son travail au magasin et informé sans autre forme de procès que son mariage est annulé. Furieux et dégoûté, Ted va canaliser sa frustration sur la restauration de ses droits, et demander à son meilleur ami de l’aider à poursuivre en justice la Cour du Massachussetts. Ils engagent alors en tant qu’avocat une jeune activiste de la légalisation de la marijuana : Samantha L. Jackson. Mais Ted est débouté. Le trio s’embarque alors dans un road trip vers New York afin de tenter de convaincre le célèbre avocat des droits civils Patrick Meighan de porter leur dossier en appel. Leur but est de prouver qu’un ours en peluche accro à la bière et à la fumette a les mêmes droits que n’importe quel Américain accro à la bière et à la fumette","torrent":{"xt":"urn:btih:1044d16762a83e67d1fc5c6e1cf3ed5017c242cb","amp;dn":"Ted.2.2015.UNRATED.FRENCH.WEBRiP.XViD-AViTECH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1044d16762a83e67d1fc5c6e1cf3ed5017c242cb","infoHashBuffer":{"type":"Buffer","data":[16,68,209,103,98,168,62,103,209,252,92,110,28,243,237,80,23,194,66,203]},"announce":[],"urlList":[]}}