{"title":"Hands Off (1987)","uid":12505120,"size":878743431,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:10919bb830a87f9a79972b35a62130b2de46c15d&amp;dn=Hands+Off+%281987%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1443437789,"description":"Cover: \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1297\r\n\r\nPreview: \nhttp://aveimage.biz/?cmd=browse&amp;view=1&amp;id=1298\r\n\r\nHands Off (1987)\r\n\r\nStarring: Tracey Adams, Shanna McCullough, Keisha, John Leslie, Mike Horner, Rex Nemo.\r\nCategories: Classic\r\nDate Added: 1987\r\n(858 Mb)\r\n\r\nDirector Anthony Spinelli is at the top of his game with this dazzling and moody stunner. Youthfully delicious Shanna McCullough stars as a woman who has made it to the top of the business world, but at the cost of her personal life. She begins having vivid, startlingly sensual sexual fantasies, spurred on by the incessant phone calls of a mysterious admirer. This unknown caller drives Shanna wild with his filthy-mouthed tales of torrid good times, and she becomes determined to find out who is behind it. Along the way, of course, she has time to delve into all manner of fiery fantasies, from lusty lesbian liaisons to full-throttle trysts with various sexy guys around the office. Spinelli weaves a wanton web of desire and debauchery, and he pulls some of the best performances ever from his youthful and willing cast. Shanna has never been better, sporting her delectably ripe natural curves and exuding a girl-next-door aura as she becomes more and more sensually obsessed. In the end, it's unclear who's the more excited -- Shanna or her enigmatic caller. When the two finally meet, the sparks fly as they get down and dirty in a passionate, feverish fling that sends the video into the erotic stratosphere. An undisputed hardcore classic!","torrent":{"xt":"urn:btih:10919bb830a87f9a79972b35a62130b2de46c15d","amp;dn":"Hands+Off+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10919bb830a87f9a79972b35a62130b2de46c15d","infoHashBuffer":{"type":"Buffer","data":[16,145,155,184,48,168,127,154,121,151,43,53,166,33,48,178,222,70,193,93]},"announce":[],"urlList":[]}}