{"title":"Dierks Bentley - Lot Of Leavin' Left To Do  (2nafish)","uid":5292744,"size":163547140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:10c9cbab172928dd7e9bb695f4729756bb1d00be&amp;dn=Dierks+Bentley+-+Lot+Of+Leavin%5C%27+Left+To+Do++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1263948245,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Lot of Leavin' Left to Do&quot; is a song co-written and recorded by country music artist Dierks Bentley. It is the lead-off single to his 2005 album Modern Day Drifter. It peaked at #3 in the United States, while it was a number-one in Canada.\n\nThe music video was directed by Sam Erickson. It reached #1 on CMT's Top 20 Countdown in the summer of 2005.\n\nModern Day Drifter is the second album of country music singer Dierks Bentley. It was released May 10, 2005. His second album for Capitol Records Nashville, it produced three singles on the Billboard Hot Country Songs charts: the #3 &quot;Lot of Leavin' Left to Do&quot;, and the Number One hits &quot;Come a Little Closer&quot; and &quot;Settle for a Slowdown&quot;.\n\nDierks Bentley (born November 20, 1975 in Phoenix, Arizona) is an American country music artist who has been signed to Capitol Records Nashville since 2003. That year, he released his self-titled debut album. Both it and its follow-up, 2005's Modern Day Drifter, are certified platinum in the United States. A third album, 2006's Long Trip Alone, is certified gold. It was followed in mid 2008 by a greatest hits package. His fourth album, Feel That Fire was released in February 2009.\n\nBentley's studio albums have accounted for thirteen singles on the country singles charts, of which seven have reached No. 1: his debut single &quot;What Was I Thinkin'&quot;, as well as &quot;Come a Little Closer&quot;, &quot;Settle for a Slowdown&quot;, &quot;Every Mile a Memory&quot;, &quot;Free and Easy (Down the Road I Go)&quot;, &quot;Feel That Fire&quot; and &quot;Sideways&quot;. Four more of his singles have reached Top Five on the country charts as well.\n\nBentley's second Capitol album, Modern Day Drifter, was released in 2005. It featured two No. 1 singles on the Hot Country Songs chart, &quot;Settle for a Slowdown&quot; and &quot;Come a Little Closer.&quot; A third single, &quot;Lot of Leavin' Left to Do&quot;, reached No. 3. The album was also certified platinum.\n\nLater in 2005 Bentley won the CMA Award for the Horizon Award (now Best New Artist) and was invited to be a member of the Grand Ole Opry. The induction took place on October 1, 2005. Bentley stands as the third youngest member after Carrie Underwood and Josh Turner.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:10c9cbab172928dd7e9bb695f4729756bb1d00be","amp;dn":"Dierks+Bentley+-+Lot+Of+Leavin%5C%27+Left+To+Do++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10c9cbab172928dd7e9bb695f4729756bb1d00be","infoHashBuffer":{"type":"Buffer","data":[16,201,203,171,23,41,40,221,126,155,182,149,244,114,151,86,187,29,0,190]},"announce":[],"urlList":[]}}