{"title":"One Piece 001-206 [HD WIDESCREEN] [DUAL-AUDIO] [720p] [HEVC]","uid":12616361,"size":27119727351,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:10f2a06c5e95a3baa0cc229b9b71fe50fe115cde&amp;dn=One+Piece+001-206+%5BHD+WIDESCREEN%5D+%5BDUAL-AUDIO%5D+%5B720p%5D+%5BHEVC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"devlin85","files":219,"time":1445521599,"description":"[DONATIONS WELCOME]\r\n\r\nBitcoin Address (BTC): 1L1U4MaYvdVvkcZT3bFnVQzLdyHzXd2HdT\r\nLitecoin Address (LTC): LMrvbumxvFP2KQEGUe3LwRwEY4ZgFXpRvD\r\nPeercoin Address (PPC): PEfr11jrfxSB6BJtCk18w9EqEbtXPXSsE9\r\n\r\n[SHOW INFO]\r\n\r\nOne Piece (Japanese: ãƒ¯ãƒ³ãƒ”ãƒ¼ã‚¹ Hepburn: Wan PÄ«su) is a Japanese manga series written and illustrated by Eiichiro Oda. It has been serialized in Shueisha's Weekly ShÅnen Jump magazine since July 19, 1997, with the chapters collected into seventy-eight tankÅbon volumes to date. One Piece follows the adventures of Monkey D. Luffy, a young man whose body gains the properties of rubber after unintentionally eating a Devil Fruit. With his diverse crew of pirates, named the Straw Hat Pirates, Luffy explores the ocean in search of the world's ultimate treasure known as &quot;One Piece&quot; in order to become the next Pirate King.\r\n\r\nThe manga has been adapted into an original video animation (OVA) produced by Production I.G in 1998, and an anime series produced by Toei Animation, which began broadcasting in Japan in 1999 and has aired 700 episodes to date.\r\n\r\nThe series begins with the execution of Gol D. Roger, a man known as the King of the Pirates (æµ·è³ŠçŽ‹ KaizokuÅ). Just before his death, Roger announces that his treasure, the One Piece (ã²ã¨ã¤ãªãŽã®å¤§ç§˜å® (ãƒ¯ãƒ³ãƒ”ãƒ¼ã‚¹) Wan PÄ«su), will be available to anyone who finds it, beginning the Great Pirate Era (å¤§æµ·è³Šæ™‚ä»£ Daikaizokujidai). As a result, countless pirates set out to the Grand Line to look for the treasure.\r\n\r\n[PLOT - SPOILER ALERT]\r\n\r\nTwenty-two years have passed since Roger's execution, and Monkey D. Luffy, a young man inspired by his childhood idol and powerful pirate &quot;Red Haired&quot; Shanks, sets off on a journey from the East Blue sea to find the One Piece and proclaim himself as the King of the Pirates. In an effort to organize his own crew, the Straw Hat Pirates (éº¦ã‚ã‚‰æµ·è³Šå›£ç¯‡ Mugiwara Kaizoku-dan?), Luffy rescues and befriends a swordsman named Roronoa Zoro, and they head off in search of the One Piece. They are joined by Nami, a navigator and thief; Usopp, a sniper and a liar; and Sanji, a womanizing chef; in their journey, they acquire a ship named the Going Merry and engage in confrontations with pirates including Buggy the Clown, Captain Kuro and Don Krieg. Later, Luffy encounters Arlong, a fishman and member of the former Sun Pirates who thinks that fishmen are superior to humans. After Luffy defeats Arlong, Nami officially joins Luffy's crew and the Navy places a bounty on Luffy's head. Luffy, then meets Captain Smoker, a Navy captain who can turn into smoke. He briefly captures Luffy, but Luffy is saved by his father, Monkey D. Dragon. After making their way through the Grand Line, the group meets Nefeltari Vivi, a princess who wants to help save her country, the Alabasta Kingdom, from the crime syndicate Baroque Works. They later befriend the doctor and anthropomorphized reindeer Tony Tony Chopper while in Drum Island.\r\n\r\nThe Straw Hat Pirates arrive in Alabasta, leading to battles with Baroque Works and their leader, Sir Crocodile. Luffy finally defeats Crocodile and liberates Alabasta. Soon after, Nico Robin, an archaeologist formerly employed by Baroque Works, joins Luffy's crew. They soon encounter Blackbeard, the alias of Marshall D. Teech, who also aspires to become the King of the Pirates. After traveling to the floating island of Skypiea, the crew gets involved in a war between the Skypieans and the Shandorians, leading to a confrontation against the island's ruler, Eneru, who has the power of lightning.\r\n\r\n[TECHNICAL DETAILS]\r\n\r\nSource: Torrent: One Piece 001-206 [SPECIAL E...ESCREEN] [DUAL-AUDIO] [720p]\r\n\r\n\r\nFile Container: MKV\r\nVideo Format: h.265/HEVC [8-bit]\r\nVideo Resolution: 1280x720\r\n\r\nAudio Type: 2 Channel Stereo\r\nTrack 1: Japanese\r\nTrack 2: English\r\nAudio Format: AAC-LC\r\n\r\nSubtitle Language: English\r\nSubtitle Format: SSA/SubStation Alpha","torrent":{"xt":"urn:btih:10f2a06c5e95a3baa0cc229b9b71fe50fe115cde","amp;dn":"One+Piece+001-206+%5BHD+WIDESCREEN%5D+%5BDUAL-AUDIO%5D+%5B720p%5D+%5BHEVC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10f2a06c5e95a3baa0cc229b9b71fe50fe115cde","infoHashBuffer":{"type":"Buffer","data":[16,242,160,108,94,149,163,186,160,204,34,155,155,113,254,80,254,17,92,222]},"announce":[],"urlList":[]}}