{"title":"Monument Builders - Golden Gate v1.0.1","uid":12507825,"size":142946256,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:110556fd1d7a0aab21cc971321c4c994b81a00b7&amp;dn=Monument+Builders+-+Golden+Gate+v1.0.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Androider","files":2,"time":1443479062,"description":"Participate in the construction of the most famous monument in San Francisco. The Golden Gate Bridge!\r\n\r\nIn Monument Builders: Golden Gate, oversee the construction of the most legendary bridge in the United States and learn many stories about it!\r\nAs the head engineer, you are going to have to build this 2,737-meter long bridge, which, without people realizing it, will become one of the seven wonders of the modern world.\r\n\r\nIn order to manage this huge worksite, you have to produce different resources and call upon a large number of workers. Requirements in cement, concrete, steel and wood are colossal. Help Joe Bentman, who has the great responsibility of managing this project by bringing together the resources required for the construction works, coordinating his workers effectively and tackling the many difficulties. \r\n\r\nAnd there are a host of challenges to face, with the Golden Gate strait being renowned for its great natural constraints: dangerous currents, violent winds and sea mists laden with corrosive salt. All of this represents major obstacles to the construction of such a structure.\r\n\r\nFinally, do not forget to talk to the journalists who will be following the building works down to the smallest detail. The inauguration is planned for 27 May 1937, namely more than four years after the start of the works! The inhabitants of San Francisco are impatient to be able to cross the bridge on foot, by bicycle or by car.\r\nDiscover the Resource Management series &quot;Monument Builders&quot;.\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.microids.google.goldenbridgefull\r\n\r\n\r\nInstructions:\r\n\r\n1.Copy 'com.microids.google.goldenbridgefull' folder to 'sdcard/Android/obb'\r\n2.Install APK\r\n3.Launch the game","torrent":{"xt":"urn:btih:110556fd1d7a0aab21cc971321c4c994b81a00b7","amp;dn":"Monument+Builders+-+Golden+Gate+v1.0.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"110556fd1d7a0aab21cc971321c4c994b81a00b7","infoHashBuffer":{"type":"Buffer","data":[17,5,86,253,29,122,10,171,33,204,151,19,33,196,201,148,184,26,0,183]},"announce":[],"urlList":[]}}