{"title":"Aria The Natural 06/26 - DivX ac3 ITA JAP - DVDrip","uid":5291654,"size":397379584,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1215224ca3d5edad472d3b382b4ea63f9bc1011d&amp;dn=Aria+The+Natural+06%2F26+-+DivX+ac3+ITA+JAP+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"salvoiorfida","files":1,"time":1263919052,"description":"Introduzione:\n\nARIA (???, ARIA) ÃƒÂ¨ un manga di Kozue Amano edito in Giappone dalla casa editrice Mag Garden e in Italia dalla Star Comics composto da 12 volumetti, giunti all'ottavo volume la pubblicazione in Italia ÃƒÂ¨ stata interrotta, solo di recente la Star Comics ha annunciato la pubblicazione dei volumi rimanenti entro la fine del 2009.\n\nLa serie ÃƒÂ¨ nata sotto il titolo AQUA pubblicata da Enix, per poi cambiare nome al cambio di editore. AQUA funge da antefatto ad ARIA ed ÃƒÂ¨ raccolto in due volumi. Il dodicesimo e ultimo volume di ARIA ÃƒÂ¨ uscito il 10 marzo 2008 .\n\nDal manga ÃƒÂ¨ stato tratto un anime (inedito in Italia) diviso in piÃƒÂ¹ parti: ARIA The ANIMATION (13 episodi), ARIA The NATURAL (26 episodi) e ARIA The ORIGINATION (14 episodi). Esiste inoltre un OAV dal titolo ARIA The OVA ~Arietta~ pubblicato prima dell'inizio della terza serie. I diritti per la distribuzione in Italia delle serie animate e dell'oav Arietta sono stati acquisiti dalla Yamato Video con un'anteprima della prima serie sul canale satellitare RaiSat Smash Girls.\n\nVentisei puntate per immergersi nell'azzuro mare di Neo Venezia.\nL'anime, tratto dall'omonimo manga, ne segue fedelmente le orme portandoci nel meraviglioso universo del pianeta Acqua.\nUn character design bello, lineare e plulito, veramente molto simile al manga, a cui si uniscono colori brillanti e armoniosi, che contribuiscono a rendere ancora piÃƒÂ¹ realistici i paesaggi.\n\nOttimamente caratterizzati i personaggi, che nell'anime sono resi ancora piÃƒÂ¹ vividi.\n\nTrama:\n\nSiamo sull'ex pianeta Marte (ora chiamato &quot;Aqua&quot;), il cui clima ÃƒÂ¨ tenuto sotto controllo da isole volanti sorvegliate dai Salamander.\nMarte/Acqua ÃƒÂ¨ un pianeta verde su cui domina il mare; gli emigranti ne hanno voluto cosÃƒÂ¬ fare una copia di Venezia, la bella cittÃƒÂ  acquatica che sta sparendo inghiottita dal mare.\nLa storia viene narrata/vissuta da Akari, che dalla terra emigra per diventare una Undine; una gondoliera....\n\nDettagli: \n\nLingue: Italiano - japponese\nFormato Video: DivX 4:3 640 x 480 pixel\nFormato Audio: ac3 6 canali 384 kb/s dolby , ac3 2 canali 192 kb/s stereo\nDimensione : 340 mb circa\n\nMORE INFO AT:\n     &lt;a href=&quot;\nhttp://www.tntvillage.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tntvillage.tk&lt;/a&gt;\t","torrent":{"xt":"urn:btih:1215224ca3d5edad472d3b382b4ea63f9bc1011d","amp;dn":"Aria+The+Natural+06%2F26+-+DivX+ac3+ITA+JAP+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1215224ca3d5edad472d3b382b4ea63f9bc1011d","infoHashBuffer":{"type":"Buffer","data":[18,21,34,76,163,213,237,173,71,45,59,56,43,78,166,63,155,193,1,29]},"announce":[],"urlList":[]}}