{"title":"Creed - Rain  (2nafish)","uid":5296047,"size":116092932,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:12622e3a866cf67495d122b4eed0dbbd905303c5&amp;dn=Creed+-+Rain++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264063182,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Rain&quot; is a song written and performed by Creed. It is their second single from their 2009 album, Full Circle.\n\nThe single was released through MSN Music on September 22, 2009, hit radio airplay September 23, 2009, and was released as a digital download on October 6, 2009 on iTunes and other digital retailers.\n\nThe feedback for the song has been positive, and has been competing in rank on sites such as iTunes against &quot;Overcome&quot;. It has reached #91 on the Billboard Hot 100 and #67 on the Billboard Digital Songs. It has since re-entered the Hot 100 at #91, matching its previous peak. &quot;Rain&quot; also made its debut in the ARIA Charts at number 66 in Australia.\n\nA video onfrom MyContent.com showed the recording of the music video for Rain, which premiered on October 27, 2009. The video eventually premiered a day early.\n\nFull Circle is the fourth album by the American rock band Creed, released on October 27, 2009. It is Creed's first release since their 2004 compilation album Greatest Hits, their first studio album since 2001's Weathered, and their first studio album to feature original bassist Brian Marshall in almost exactly a decade. The record was produced by Howard Benson. The album was completed on July 31, 2009, as announced by Scott Stapp. Four days later, the album cover was revealed through the band's official e-news.\n\nCreed is an American Christian rock band from Tallahassee, Florida, that became popular in the late 1990s and early 2000s. The band disbanded in 2004 after three multi-platinum albums, selling 26 million records in the United States and an estimated 35 million records worldwide. The band reformed in 2009.\n\nCreed formed after Scott Stapp and Mark Tremonti, friends at Florida State University and high school classmates at Orlando's Lake Highland Preparatory School, decided to form a band, recruiting Brian Marshall and Scott Phillips to complete the quartet in late 1994. The band was originally called Naked Toddler, Marshall later suggested the name Creed after the band he played in named Maddox Creed.\n\nThe four members had already written and collaborated three of the songs that would go on to become tracks on their chart-topping debut album My Own Prison. The songs were &quot;One&quot;, &quot;Sister&quot; and &quot;What's This Life For&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:12622e3a866cf67495d122b4eed0dbbd905303c5","amp;dn":"Creed+-+Rain++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12622e3a866cf67495d122b4eed0dbbd905303c5","infoHashBuffer":{"type":"Buffer","data":[18,98,46,58,134,108,246,116,149,209,34,180,238,208,219,189,144,83,3,197]},"announce":[],"urlList":[]}}