{"title":"Becoming Mona Lisa, Making of a Global Icon (Art Ebook).pdf","uid":12502359,"size":81334453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13f474481fbd5803583aa5c0f086949ff36c169d&amp;dn=Becoming+Mona+Lisa%2C+Making+of+a+Global+Icon+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":1,"time":1443387352,"description":"Becoming Mona Lisa: The Making of a Global Icon\r\nHarcourt, Inc | 2001 | ISBN: 0151008280 | English | 348 pages | PDF | 77.6 MB\r\n\r\nPerhaps better than any other art object, the Mona Lisa demonstrates that something can be high art and pop, classic and cool. Donald Sassoon provides a fascinating account of how Leonardo da Vinci's masterpiece became what it is today. He examines how the Renaissance genius created the picture, who the subject was, why it gained its unrivalled position in the art world, and how it has come to be used and abused by other artists and the international advertising industry. Tracing the reception of da Vinci's paintings as well as the development of the museums, essential to bringing art to a broad public audience, Sassoon's account is as much the story of serious art's popularization as it is of one painting's ascendance to the status of global icon. Brilliantly illustrated, this lively, engaging narrative is meticulously researched and written in an elegant, accessible prose. Facts Behind the Smile 1) The most commonly asked question at the Louvre: Where is the Mona Lisa? 2) In 2003, the Mona Lisa will become the only painting in the Louvre to occupy its own room. 3) As well as hanging in the Louvre, the Mona Lisa appears on mugs, ashtrays, calendars, folders, T-shirts, and mousepads. 4) Eighty-five percent of all Europeans think the Mona Lisa is the best-known painting in the world","torrent":{"xt":"urn:btih:13f474481fbd5803583aa5c0f086949ff36c169d","amp;dn":"Becoming+Mona+Lisa%2C+Making+of+a+Global+Icon+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13f474481fbd5803583aa5c0f086949ff36c169d","infoHashBuffer":{"type":"Buffer","data":[19,244,116,72,31,189,88,3,88,58,165,192,240,134,148,159,243,108,22,157]},"announce":[],"urlList":[]}}