{"title":"DvdReMakePro.3.6.3.cracked","uid":5298390,"size":4187983,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:15daf5765565aa7b071d25a376304bac3c4e7762&amp;dn=DvdReMakePro.3.6.3.cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jesusalv","files":2,"time":1264134965,"description":"DvdReMake Pro is a powerful, yet intuitive DVD editor that will let you change content, appearance and navigation of a DVD disk without the need for complete disk re-authoring.\n\nUsing unique editing features of the DvdReMake Pro you can completely customize your DVD backups, fix authoring errors, merge DVDs or even compile a new DVD from bits and pieces of other DVD disks.\n\n  \tMain DvdReMake Pro features\n \n\nIn addition to the DvdReMake capabilities DvdReMake Pro provides all the functionality needed to edit DVDs:\n\n    * Put multiple DVDs together preserving original menus;\n    * Trace disk navigation with build-in DVD debugger;\n    * Replace menu background with still;\n    * Move and insert new chapters on an existing dvd;\n    * Edit VM commands (all commands and valid combinations are supported);\n    * Edit and create new TitleSets, Titles, Chapters, ProgramChains, Programs;\n    * Delete TitleSets, Titles, Chapters, ProgramChains, Programs;\n    * Move TitleSets, ProgramChains, commands within the disk or between different DVDs;\n    * Find DVD navigation errors;\n    * Reorder menu buttons;\n    * Easily follow DVD navigation using &quot;Goto Destination&quot; and History pane;\n    * Change properties of the video, audio and subpicture tracks;\n    * Modify buttons and color schemes in either still or motion menus;\n    * Easily change highlights colors. \n\nDvdReMake Pro will even fix incorrectly authored/edited disks. If mismatch between information in ifo and vob files is found program will try to fix the problem. \n\nNotice - one executable - No installation or unistallation is needed. You are free to move it on your system.","torrent":{"xt":"urn:btih:15daf5765565aa7b071d25a376304bac3c4e7762","amp;dn":"DvdReMakePro.3.6.3.cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15daf5765565aa7b071d25a376304bac3c4e7762","infoHashBuffer":{"type":"Buffer","data":[21,218,245,118,85,101,170,123,7,29,37,163,118,48,75,172,60,78,119,98]},"announce":[],"urlList":[]}}