{"title":"Bopup.Observer.v5.5.4.One.Way.Alert.Messenger.LAN.Office.Multili","uid":12558792,"size":11648111,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1629ea748a0e5fb0ec740e6f7d038161775a63f7&amp;dn=Bopup.Observer.v5.5.4.One.Way.Alert.Messenger.LAN.Office.Multili&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"boffon","files":12,"time":1444676348,"description":"Bopup Observer version 5.5.4.8173\r\nSecure one-way instant messenger for alerting and notification purposes\r\n\r\nThis torrent includes English, German, Spanish, French, Dutch, Italian \r\nand Russian setup packages of the product.\r\n========================================================================\r\n\r\n\r\n\r\nOverview\r\n------------------------------------------------------------------------\r\n\r\nBopup Observer is a secure one-way messenger designed for alerting and \r\nnotification purposes. This clear, easy to use and light-weight IM \r\nclient can be deployed on LAN or enterprise-size networks and helps you \r\nkeep users informed and updated instantly. \r\n\r\nThe messenger supports rich-text messages including links, font and \r\ncolor formatting, emoticons, and it can receive files and directories \r\nfrom the IM server and other users. You can get urgent messages or \r\nactivate the Confirmation Mode on the IM server that pops up the program \r\nwhen a message is received and keeps it on top until the user clicks the \r\nConfirm Message button. \r\n\r\nMessaging and File Transfer are encrypted with strong algorithms so that \r\npersonal and group conversations are safe and secure even if you receive \r\nmessages and files via the Internet. You will never lose any information \r\nyou receive because offline messages and transfers are stored and \r\nautomatically delivered by the server when the recipient goes online. \r\n\r\nNo user experience and skills are needed to use the program. The smart \r\nand comfortable user interface with advanced usability options and popup \r\nnotifications allows you to join the IM network in a few mouse clicks. \r\nThe messenger completely supports the Terminal Server/Citrix environment \r\nand can be used simultaneously by multiple users on one computer. Bopup \r\nObserver can automatically download and install updates from the IM \r\nserver. \r\n\r\nThe centralized client/server architecture offers complete and flexible \r\nmanagement for controlling your IM infrastructure. The central server \r\nlogs all user activity and archives all messages and file transfers with \r\nthe reporting, search and printing options. It allows you to manage \r\nmessaging groups, users' contact information and permissions to send and \r\nview other users, assign and distribute important files and documents to \r\nusers. It is easy to import user accounts from your Active Directory \r\n(LDAP) and start an efficient Instant Messaging system right now. \r\n\r\n\r\n\r\nLimitations\r\n------------------------------------------------------------------------\r\n\r\nThis is 45-day trial version! For advanced details and purchasing \r\ninformation please refer B Labs website and product page at      \nhttp://www.bopup.com/products/observer/\r\n\r\n\r\n========================================================================\r\nCopyright (C) 2000-2015 B Labs. All rights reserved.   \nhttp://www.bopup.com/","torrent":{"xt":"urn:btih:1629ea748a0e5fb0ec740e6f7d038161775a63f7","amp;dn":"Bopup.Observer.v5.5.4.One.Way.Alert.Messenger.LAN.Office.Multili","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1629ea748a0e5fb0ec740e6f7d038161775a63f7","infoHashBuffer":{"type":"Buffer","data":[22,41,234,116,138,14,95,176,236,116,14,111,125,3,129,97,119,90,99,247]},"announce":[],"urlList":[]}}