{"title":"Sailor Moon Super S. cap. 145","uid":5296508,"size":225075200,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:18f4b8e8ca0cb231e571c562515ebef932b4ddf7&amp;dn=Sailor+Moon+Super+S.+cap.+145&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sagleon","files":1,"time":1264080160,"description":"Resulta que aparece el circo en la ciudad y con ÃƒÂ©l el nuevo enemigo. Un Unicornio Pegaso se oculta en los sueÃƒÂ±os de Chibiusa y le pide a esta ayuda, porque unos malvados, Ojo de Pez, Ojo de HalcÃƒÂ³n y Ojo de Tigre, estÃƒÂ¡n buscando al Pegaso para que con ÃƒÂ©l el Ama Circonia pueda apoderarse del mundo, porque, segÃƒÂºn parece, el Pegaso tiene un poder grandÃƒÂ­simo . Para ayudarle le da nuevos poderes tanto a Chibiusa como a Bunny. Ojo de Tigre, Ojo de Pez y Ojo de HalcÃƒÂ³n estÃƒÂ¡n buscando al pegaso en los &quot;espejos del alma&quot;, en donde se ven los sueÃƒÂ±os de la gente. Ojo de Tigre ya ha mirado los sueÃƒÂ±os de Ray, y junto con Ojo de HalcÃƒÂ³n tambiÃƒÂ©n ha mirado los de Carola. Luego el TrÃƒÂ­o Amazonas debido a sus continuos fracasos debÃƒÂ­a encontrar al pegaso, y fueron a parar a Armando, Ojo de Pez se enamorÃƒÂ³ de ÃƒÂ©l y le quitÃƒÂ³ sus sueÃƒÂ±os, pero tampoco estaba en ÃƒÂ©l el pegaso. Ojo de Pez descubre que Chibiusa es la poseedora del Pegaso y manda a Ojo de HalcÃƒÂ³n a por Bunny y le quite sus sueÃƒÂ±os pero se equivoca de blanco y rompe los sueÃƒÂ±os de Bunny, por lo tanto la mata en el acto, tanto a ella como a Chibiusa. Ojo de HalcÃƒÂ³n tambiÃƒÂ©n es herido. Pero para salvar a Bunny Ojo de Pez saca el poder de la bola de Cristal que les convirtiÃƒÂ³ en humanos pero sin sueÃƒÂ±os, y salva a Bunny y a Chibiusa, quienes acaban con el monstruo. Entonces Pegaso, decide ayudar a El TrÃƒÂ­o Amazonas dÃƒÂ¡ndoles el espejo de los sueÃƒÂ±os y una nueva vida. ","torrent":{"xt":"urn:btih:18f4b8e8ca0cb231e571c562515ebef932b4ddf7","amp;dn":"Sailor+Moon+Super+S.+cap.+145","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18f4b8e8ca0cb231e571c562515ebef932b4ddf7","infoHashBuffer":{"type":"Buffer","data":[24,244,184,232,202,12,178,49,229,113,197,98,81,94,190,249,50,180,221,247]},"announce":[],"urlList":[]}}