{"title":"Stossel.2015.09.18.Law.And.Border","uid":12539797,"size":368182166,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:19dc66a4a44a1e85ae0262398e287edf400f1235&amp;dn=Stossel.2015.09.18.Law.And.Border&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BBreach","files":1,"time":1444381633,"description":"_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nJohn F. Stossel is an American consumer reporter, investigative journalist, author, libertarian columnist, and former co-anchor for the ABC News show 20/20. In this show he looks at consumer-focused topics, such as civil liberties, the business of health care, and free trade\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nThe Drug War Makes Border Enforcement More Difficult\r\nJohn Stossel | September 16, 2015\r\n\r\nHow many wars can we fight?\r\n\r\nOur presidential candidates demand &quot;stronger action&quot; against both illegal immigration and illegal drugs. But those goals conflict. The War on Drugs makes border enforcement much harder!\r\n\r\nAmerica's 44-year-long Drug War hasn't made a dent in American drug use or the supply of illegal drugs. If it had some positive effect, prices of drugs would have increased, but they haven't. American authorities say drugs are more available than ever.\r\n\r\nDrug prohibition, like alcohol prohibition, creates fat profits that invite law-breaking.\r\n\r\nCato's Ted Galen Carpenter says, &quot;Economists estimate that about 90 percent of the retail price of illicit drugs is due to this black market premium.&quot; Ninety-percent profits inspire lots of criminal risk-taking.\r\n\r\n&quot;Washington's policy empowers the most ruthless traffickers—those willing to use violence, intimidation and exploitation of the vulnerable to gain market share.&quot; Continues Carpenter: &quot;When drugs are outlawed, only outlaws will sell drugs.&quot;\r\n\r\nSince the drug gangs can't settle disputes in court, they settle them with guns. In Latin America, they've killed thousands of people.\r\n\r\n&quot;Honduras has been living in an emergency,&quot; says Honduran President Juan Hernandez. &quot;The root cause is that the United States and Colombia carried out big operations in the fight against drugs.&quot;\r\n\r\nMexico's former president, Vicente Fox, now supports legalization. Leaders of Guatemala, Colombia, Costa Rica and Bolivia have begun to object to the militaristic anti-drug tactics pushed by the United States.\r\n\r\nYet Hillary Clinton called taxpayer money spent on counter-narcotics efforts in Central America &quot;money well spent.&quot;\r\n\r\nShe's closed-minded and wrong. Our Drug War creates the carnage that drives poor Latin Americans to abandon their villages and move north. That increases resentment against immigrants, as expressed by Donald Trump, who said, &quot;They're bringing drugs, they're bringing crime.&quot; Some do bring drugs, but most wouldn't bring crime if they could legally do business with us.\r\n\r\nOur crazy, failed policy turns our neighbors to the south into a deadly menace.\r\n\r\n&quot;Coyotes,&quot; who help impoverished refugees escape, often require even the children to become drug mules -- to smuggle small amounts of drugs. The children obey, since many fled places where they'd be shot at or tortured by gangs. They know the drug gangs and coyotes are their only hope for reaching a better life.\r\n\r\nDrug profits give smugglers the money  to do what poverty-stricken immigrants can't: dig long, high-tech tunnels with lighting and ventilation systems. A border fence doesn't secure the border when immigrants -- and criminals -- can tunnel underneath it.\r\n\r\nU.S. Attorney Laura Duffy recently bragged to reporters about &quot;the fifth super-tunnel we've intercepted.&quot;\r\n\r\nImmigrations and Customs Enforcement agent Derek Benner claimed that the interception dealt &quot;a stunning blow to the Mexican cartel who built it.&quot;\r\n\r\nBut that's absurd. Benner admitted they'd done the same thing two years before &quot;in virtually the same scenario.&quot; They found five of how many? Hundreds? With a border almost 2,000 miles long, they're unlikely to find them all.\r\n\r\nDrug prohibition, by making drug cartels rich, enables them to build a literal underground railroad to the north. The whole process—dig, build, raid, destroy, repeat—is just one more pointless activity that happens when government tries to suppress popular activities such as drug use","torrent":{"xt":"urn:btih:19dc66a4a44a1e85ae0262398e287edf400f1235","amp;dn":"Stossel.2015.09.18.Law.And.Border","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19dc66a4a44a1e85ae0262398e287edf400f1235","infoHashBuffer":{"type":"Buffer","data":[25,220,102,164,164,74,30,133,174,2,98,57,142,40,126,223,64,15,18,53]},"announce":[],"urlList":[]}}