{"title":"It Runs in the Family (2015).epub Gooner","uid":12530659,"size":2089640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bbbbcc972dfc51042eda33cc2db2e8957435e3f&amp;dn=It+Runs+in+the+Family+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1444250636,"description":"Publisher: OR Books (2015)\r\nLanguage: English\r\nISBN-10: 1939293650\r\nISBN-13: 978-1939293657\r\nASIN: B00SRU3KU2\r\n\r\nParenting is hard. So is being a peacemaker in a violent world. It Runs in the Family is a book about how parents can create lasting and meaningful bulwarks between their kids and the violence endemic in our culture. It posits discipline without spanks or slaps or threats of violence, while considering how to raise thoughtful, compassionate, fearless young people committed to social and political change — without scaring, hectoring or scarring them with all the wrongs in the world. \r\n\r\nFrida Berrigan is a mother and stepmother, wife and daughter. Her parents, Phil Berrigan and Elizabeth McAlister, were a former priest and nun who became nationwide icons for their prophetic witness against war and nuclear weapons, which sometimes resulted in long jail sentences. Berrigan grew up in the community they helped found, Jonah House in Baltimore, and becoming a parent herself has forced her to come to terms with her own upbringing in new ways. \r\n\r\nExpanding on the stories in her popular column for the website Waging Nonviolence, Berrigan has crafted a welcome antidote to the various parenting fads currently on offer from French moms and tiger moms and mean moms. She offers a unique perspective on parenting that derives from hard work, deep reflection, and lots of trial and error","torrent":{"xt":"urn:btih:1bbbbcc972dfc51042eda33cc2db2e8957435e3f","amp;dn":"It+Runs+in+the+Family+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bbbbcc972dfc51042eda33cc2db2e8957435e3f","infoHashBuffer":{"type":"Buffer","data":[27,187,188,201,114,223,197,16,66,237,163,60,194,219,46,137,87,67,94,63]},"announce":[],"urlList":[]}}