{"title":"Ceres [Multilang 3]","uid":12598396,"size":490721770,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1c7d8540f60dfefd94ef280825e5605e3d71573d&amp;dn=Ceres+%5BMultilang+3%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kappel.Eyal","files":1,"time":1445290048,"description":"Title: Ceres \r\nGenre: Action, Indie, RPG, Strategy \r\nPublisher: Iceberg Interactive\t\r\nRelease Date: 16 Oct, 2015 \r\nLanguage: English, German, Russian \r\n\r\nSystem Requirements: \r\nMinimum: \r\nOS: Windows 7, Windows 8 \r\nProcessor: Intel Pentium G3220 @ 3.00GHz or equivalent AMD processor and above \r\nMemory: 2 GB RAM \r\nGraphics: 1 GB nVidia Geforce GT460 or equivalent, 500 MB ATI HD4850 or equivalent \r\nDirectX: Version 9.0 \r\nHard Drive: 2 GB available space \r\nSound Card: DirectX 9 Compatible Audio \r\nAdditional Notes: Minimum Resolution: 1024 x 768  \r\n \r\nAbout This Game \r\nThe solar system is ravaged. The Earth is gone, shattered to pieces. Nothing remains but a huge ring of rocky debris. Nobody knows why the Gate malfunctioned. It was built to connect our world to other stars, but only a handful of colony ships were sent away before disaster struck. The Gate is believed to have unexpectedly connected to the wrong star -one just going nova. Torrents of gravitational waves flooded our solar system and the Earth was immediately obliterated. The Gate then started connecting to random stars, spewing ashes from dying worlds, radiation from younger suns or even drawing in alien lifeforms. The solar system began to change. \r\n\r\nHumans and their machines live on: pockets of civilization have gathered into warring factions. Many adventurers roam the cold wastes in their spaceships, defying death and perils unknown -there are countless tales of monstrous machines and alien creatures preying on hapless ships. Real menaces or mere fantasies ? Who can now part the myth from the ever-changing reality ? \r\n\r\nIn a world where humans, monsters and machine-gods fight for survival, something will eventually have to give. You play the role of a young adventurer, who just got his hands on his first spaceship, and is determined to make a name for himself. A routine scouting mission turns out to be something much greater when you encounter an A.I. called Ceres. \r\n\r\nKey Features: \r\n• Single-player tactical space combat. \r\n• Lead a squadron of ships and fight through a mission-drive storyline the way you see fit. \r\n• Third person view and simple yet deep point-and-click order system. \r\n• Your ships not only unleash deadly lasers or missiles, but it is possible to launch hacking attacks to damage or even take control of enemy ships ! \r\n• Manage your set of skills as you gain experience. Special perks also appear when you perform well. \r\n• Hire captains and crews for your squadron’s ships. Watch them gain experience as they fight by your side. \r\n• Heavily customize your ships with equipment or weapons of different origins. Modify ship’s modules, armor, weapons, sensors or counter-measures. \r\n• Dozens of ship types which can be acquired and commanded, from the smallest corvette to the mightiest battleship. \r\n• Advanced damage system: ships can suffer critical and system failures in combat. \r\n• Loot anything that floats in space, trade items around the solar system to gain extra income, or salvage wrecked ships and even capture hostile vessels with boarding drones","torrent":{"xt":"urn:btih:1c7d8540f60dfefd94ef280825e5605e3d71573d","amp;dn":"Ceres+%5BMultilang+3%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c7d8540f60dfefd94ef280825e5605e3d71573d","infoHashBuffer":{"type":"Buffer","data":[28,125,133,64,246,13,254,253,148,239,40,8,37,229,96,94,61,113,87,61]},"announce":[],"urlList":[]}}