{"title":"Risks and Risk Governance in Shale Gas Development","uid":12550310,"size":6226970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1dd84f7e9dc3a1202b068d9411e1784262e1e946&amp;dn=Risks+and+Risk+Governance+in+Shale+Gas+Development&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1444534069,"description":"Risks and Risk Governance in Shale Gas Development (NAP, 2014).pdf\r\n\r\nISBN: 9780309312578\r\n\r\nNatural gas in deep shale formations, which can be developed by hydraulic fracturing and associated technologies (often collectively referred to as &quot;fracking&quot;) is dramatically increasing production of natural gas in the United States, where significant gas deposits exist in formations that underlie many states. Major deposits of shale gas exist in many other countries as well. Proponents of shale gas development point to several kinds of benefits, for instance, to local economies and to national &quot;energy independence&quot;. Shale gas development has also brought increasing expression of concerns about risks, including to human health, environmental quality, non-energy economic activities in shale regions, and community cohesion. Some of these potential risks are beginning to receive careful evaluation; others are not. Although the risks have not yet been fully characterized or all of them carefully analyzed, governments at all levels are making policy decisions, some of them hard to reverse, about shale gas development and/or how to manage the risks.\r\n\r\nRisks and Risk Governance in Shale Gas Development is the summary of two workshops convened in May and August 2013 by the National Research Council's Board on Environmental Change and Society to consider and assess claims about the levels and types of risk posed by shale gas development and about the adequacy of existing governance procedures. Participants from engineering, natural, and social scientific communities examined the range of risks and of social and decision-making issues in risk characterization and governance related to gas shale development. Central themes included risk governance in the context of (a) risks that emerge as shale gas development expands, and (b) incomplete or declining regulatory capacity in an era of budgetary stringency. This report summarizes the presentations on risk issues raised in the first workshop, the risk management and governance concepts presented at the second workshop, and the discussions at both workshops","torrent":{"xt":"urn:btih:1dd84f7e9dc3a1202b068d9411e1784262e1e946","amp;dn":"Risks+and+Risk+Governance+in+Shale+Gas+Development","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dd84f7e9dc3a1202b068d9411e1784262e1e946","infoHashBuffer":{"type":"Buffer","data":[29,216,79,126,157,195,161,32,43,6,141,148,17,225,120,66,98,225,233,70]},"announce":[],"urlList":[]}}