{"title":"Prabhakaran: The Story of his struggle for Eelam","uid":12583680,"size":248858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1df61e39e17fbc2e12cec9005527055b23a69847&amp;dn=Prabhakaran%3A+The+Story+of+his+struggle+for+Eelam&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mdusanjay","files":1,"time":1444988181,"description":"Prabhakaran: The Story of his struggle for Eelam by Chellamuthu Kuppusamy\r\n\r\nOverview: Though the Sri Lankan Tamils began the struggle for their rights in Sinhala dominated Sri Lanka well before Prabhakaran was born, Prabhakaran’s life is inextricably linked with the struggle. This book provides an account of the life of LTTE chief Prabhakaran, who led an armed struggle against the Sri Lankan state to create Eelam, a separate nation for the Sri Lankan Tamils.\r\n\r\nThe book begins from Prabhakaran’s childhood days in the aftermath of India’s and Sri Lanka’s independence from Britain. The Sri Lankan Tamils were following Gandhi’s non-violent methods to fight for their rights as citizens of Sri Lanka. Prabhakaran, an ardent fan of Bhagat Singh and Subhash Chandra Bose, felt that non-violence would not work against a Sinhala dominated government and began experimenting with violent acts against the Government to send a message. His initial success became the nucleus for the formation of LTTE, which became the quintessential guerrilla organization fighting the State","torrent":{"xt":"urn:btih:1df61e39e17fbc2e12cec9005527055b23a69847","amp;dn":"Prabhakaran%3A+The+Story+of+his+struggle+for+Eelam","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1df61e39e17fbc2e12cec9005527055b23a69847","infoHashBuffer":{"type":"Buffer","data":[29,246,30,57,225,127,188,46,18,206,201,0,85,39,5,91,35,166,152,71]},"announce":[],"urlList":[]}}