{"title":"O'Reilly - Data-Driven Products","uid":12490071,"size":681183818,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1eb1ed02a1d205b1d27b6e36ae9071fae11cd296&amp;dn=O%27Reilly+-+Data-Driven+Products&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NepsterJay","files":8,"time":1443163194,"description":"If you work for a company that develops products of one kind or another, you may have worked on a new feature you thought was truly awesome, only to discover later that it was a dismal failure. In this video course, Dan McKinley shares hard lessons that he learned at Etsy about the value of using data to drive product decisions.\r\n\r\nUsing several real-world case studies on proposed changes to Etsy's website, Dan demonstrates why using appropriate metrics to evaluate any product idea is crucial in the early stages before you spend too much time and money on something that may not pan out.\r\n\r\n- Determine the type of data you need for analyzing specific product questions\r\n- Prioritize product ideas based on several metrics, do the numbers add up?\r\n- Examine case studies on two product ideas: one discarded and one pursued\r\n- Understand the benefit of A/B testing for evaluating product prototypes\r\n- Explore the novelty effect: products that only achieve short-term effects\r\n- Look at three methods for attempting large strategic moves, based on case studies\r\n- Learn how to win the trust of your community when introducing product changes\r\n\r\nDan McKinley is a web developer who spent seven years at Etsy, beginning in 2007 when it was still a fledgling company. During his tenure, he worked on activity feeds, search, recommendations, experimentation, and analytics. Dan currently works for Stripe, a company that provides a suite of APIs to help businesses accept online payments","torrent":{"xt":"urn:btih:1eb1ed02a1d205b1d27b6e36ae9071fae11cd296","amp;dn":"O%27Reilly+-+Data-Driven+Products","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb1ed02a1d205b1d27b6e36ae9071fae11cd296","infoHashBuffer":{"type":"Buffer","data":[30,177,237,2,161,210,5,177,210,123,110,54,174,144,113,250,225,28,210,150]},"announce":[],"urlList":[]}}