{"title":"Droid Stealth safe camera","uid":12565236,"size":1819514,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:217b9dfde68fd5042f737c9c0198ad1b4af9c44f&amp;dn=Droid+Stealth+safe+camera&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tupl70","files":1,"time":1444770828,"description":"DroidStealth Android encryption tool creates a hidden folder in your phone in which it stores your all encrypted files. The app itself can be opened by simply dialing a phone number of any length which is actually a pin or by punching an invisible widget on your phone's home screen five times.\r\n\r\nThe application is developed in order to hide the existence of any protection mechanism that usually hints casual inspectors that they need to do some tampering in an attempt to gain access to users’ encrypted data. \r\nSecret data files would be encrypted usingConceal API and could not be accessed from other apps or from its original location. \r\n\r\nSome DroidStealth Android encryption tool features are listed below:\r\n\r\n    The app is stored in a secretive mode, and can be renamed to appear as a benign app to &quot;hide in plain sight&quot;.\r\n    The app doesn’t appear under the normal downloaded app list.\r\n    The app provides notification to the user if any of the secret files are left unlocked.\r\n    The can be kept out of the running process list when not in use.\r\n    The app does not pop up in the recent visited list.\r\n\r\n This may be one of the major drawback of DroidStealth app among others, which are listed below:\r\n\r\n    The data is encrypted and decrypted within the app.\r\n    Uninstalling the app may lead to deletion of all the data.\r\n    Low memory of the phone might lead to force quitting of the application and this might lead to loss of the data.\r\n    If a user's phone gets in the hands of investigation while the app is under decode mode, then it would be difficult for them to secure the data from officials","torrent":{"xt":"urn:btih:217b9dfde68fd5042f737c9c0198ad1b4af9c44f","amp;dn":"Droid+Stealth+safe+camera","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217b9dfde68fd5042f737c9c0198ad1b4af9c44f","infoHashBuffer":{"type":"Buffer","data":[33,123,157,253,230,143,213,4,47,115,124,156,1,152,173,27,74,249,196,79]},"announce":[],"urlList":[]}}