{"title":"The Message_DVD(.iso)_SWESUB_DANSUB_FINSUB_NORSUB","uid":5284546,"size":8300298240,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:22064b710725addf37308248bd30170db72665e1&amp;dn=The+Message_DVD%28.iso%29_SWESUB_DANSUB_FINSUB_NORSUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bjelost","files":1,"time":1263666071,"description":"One of the best of movies of Anthony Quinn. This movie is a must see for people who don't know anything about Islam, or know it but in a negative aspect. This movie clears a wide range of those misconceptions people have about this great religion.\n\n\tHandsomely-mounted historical epic concerns the birth of the Islamic faith and the story of the prophet Mohammed who, in accordance with the tenants of Islam, is never seen or heard (as this is offensive to certain islamic schools of thought). In Mecca in the 7th century, Mohammed is visited by a vision of the Angel Gabriel, who urges him to lead the people of Mecca to cast aside the 300 idols of Kaaba and instead worship the one true God. Speaking out against the corrupt political and military leaders who rule Mecca. With the help of his uncle, a brave warrior named Hamza , Mohammed and his followers return to Mecca to liberate the city in the name of God. The Message (originally screened in the U.S. as Mohammed, Messenger of God) proved to be highly controversial during its production and initial release. Unfounded rumors had it that Mohammed would not only be depicted in the film, but that he was to be played by Charlton Heston or Peter O'Toole. \n\n\tThis resulted in angry protests by Muslim extremists, until director Moustapha Akkad hired a staff of respected Islamic clerics as technical advisors. \n\n\n\tThis torrent is the english version subtitled in:\n\n\tSwedish\n\tDanish\n\tFinnish\n\tNorwegian\n\t\n\tThis is DVD(.iso) fil;\n","torrent":{"xt":"urn:btih:22064b710725addf37308248bd30170db72665e1","amp;dn":"The+Message_DVD%28.iso%29_SWESUB_DANSUB_FINSUB_NORSUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22064b710725addf37308248bd30170db72665e1","infoHashBuffer":{"type":"Buffer","data":[34,6,75,113,7,37,173,223,55,48,130,72,189,48,23,13,183,38,101,225]},"announce":[],"urlList":[]}}