{"title":"Sniper Elite 3 [+4 DLC] (2014)Pc","uid":12474546,"size":9623813965,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:23d4de901bc75f4a4a7c3dc440f910ea9ab77aa1&amp;dn=Sniper+Elite+3+%5B%2B4+DLC%5D+%282014%29Pc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"butler44","files":1,"time":1442962301,"description":"\n\nRelease Info:\n*************\nReleased: 2014\nGenre: Action, Shooter, 3D, 3rd, Person, Stealth\nPlatform: PC\nLanguage: Russian (RUS) | English (ENG)\nLanguage: Russian (RUS) | English (ENG)\n\nSystem Requirements:\n********************\nOperating System: Windows Vista (SP2) / Windows 7 (SP1) / Windows 8 / Windows 8.1\nProcessor: Intel Core &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;650c5025574b5d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; GHz / AMD Phenom II &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;633b5723504d51&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; GHz\nMemory: 4 GB\nVideo Card: NVIDIA Â® GeForce Â® 8800 series / ATI Radeon â„¢ HD 3870 - ATI Radeon HD 6670 / NVIDIA GeForce GT 640\nSound Card: DirectX 9.0c compatible\nFree space on hard disk: 18 GB\n\nDescription:\n************\nAction Sniper Elite 3 takes place during the Second World War. In the role of American agent Charles Fairbairn you have to go to North Africa to help the Allied forces to cope with the onslaught of the Nazis. In parallel, the hero learns of a secret program to develop tanks, realizing that Germany will be able to decide the outcome of the war. The game is notable for non-linear gameplay, unfolding in an open area. You wait for the fierce battle with melee weapons, as well as shooting from distance. Bustling cities and remote villages - your invaluable assistant in tactical planning and displacements. Updated camera gives the ability to destroy armored vehicles and tanks with just one well-aimed shot into the gas tank. Luggage X-Ray detailed manner will show you how the bullets fired from the destroyed muscle and circulatory system. Moreover, Sniper Elite 3 includes cooperative transmission mode and multiplayer.\n\nFeatures:\n*********\n&quot;Watch. Plan. Kill. Change yourself. Variety of environmental conditions allow the player to choose how he will undergo a particular mission. Multiple nonlinear routes extending both in horizontal and in vertical plane, allow to eliminate the enemy in various ways.\n\n&quot;Change of position. Sniper should always think about ways to retreat. Explore the world to find or create yourself conditions suitable to your style of play. There is a sniper position, place for an ambush, alternative approaches, sound masking and various traps. Prioritize when selecting targets to gain an advantage, hide in the shadows and in the dark so you do not notice the soldiers enter and enemies into confusion, changing position.\n\n&quot;The world around us. Battlefields in North Africa during World War II are quite diverse and very different from the European, allowing the fire of a sniper weapon with a much greater distance. Play of mountain ranges and vast plateaus, lively cities and small remote settlements.\n\n&quot;Improved AI. Proper use of information about your location and route planning attacks - rebuilt AI system, with an emphasis on action and team tactics, makes fighters Africa Corps considerably smarter and more dangerous, but at the same time allowing the player to make more informed choices. With the support of various motor vehicles - from SUVs to tanks - Afrika Korps is a force with which you will have to reckon with.\n\n&quot;Setting up weapons and character. Earn experience and get the title in both single and multiplayer game to unlock more than 40 unique parts and assemble the perfect rifle that is best suited for each mission and your playing style. Create individual sets of equipment and save them for single and multiplayer games.\nImproved bullet camera. Now shows more detail, including the circulatory system, and muscle.\n\n&quot;The new bullet camera for cars. Now the camera is activated when shooting at vehicles such as armored personnel carriers or tank. Multistage destruction technology allows you to create the preconditions for the final shot. Shoot through peepholes, and watch as the crew members killed in the car!\n\n&quot;Multiplayer. SE3 builds on the experience of multiplayer modes of the previous games of the series and is designed as a competition, and the joint actions of players. In Game 5 of the competitive modes for playing in a team, and for lone wolves, including &quot;King of distances&quot; and &quot;no contact&quot; with a selection of cards before the game. Extensive outdoor play space gives you more freedom of movement and allow an experienced sniper fire from long distances. Earn medals and chevrons to become the perfect sniper.\n\n&quot;Co-op. Returning favorite modes allow you to those who prefer a joint game, choose a mission to &quot;Two&quot; or the new regime &quot;Survival&quot;. In the &quot;Two&quot; one of the players playing for the sniper and the other - for the spotter. In order to successfully pass the mission, they must work closely together. Mode &quot;Survival&quot; - a test of strength - feel the full power of the German Afrika Korps.\n\n&quot;Shelter. Skill and ability to move quickly allow sniper instantly navigate in the world and always one step ahead of their prey.\n\n&quot;Improved battle. The player is endowed with an improved feedback, and can choose his tactics as far and melee. Superior melee in conditions of secrecy allows unnoticed incapacitate enemies in several different ways.\n\nFeatures RePack:\n****************\nCut multiplayer / no recoded\nActivated DLC.\nVersion 1.0\nRunning through the label on stol.\nInstallation time ~ 25-30 minutes (depending on the power box).\n\nScreen Shots:\n************* &lt;a href=&quot;\nhttp://rupix.org/images/70430196604742569416.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rupix.org/images/70430196604742569416.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://rupix.org/images/11354516981165917022.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rupix.org/images/11354516981165917022.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:23d4de901bc75f4a4a7c3dc440f910ea9ab77aa1","amp;dn":"Sniper+Elite+3+%5B%2B4+DLC%5D+%282014%29Pc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23d4de901bc75f4a4a7c3dc440f910ea9ab77aa1","infoHashBuffer":{"type":"Buffer","data":[35,212,222,144,27,199,95,74,74,124,61,196,64,249,16,234,154,183,122,161]},"announce":[],"urlList":[]}}