{"title":"Rockets discografia completa + dvd","uid":12494101,"size":6534917641,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2613f982869a85d5768d0251da2dd378e04a1f1c&amp;dn=Rockets+discografia+completa+%2B+dvd&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vattei","files":267,"time":1443227136,"description":"I Rockets sono stati un gruppo musicale francese che ottenne il maggior successo in Italia tra gli anni settanta e gli ottanta con brani quali Future Woman, Space Rock, One More Mission, Electric Delight e soprattutto la reinterpretazione On the Road Again, ancor oggi talvolta trasmesso per radio, e Galactica, vero e proprio tormentone del 1980 che ha permesso loro di vincere il Telegatto come miglior gruppo straniero. Il loro genere iniziale era rock, definito subito dalla stampa &quot;space-rock&quot; per le venature fantascientifiche dei testi e dell'aspetto scenico, e per le sonorità elettroniche ed &quot;aliene&quot;. Più avanti venne invece associato alla disco, e infine al pop elettronico (synthpop), anche se in quest'ultimo caso probabilmente a torto.\r\nLa formazione del gruppo nel periodo di maggiore attività (1977-1982) era costituita dal frontman/cantante Christian Le Bartz, dal chitarrista Alain Maratrat, dal bassista e cantante Gerard L'Her, dal tastierista Fabrice Quagliotti e dal batterista Alain Groetzinger. Sesto elemento può essere considerato il produttore francese Claude Lemoine, che li creò e contribuì sostanzialmente a definirne il &quot;sound&quot;.\r\nI Rockets sono ricordati per vari motivi:\r\nSi presentavano alle loro esibizioni come dei veri e propri extraterrestri, ricoprendosi il viso con una speciale crema argentea e vestendosi con delle tute in tessuto argenteo dal design fantascientifico;\r\nIl loro suono faceva larghissimo uso di elettronica, pur includendo anche basso, chitarra e batteria tradizionali.\r\nI loro concerti erano caratterizzati dall'utilizzo di spettacolari effetti visivi (raggio laser e fumi), artifizi pirotecnici, come bombe e bazooka spara fiamme (succedeva spesso che qualche spettatore si ferisse) e particolari effetti sonori, tra cui talk box, vocoder e grande utilizzo di tastiere. Furono fra i primi, nel dicembre 1977, ad inserire l'effetto delle luci laser nei loro concerti (insieme ai Pink Floyd e ai Genesis);\r\nAssumevano movenze e sembianze da robot, e per questo accade spesso che vengano accomunati al gruppo tedesco dei Kraftwerk (anche se nel loro caso parliamo di musica elettronica e di uno stile a larghi tratti differente). Un altro motivo di confusione tra i Rockets ed i Kraftwerk è che On the Road Again del gruppo francese e The Robots di quello tedesco erano usciti entrambi nel 1978, entrambi con voce modificata con il vocoder","torrent":{"xt":"urn:btih:2613f982869a85d5768d0251da2dd378e04a1f1c","amp;dn":"Rockets+discografia+completa+%2B+dvd","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2613f982869a85d5768d0251da2dd378e04a1f1c","infoHashBuffer":{"type":"Buffer","data":[38,19,249,130,134,154,133,213,118,141,2,81,218,45,211,120,224,74,31,28]},"announce":[],"urlList":[]}}