{"title":"Violent Femmes - Add It Up (1981-1993) (1993)@flac","uid":12588882,"size":576087310,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:266e1eda9604fa575d25a00914635e4b9aabbb7c&amp;dn=Violent+Femmes+-+Add+It+Up+%281981-1993%29+%281993%29%40flac&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alekow1","files":40,"time":1445068171,"description":"\nIf you are like me and think that the Violent Femmes are one of if not the very best rock group of the last twenty-five years, you will already own this album because it is, in a word, essential. Those who may just be discovering this band for the first time, and this timeless music full of angst and fury and questions and passion speaks as strongly to the present generation of youth as it did to my own, will definitely want to procure this album as soon as possible. \r\nThere is just no other band like the Violent Femmes (as the Intro to this album states in its own special way); these guys have energized and heavily influenced modern rock music as we know it now and will know it in the future, yet they stay below the radar of many a music fan out there, seemingly happy about the fact as they do their own thing their own way at all times. The popular success this band has always deserved would almost spoil everything, though; these guys are so incredible that I really don't want to share them with the mass public out there who really wouldn't understand the power of the music and lyrics.\r\n\r\nAdd It Up is a compilation album, containing a number of songs available elsewhere alongside some amazing tracks you can't find anywhere else. Much of this material draws from the band's early days. Prereleased tracks include Blister in the Sun, Gone Daddy Gone, and Gimme the Car from the incredible self-titled debut album, the unique and unforgettable Country Death Song, Black Girls, and Jesus Walking on the Water from Hallowed Ground, Old Mother Reagan from The Blind Leading the Naked, and American Music and Out the Window from Why Do Birds Sing? Add it up, and you will find eleven previously unreleased tracks, two tracks previously unreleased in the U.S., and four live performances unavailable elsewhere.\r\nThe simple yet catchy Waiting For the Bus takes us back to 1980 (this track can also now be found on the Deluxe Edition of the original Violent Femmes album). Gordon's Message is a voice mail message lead singer Gordon Gano left to explain why he was going to be late for an early recording session in 1982. \r\n36-24-36 is an incredibly infectious, fun song recorded in 1984 for a movie that was never made. \r\nI Held Her in My Arms is an alternate version of the song from The Blind Leading the Naked, espousing a heavier and slightly more serious sound than the album track. \r\nFrom the mid-1980s come the short and interesting tracks I Hate the TV and America Is. \r\nDegradation is a strange, half-minute carnival-like pitch of the band written by Brian Ritchie and Victor Delorenzo. \r\nDance, M.F., Dance is a rather weird, hard-hitting pseudo-dance song previously released only in Australia and Europe; interestingly, this version of the song turned up out of nowhere several years after the original master tape was lost. \r\nLies is interesting because it begins with the studio cut from the album 3 and morphs into a live version of the song featuring an extended jam session. \r\nVancouver is by far the strangest thing on here; this two-minute-plus track is an instrumental that sounds like a band warming up before a concert. \r\nWith the exception of Vancouver, which was indeed recorded in Vancouver, the album closes out with some powerful live tracks. We get a rocking version of the youth anthem Kiss Off recorded in a 1990 concert in Australia, followed by a fantastic live performance of Add It Up from a 1991 concert in Virginia. I never tire of hearing the crowd erupt when Gano unleashes the first a cappella word of the song. Finally, we have Johnny, a simply amazing song written by Gordon Gano and performed in a cafe in Milwaukee way back in 1981; \r\nthis is about as soft and tender as the Violent Femmes get, and the haunting lyrics make sure you come away from this essential album having felt your soul touched by the music. (Customer from Amazon)\r\n\r\n \nhttp://i.imgur.com/rrbG79i.jpg\r\n\r\n\r\n01. Intro    [0:15]\r\n02. Waiting For the Bus    [2:07]\r\n03. Blister In The Sun    [2:24]\r\n04. Gone Daddy Gone    [3:05]\r\n05. Gordon's Message    [0:27]\r\n06. Gimme The Car    [5:05]\r\n07. Country Death Song    [5:02]\r\n08. Black Girls    [5:41]\r\n09. Jesus Walking On The Water    [3:06]\r\n10. 36-24-36    [1:48]\r\n11. I Held Her In My Arms    [3:01]\r\n12. I Hate The TV    [2:10]\r\n13. America Is    [2:10]\r\n14. Old Mother Reagan    [0:31]\r\n15. Degradation    [0:35]\r\n16. Dance, M.F., Dance!    [3:17]\r\n17. Lies (Live)    [5:49]\r\n18. American Music    [3:50]\r\n19. Out The Window    [2:52]\r\n20. Kiss Off (Live)    [4:59]\r\n21. Add It Up (Live)    [6:14]\r\n22. Vancouver (Live)    [2:14]\r\n23. Johnny (Live)    [5:25]\r\n\r\n\r\n\r\nGuitar - Brian Ritchie (tracks: 10, 12, 13, 18), Gordon Gano (tracks: 2 to 4, 6 to 14, 16 to 23) \r\nBass - Brian Ritchie (tracks: 2 to 4, 6 to 14, 16 to 21, 23)\r\nDrums - Victor DeLorenzo (tracks: 2 to 4, 6 to 14, 16 to 23)\r\nVocals - Brian Ritchie (tracks: 2, 6, 8, 12 to 14, 16 to 21), Gordon Gano (tracks: 2 to 4, 6 to 14, 16 to 21, 23), Victor DeLorenzo (tracks: 2 to 4, 6, 8 to 21) \r\n\r\n\r\nLabel: Slash ‎/ London Records\r\nReleased: 1993\r\nCatalogue: 3984 28258 2\r\n\r\nCodec: Flac\r\nCompression Level: 6\r\nQuality: High\r\n\r\n\r\nCD-rip by alekow (EAC and Flac)\r\nCovers Included (600dpi)\r\n\r\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:266e1eda9604fa575d25a00914635e4b9aabbb7c","amp;dn":"Violent+Femmes+-+Add+It+Up+%281981-1993%29+%281993%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"266e1eda9604fa575d25a00914635e4b9aabbb7c","infoHashBuffer":{"type":"Buffer","data":[38,110,30,218,150,4,250,87,93,37,160,9,20,99,94,75,154,171,187,124]},"announce":[],"urlList":[]}}