{"title":"Used Battery Collection and Recycling (Industrial Chemistry Libr","uid":12484143,"size":22300939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27945b68685f361b43dabef3cccadb6cd1f2bab5&amp;dn=Used+Battery+Collection+and+Recycling+%28Industrial+Chemistry+Libr&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1443090686,"description":"Used Battery Collection and Recycling (Industrial Chemistry Library Vol. 10)(Elsevier, 2001).pdf\r\n\r\nISBN 0-444-50562-8\r\n\r\nThis book covers all aspects of spent battery collection and recycling. First of all, the legislative and regulatory updates are addressed and the main institutions and programs worldwide are mentioned. An overview of the existing battery systems, of the chemicals used in them and their hazardous properties is made, followed by a survey of the major industrial recycling processes. The safety and efficiency of such processes are stressed. Particular consideration is given to the released emissions, i.e. to the impact on human health and the environment. Methods for the evaluation of this impact are described. Several chapters deal with specific battery chemistries: lead-acid, nickel-cadmium and nickel-metal hydride, zinc (carbon and alkaline), lithium and lithium-ion. For each type of battery, details are provided on the collection/recycling process from the technical, economic and environmental viewpoint. The chemicals recoverable from each process and remarketable are mentioned. A chapter deals with recovering of the large batteries powering electric vehicles, e.g. lead-acid, nickel-metal hydride and lithium-ion. The final chapter is devoted to the important topic of collecting batteries from used electrical and electronic equipment. The uncontrolled disposal of these devices still containing their batteries contributes to environmental pollution","torrent":{"xt":"urn:btih:27945b68685f361b43dabef3cccadb6cd1f2bab5","amp;dn":"Used+Battery+Collection+and+Recycling+%28Industrial+Chemistry+Libr","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27945b68685f361b43dabef3cccadb6cd1f2bab5","infoHashBuffer":{"type":"Buffer","data":[39,148,91,104,104,95,54,27,67,218,190,243,204,202,219,108,209,242,186,181]},"announce":[],"urlList":[]}}