{"title":"The Cross And The Switchblade [Remast.] [MultiDub PAL DVDR]","uid":5300477,"size":3920625664,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2795fef18176a0d45782970d7811a31daed4b991&amp;dn=The+Cross+And+The+Switchblade+%5BRemast.%5D+%5BMultiDub+PAL+DVDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1264203181,"description":"Hi there..\n\nFirstly I'd like to welcome you to aq new, Christian site:\n &lt;a href=&quot;\nhttp://www.blazefire.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.blazefire.org/&lt;/a&gt;\n\nRegistrations are now open for a while.\n\nI was approached by a guy who wanted to know if I could get the Polish subtitles to this film, so I ordered the movie, who, strangely enough, was available on a &quot;Special Anniversary Edition&quot;, and had several dubbed languages on it.\n\nWhen I got this film in all these languages, I thought they would have managed to go with the European PAL-format, since most of the languages in the audio-tracks are European, but nooo..\n\nThey made it a NTSC-DVD, which is the American standard, which won't play on many standalone European DVD-players [including mine], so in order to give the Christians and everybody else what they really want, the possibility to watch the movie [:-?], I ripped the main movie and a testimony by Nicky Cruz, made the main movie a multidub, customized DVD-ISO, a ISO that fits well onto a standard DVDR, and from this copy you can rip the language you want and make DivX and so on for your fellow countrymen, who are maybe fluent-not speaking English like I and you. Non? Yes.. Hrrmm...\nOr you could just use it like it is. At least now it's the European PAL standard..\n\nLanguages are: English, Spanish, Portuguese, Russian, French, Italian, German and Polish.\n\n---------------\n\nOh, I've got to cut in and share this information with you: This movie is Hollywood's reproduction of the actual events, and I've heard Nicky Cruz on several occasions referring to the movie and/or his life and the actual events, and they differ quite a bit.. But it is what it is, and it's a good film that has several of the important stuff right, but there's things like that there was 2000 people in the auditorium in the final scene, not only the few pictured in this movie. ..And so on..\n\nBUT, and this is the new info: There's a movie in pre-production now, named &quot;Run, Baby, Run! - The Nicky Cruz Story&quot;, to which the link is here\n &lt;a href=&quot;\nhttp://www.runbabyrunmovie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.runbabyrunmovie.com/&lt;/a&gt;\n\nand I think we can look forward to that one, and that it's well worth our prayers so it'll be right this time.\n\nLooks like, and from Nicky Cruz telling about it [You can find fresh testimonies from the man at World Challenge's website], that it'll be a better depiction and account of those days in 1958 than the current, 40 years old movie you've got here..\n\nThis, the old movie, have been digitally remastered from the original 135 mm negative, and lasts 1 hour, 45 minutes and is in color. It was originally released in 1970.\n\nHave a nice one!\n\nVerifire,\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;344251465d525d465159555d58745359555d581a575b59&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;Personally I've found the hope of deliverance and enlightenment through Yeshua Ha'Mashiach to be the greatest mystery and riddle, shrouded in the shadows of shame, but revealed to those who seek the Truth, no matter the cost.&quot;","torrent":{"xt":"urn:btih:2795fef18176a0d45782970d7811a31daed4b991","amp;dn":"The+Cross+And+The+Switchblade+%5BRemast.%5D+%5BMultiDub+PAL+DVDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2795fef18176a0d45782970d7811a31daed4b991","infoHashBuffer":{"type":"Buffer","data":[39,149,254,241,129,118,160,212,87,130,151,13,120,17,163,29,174,212,185,145]},"announce":[],"urlList":[]}}