{"title":"Britney Spears - From The Bottom Of My Broken Heart (2nafish)","uid":5288612,"size":152631300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:27f9e3edb663cb719851294ccc275fd7a86344f4&amp;dn=Britney+Spears+-+From+The+Bottom+Of+My+Broken+Heart+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263819928,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;From the Bottom of My Broken Heart&quot; is the fifth and final single (fourth in the U.S. and Australia) from pop singer Britney Spears' first album ...Baby One More Time. It was released during the first quarter of 2000.\n\nThe song was written and produced by Eric Foster White. In this melancholy love ballad, Spears recalls her first love and how she wishes it hadn't ended, as her true emotions are revealed &quot;from the bottom of my broken heart.&quot;\n\nDirected by Gregory Dark in late November 1999, the music video for From the Bottom of My Broken Heart begins with Spears packing her belongings as she readies herself to move away from home. She is upset because she knows that she is going to miss her first love. Throughout the video, we see scenes of the two from their past, including one where they climb up onto a windmill. Towards the ending, we see Spears waiting at a bus stop while, at the same time, her first love is driving quickly to come see her one last time. However, by the time he finally gets there, she has already left on the bus.\n\nThe video premiered on an episode of Muchmusic's Combat Zone on December 17, 1999. The video also became her fourth to retire on MTV's TRL. This is the first video where no dance is involved, as it is a slow ballad. As was with &quot;Born to Make You Happy&quot;, the radio edit of the song was used for the video; it shortens the intro and removes almost all of the second chorus, and the music's percussion is slightly different.\n\n...Baby One More Time is the debut album by American pop singer Britney Spears, released on January 12, 1999 on Jive Records. The album was a worldwide commercial success, reaching the top five in nineteen countries, and number one in fifteen, including the U.S Billboard 200. The album helped propel Spears' into mainstream popularity.\n\nWith the release of the lead single &quot;...Baby One More Time&quot;, Spears became a pop phenomenon; the single peaked at number one on the Billboard Hot 100, a feat Spears would not repeat for nearly ten years, until October 2008 when her single &quot;Womanizer&quot; peaked at number one on the chart. Every single released in the United Kingdom went on to chart in the top-five spots on the UK Singles Chart and the top-three spots on the Eurochart Hot 100.\n\nThe album, its lyrics, and its music videos maintained the typical virgin image of the late 1990s teen pop revival for Spears. The album is the biggest selling album worldwide by a teenage artist and the highest selling album by a female pop artist and debut album in the United States. ...Baby One More Time sold more than 25 million copies worldwide, becoming one of the most successful albums of all time and is Spears' most successful album to date.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:27f9e3edb663cb719851294ccc275fd7a86344f4","amp;dn":"Britney+Spears+-+From+The+Bottom+Of+My+Broken+Heart+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27f9e3edb663cb719851294ccc275fd7a86344f4","infoHashBuffer":{"type":"Buffer","data":[39,249,227,237,182,99,203,113,152,81,41,76,204,39,95,215,168,99,68,244]},"announce":[],"urlList":[]}}