{"title":"Legend of the Seventh Virgin - Victoria Holt AZW3 EPUB MOBI","uid":12488313,"size":1305010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a480407d69a81f72daa722eb7b8292d2edc6c0a&amp;dn=Legend+of+the+Seventh+Virgin+-+Victoria+Holt+AZW3+EPUB+MOBI&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FreddyFroggy1","files":5,"time":1443130869,"description":"The Legend of the Seventh Virgin (Romantic Suspense) — Victoria Holt\r\nFormats: AZW3, EPUB, MOBI. First published in 1966.\r\n\r\nFiction. Tags: Cornwall, Gothic, Romance, Suspense, Thriller\r\nisbn:9780449211236 \r\n\r\nThere was a legend that six novices and a nun living in a convent in Cornwall had strayed from their vows … and one night, in a field nearby, six were turned to stone as they danced in the moonlight in defiance of their sins, while the seventh Sister was walled up in the building.\r\n\r\nThe famous convent later became the home of the St. Larnstons, the county’s leading family, whose lives soon rivaled their predecessors in haunting mystery.\r\n\r\nKerensa Carlee dreamed of becoming a part of that famous house, but she was a cottage girl, and the road from her humble dwelling to St. Larnston Abbas was a long one. But fate seemed to lead her to the big house, even if she had to enter it as a servant. Kerensa was both strikingly beautiful and unusually determined, and Johnny St. Larnston wanted her. Marriage and nothing less was her price. It seemed at last her dreams were becoming reality, and she saw herself gaining absolute control of the Abbas.\r\n\r\nSuddenly her world began to crumble around her. Her husband disappeared; her childhood friend and confidante seemed no longer someone to turn to but a threat to be avoided. Only her grandmother, who had raised her from infancy, seemed steadfast in her devotion and sage advice. Kerensa began to wonder if she could escape a past that was encroaching upon her every day, or would she become like the nun walled up in the very house she had longed to own?\r\n\r\nVictoria Holt has created another absorbing story as gripping as Mistress of Mellyn and Kirkland Revels, but her characters go far beyond the ordinary realm of the traditional Gothic novel","torrent":{"xt":"urn:btih:2a480407d69a81f72daa722eb7b8292d2edc6c0a","amp;dn":"Legend+of+the+Seventh+Virgin+-+Victoria+Holt+AZW3+EPUB+MOBI","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a480407d69a81f72daa722eb7b8292d2edc6c0a","infoHashBuffer":{"type":"Buffer","data":[42,72,4,7,214,154,129,247,45,170,114,46,183,184,41,45,46,220,108,10]},"announce":[],"urlList":[]}}