{"title":"UDEMY MASTER YOUR GYM AND GET BACK IN SHAPE FOR GOOD THIS YEAR T","uid":12489314,"size":744943437,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2f0df90f4ada49a62e11d1b89bf481e8d277839e&amp;dn=UDEMY+MASTER+YOUR+GYM+AND+GET+BACK+IN+SHAPE+FOR+GOOD+THIS+YEAR+T&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Mackweet","files":34,"time":1443141271,"description":"==Course Description==\r\n\r\nWhat you are about to discover will help you break past the barriers\r\nthat are the root reasons why you have quit on yourself in the past.\r\n\r\nLook at your past failures and say 'goodbye', because you have quit on\r\nyourself for the LAST time! This will help you, I can promise you that.\r\n\r\nSOME of What's INSIDE:\r\n\r\n    What's your body type and if you can sculpt it into anything you want.\r\n    Why you need a personal trainer and just how to pick the best one for YOU.\r\n    Insights on supplements and their benefits to you and your fitness goals.\r\n    Proper gym etiquette…most people don't think they need to learn this one.\r\n    How to pick the perfect workout buddy and succeed like never before.\r\n\r\n\r\nAND...I'll be Uncovering Myths &amp; Truths!\r\n\r\n    Myth 1: Most fitness clubs are just “meat markets.&quot; – Misunderstanding this will discourage you from starting before you even begin...\r\n    Myth 2: The health club staff doesn't really care about fitness. – Really? Whoever said this has no clue…but I'll let you in on a little secret…\r\n    Myth 3: Working out at home is a lot better. – Not only is this wrong, I'm going to show you just how damaging this will be to your ultimate goals…\r\n    Myth 4: Lifting weights will make you gain more weight. – A lot of people are afraid to go for this reason alone but, again, this is wrong, wrong, WRONG…\r\n    Myth 5: Because you're trim or skinny, you don't need to exercise. – News flash…being skinny and healthy have nothing in common. I'll tell you why…\r\n    ...AND 21 OTHER MYTHS!\r\n\r\n\r\nWHAT do YOU GET &amp; Why?\r\n\r\n    The included materials are in PDF for your reading pleasure and also in MP3.\r\n\r\n    This course is about 2hrs in length from start to finish.\r\n\r\n    Why should you take this course? The ANSWER is, If you want to truly succeed in the health club or gym and achieve amazing results for the long term and get the most out of your health and fitness investment to move better, look better and feel better...then this is the best course available.\r\n\r\nWhat are the requirements?\r\n\r\n    Students Only Need a Strong Desire to Improve their Fitness in the Gym.\r\n\r\nWhat am I going to get from this course?\r\n\r\n    Over 35 lectures and 7 hours of content!\r\n    Learn how to break old habits and replace them with more empowering actions for awesome results\r\n    Develop &quot;proper gym etiquette&quot; to become a courteous member and to avoid embarrassment\r\n    Join ANY gym or health club with a clear understanding of EVERYTHING in it\r\n    Learn exactly how to perform exercises to avoid injury for maximum gains\r\n    Finish what you started\r\n\r\nWhat is the target audience?\r\n\r\n    This course is developed for those who have a gym membership and want to finally get the most out of their &quot;fitness investments&quot; and also for people who have never joined a gym but want to enjoy getting themselves in shape and stay in shape for life","torrent":{"xt":"urn:btih:2f0df90f4ada49a62e11d1b89bf481e8d277839e","amp;dn":"UDEMY+MASTER+YOUR+GYM+AND+GET+BACK+IN+SHAPE+FOR+GOOD+THIS+YEAR+T","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f0df90f4ada49a62e11d1b89bf481e8d277839e","infoHashBuffer":{"type":"Buffer","data":[47,13,249,15,74,218,73,166,46,17,209,184,155,244,129,232,210,119,131,158]},"announce":[],"urlList":[]}}