{"title":"Dont Panic How to End Poverty in 15 Years EN SUB x264 [MPup]","uid":12497030,"size":1073982904,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2f57f3a113372e6c81da1a72e0e7a5f4e80e60a2&amp;dn=Dont+Panic+How+to+End+Poverty+in+15+Years+EN+SUB+x264+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1443290736,"description":"This.World.2015.09.23.Dont.Panic.How.to.End.Poverty.in.15.Years.EN.SUB.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nInvestigative documentary. Hans Rosling examines the world goal of eradicating extreme poverty. Wingspan Productions for BBC produced in partnership with The Open University.\r\n\r\n[img]http://extraimago.com/images/2015/09/26/8acc4e47815a859b00035d91de1e27dc.jpg[/img]\r\n\r\nThe legendary statistical showman Professor Hans Rosling returns with a feast of facts and figures as he examines the extraordinary target the world commits to this week - to eradicate extreme poverty worldwide. In the week the United Nations presents its new goals for global development, Don't Panic - How to End Poverty in 15 Years looks at the number one goal for the world: eradicating, for the first time in human history, what is called extreme poverty - the condition of almost a billion people, currently measured as those living on less than $1.25 a day.\r\n\r\nRosling uses holographic projection technology to wield his iconic bubble graphs and income mountains to present an upbeat assessment of our ability to achieve that goal by 2030. Eye-opening, funny and data-packed performances make Rosling one of the world's most sought-after and influential speakers. He brings to life the global challenge, interweaving powerful statistics with dramatic human stories from Africa and Asia. In Malawi, the rains have failed as Dunstar and Jenet harvest their maize. How many hunger months will they face when it runs out? In Cambodia, Srey Mao is about to give birth to twins but one is upside-down. She's had to borrow money to pay the medical bills. Might this happy event throw her family back into extreme poverty?\r\n\r\nThe data show that recent global progress is &quot;the greatest story of our time - possibly the greatest story in all of human history&quot;. Hans concludes by showing why eradicating extreme poverty quickly will be easier than slowly. Don't Panic - How To End Poverty In 15 Years follows Rosling's previous award-winning BBC productions Don't Panic - The Truth About Population and The Joy Of Stats. Wingspan Productions for BBC produced in partnership with The Open University","torrent":{"xt":"urn:btih:2f57f3a113372e6c81da1a72e0e7a5f4e80e60a2","amp;dn":"Dont+Panic+How+to+End+Poverty+in+15+Years+EN+SUB+x264+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f57f3a113372e6c81da1a72e0e7a5f4e80e60a2","infoHashBuffer":{"type":"Buffer","data":[47,87,243,161,19,55,46,108,129,218,26,114,224,231,165,244,232,14,96,162]},"announce":[],"urlList":[]}}