{"title":"Joe Satriani - Light Years Away [promo].VOB","uid":12544818,"size":230811648,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3014ae8dfbc89f0631c28e5fd000223eef55f35a&amp;dn=Joe+Satriani+-+Light+Years+Away+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":1,"time":1444455562,"description":"Joe Satriani - Light Years Away [promo].VOB\r\n\r\n\r\nHQ rare music video from a promo DVD. &quot;Light Years Away&quot; is a song from  Black Swans and Wormhole Wizards, the thirteenth studio album by guitarist Joe Satriani, released on October 5, 2010 through Epic Records.\r\n\r\nRecording for Black Swans and Wormhole Wizards took place in June–August 2010 and the title was announced on August 20. A podcast of each track was put up on Satriani's officialprofile and YouTube channel leading up to the album's release, with &quot;Light Years Away&quot; being released as a free MP3 single download on September 7, 2010 in exchange for the customer advertising it in apost or Twitter tweet. Two bonus tracks, &quot;Heartbeats&quot; and &quot;Longing&quot;, were made available through Best Buy and Napster.\r\n\r\nTouring began in Europe in October–November, followed by North America and Mexico in December to January 2011.\r\n\r\nStephen Thomas Erlewine at AllMusic gave Black Swans and Wormhole Wizards three stars out of five, calling it &quot;a mature work from one of the great rock guitarists&quot; and &quot;pure guitar prog, filled with compressed boogies, sci-fi synths, exotic flourishes, and all of Satch's phasers and flangers in full-tilt overdrive.&quot;\r\n\r\nThe album reached No. 45 on the U.S. Billboard 200 and remained on that chart for two weeks, as well as reaching the top 100 in ten other countries. It was also certified Gold in the UK, with more than 100,000 copies sold.\r\n\r\n\r\nJoseph &quot;Joe&quot; Satriani (born July 15, 1956) is an American instrumental rock guitarist and multi-instrumentalist. Early in his career, Satriani worked as a guitar instructor, with many of his former students achieving fame, such as Steve Vai, Larry LaLonde, Rick Hunolt, Kirk Hammett, Andy Timmons, Charlie Hunter, Kevin Cadogan, and Alex Skolnick; he then went on to have a successful solo music career. \r\n\r\nIn 1988, Satriani was recruited by Mick Jagger as lead guitarist for his first solo tour. Satriani briefly toured with Deep Purple as the lead guitarist, joining shortly after the departure of Ritchie Blackmore in November 1993. He has worked with a range of guitarists during the G3 tour, which he founded in 1995. His G3 collaborators have included Vai, LaLonde, Timmons, Steve Lukather, John Petrucci, Eric Johnson, Yngwie Malmsteen, Brian May, Patrick Rondat, Paul Gilbert, Adrian Legg, Kenny Wayne Shepherd, Steve Morse and Robert Fripp. Satriani has been the lead guitarist for the supergroup Chickenfoot since co-founding the band in 2008. Since 1988, he has been using his own signature guitars, the Ibanez JS Series, which are sold in music stores worldwide. He has also collaborated with Vox to create his own wah, delay, overdrive and distortion pedals as well as a collaboration with Marshall Amplification for the creation of his own signature series amplifier head, the JVM410HJS.\r\n\r\nSatriani is considered to be a highly technical guitarist, and has been referred to as a top guitar virtuoso. Satriani has mastered many performance techniques on electric guitar, including legato, two-handed tapping and arpeggio tapping, volume swells, harmonics and extreme whammy bar effects. During fast passages, Satriani favors a legato technique (achieved primarily through hammer-ons and pull-offs) that yields smooth and flowing runs. He is also adept at other speed-related techniques such as rapid alternate picking and sweep picking. Satriani was influenced by blues-rock guitar icons such as Jimi Hendrix, Brian May, Eric Clapton, Jimmy Page, Ritchie Blackmore and Jeff Beck, as well as jazz fusion guitarist Allan Holdsworth.\r\n\r\nSatriani has the second most Grammy Award nominations (15, after Brian McKnight and Snoop Dogg) of any artist without winning.\r\n\r\nHe is a 15-time Grammy Award nominee and has sold over 10 million albums, making him the biggest-selling instrumental rock guitarist of all time.\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Black_Swans_and_Wormhole_Wizards \r\n      \nhttp://postimg.org/image/w22zr4zrh/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 1280x720 (4:3) 23.976fps 7800kbps\r\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\r\n   Duration: 00:04:24\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:3014ae8dfbc89f0631c28e5fd000223eef55f35a","amp;dn":"Joe+Satriani+-+Light+Years+Away+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3014ae8dfbc89f0631c28e5fd000223eef55f35a","infoHashBuffer":{"type":"Buffer","data":[48,20,174,141,251,200,159,6,49,194,142,95,208,0,34,62,239,85,243,90]},"announce":[],"urlList":[]}}