{"title":"Britney Spears - Born To Make You Happy  (2nafish)","uid":5292964,"size":123183108,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3138bcfefd8c72e8ec755e031e252691929fea56&amp;dn=Britney+Spears+-+Born+To+Make+You+Happy++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263955406,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Born to Make You Happy&quot; is a mid-tempo bubblegum pop song written by Kristian Lundin and Andreas Carlsson, and produced by Lundin for Britney Spears' debut studio album &quot;...Baby One More Time&quot; (1999). It was chosen as the album's fourth single in some selected territories such as Europe. The song became Spears' second number-one hit in Ireland and the United Kingdom.\n\nThe original concept was to portray Spears in a dream, lamenting over her ex-lover, by whom she was secretly pregnant with their child, but Jive immediately withdrew the idea once it was leaked to the public and received negative reception.\n\nDirected by Billie Woodruff in Los Angeles from October 24-25, 1999, the music video for &quot;Born to Make You Happy&quot; begins with a shot of Spears sleeping. In her dream, she is wearing a shiny silver outfit and sitting in a blue and silver futuristic room with several different levels. Following this part of the video, Spears appears atop the apartment building where this room is found, performing a dance segment in a red top and black skirt. In another part of the dream, Spears, now wearing white clothes, is seen at her room, singing. The last part of the dream has her love interest come into her room to see her. The video concludes with the pair having a pillow fight which Spears wins. The radio edit of the song was used for the video, it shortens two instrumental bridges, one in the middle of the song, and the other one towards the end. It was released in Europe on November 13, 1999.\n\nThe video was originally only aired outside the US and was only shown in the US at concerts during Britney's ...Baby One More Time Tour.\n\nThe song was written by Andreas Carlsson and Kristian Lundin, and was also produced by the latter. It's composed in the key of D Major,  Spears' vocal range in this song is over an octave from F3-B4. Lyrically, in this mid-tempo ballad, Spears recalls a relationship she desires to correct, not quite understanding what went wrong as she comes to the realization that she was &quot;born to make you happy.&quot;\n\nThe CD single released a 'Demo' version of the track, calling it a &quot;Bonus Remix.&quot; The track contains completely alternate vocals and more of an acoustic take of the track. This alternate recording shows off Spears' vocals. This version was recorded in March 1998, while the released version being re-recorded later in 1998.\n\nDespite the song's innocence and purity, the song was originally sexual. The song was so sexual it made the then 16 year-old Britney Spears uncomfortable to record it saying &quot;'This may be a little old for me.' Because of the image thing, I don't want to go over the top.&quot; The song was later rewritten into the innocent ballad it is now.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3138bcfefd8c72e8ec755e031e252691929fea56","amp;dn":"Britney+Spears+-+Born+To+Make+You+Happy++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3138bcfefd8c72e8ec755e031e252691929fea56","infoHashBuffer":{"type":"Buffer","data":[49,56,188,254,253,140,114,232,236,117,94,3,30,37,38,145,146,159,234,86]},"announce":[],"urlList":[]}}