{"title":"Safe Camera Photo Encryption PRO 3.1","uid":12559206,"size":1047555,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:31cd79119abd12dac9b2a87e9821a649d7b5e7a6&amp;dn=Safe+Camera+Photo+Encryption+PRO+3.1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1444681230,"description":"ITS A PRO VERSION. TO GET THE APP REGISTERED, RUN BASE.APK\r\n\r\nSafeCamera is a camera application that uses the military gradeencryption (AES 256) to encrypt your photos on the fly to ensurethey are secure, are safely stored and hidden against third partyinvaders, even if you lose your device and it gets in hands ofprofessional hackers. Securely hide your photos, so that no oneexcept you can access them. SafeCamera has it's own camera modulethat ensures 100% secure storage of the photos.\r\n\r\nKey features:\r\nTake photos that will be instantly on the fly encrypted and thusnever be visible to any application or person until you open itwith SafeCamera providing your master password.\r\nGallery to browse your encrypted photos\r\nCamera with flash and timer for taking self shots\r\nImport existing photos/files to SafeCamera encrypting alsofilenames and delete original files\r\nShare encrypted photos ether encrypted with same password, otherpassword or decrypted\r\nImport encrypted files from other SafeCamera instance\r\nEncryption with state of the art algorithms and implementationschemes that are proven to be 100% secure by governmental andmilitary organizations.\r\n\r\nWe have thought of everything! Did you know that once any infois written into the memory and then deleted or even overwrittenwith another file, it is still possible to restore it? SafeCameranever writes your unencrypted photos into your phone’s SD card. Thephoto is encrypted on the fly right after it is taken and only thenis written to your SD card.\r\n\r\nDo you have files that you would like to keep safe? Just importthem into Safe Camera’s domain and they will be safe. AlthoughSafeCamera is mainly for handling photos, you can also import andkeep safely any other file types.\r\n\r\nWant to share an encrypted photo with someone? Send the photo(s)either encrypted with your current password or re-encrypted with adifferent password. Then just tell the encryption password to yourfriend and he/she will be able to import it into his/her copy ofSafeCamera.\r\n\r\nSafeCamera uses AES 256 bit encryption, which is approved by NSAfor keeping top secret files. SafeCamera derivesencryption/decryption key using PBKDF#2 algorithm using more than2000 iterations.\r\n\r\nSee detailed technical specifications on official websitehttp://www.safecamera.org/\r\n\r\nDesktop version is out at http://www.safecamera.org/desktop","torrent":{"xt":"urn:btih:31cd79119abd12dac9b2a87e9821a649d7b5e7a6","amp;dn":"Safe+Camera+Photo+Encryption+PRO+3.1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31cd79119abd12dac9b2a87e9821a649d7b5e7a6","infoHashBuffer":{"type":"Buffer","data":[49,205,121,17,154,189,18,218,201,178,168,126,152,33,166,73,215,181,231,166]},"announce":[],"urlList":[]}}