{"title":"Kyoto Gardens - Masterworks of the Japanese Gardener's Art 2015","uid":12522385,"size":72466727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31f0265d24e78d1305e7d9f8807ca08ac00fe0ec&amp;dn=Kyoto+Gardens+-+Masterworks+of+the+Japanese+Gardener%27s+Art+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1443906442,"description":"Publisher: Tuttle Publishing; Hardcover with Jacket edition (March 10, 2015)\r\nLanguage: English\r\nISBN-10: 4805313218\r\nISBN-13: 978-4805313213\r\n\r\n&quot;Bring the art and beauty of Japan to your garden with inspiration from Kyoto Gardens, written by Judith Clancy and photographed by Ben Simmons.&quot; —HGTV Gardens\r\n\r\nFeaturing beautiful Japanese garden photography and insightful writing, Kyoto Gardens is a labor of love from master photographer Ben Simmons and Kyoto-based writer Judith Clancy. In their rocks and plants, empty spaces and intimate details—Kyoto's gardens manifest a unique ability to provoke thought and delight in equal measure. These varied landscapes meld the sensuality of nature with the disciplines of cosmology, poetry and meditation. Japanese aristocrats created these gardens to display not just wealth and power, but cultural sensitivity and an appreciation for transcendent beauty. A class of professional gardeners eventually emerged, transforming Japanese landscape design into a formalized art. Today, Kyoto's gardens display an enormous range of forms—from rock gardens display of extreme minimalism and subtle hues, to stroll gardens of luscious proportions and vibrant colors.\r\n\r\nIn Kyoto Gardens Simmons' photographs present a fresh and contemporary look at Kyoto's most important gardens. Their beauty is enhanced and humanized by gardeners tending the grounds using the tools of their art. Clancy's graceful text provides historic, aesthetic and cultural context to the Japanese gardens. Combining wonder and rigor, she describes how Kyoto's most beloved gardens remain faithful to their founders' creative spirit and conception. Journey to Kyoto's thirty gardens with just a turn of a page, or use the handy maps to plan your trip","torrent":{"xt":"urn:btih:31f0265d24e78d1305e7d9f8807ca08ac00fe0ec","amp;dn":"Kyoto+Gardens+-+Masterworks+of+the+Japanese+Gardener%27s+Art+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f0265d24e78d1305e7d9f8807ca08ac00fe0ec","infoHashBuffer":{"type":"Buffer","data":[49,240,38,93,36,231,141,19,5,231,217,248,128,124,160,138,192,15,224,236]},"announce":[],"urlList":[]}}