{"title":"Corbin Fisher - - - Blowing Travis ((MictrmbL))","uid":5300034,"size":144074128,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:3461697ae75ab4d78ab9c3cd8b95f5b53e0f2d8f&amp;dn=Corbin+Fisher+-+-+-+Blowing+Travis+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":32,"time":1264188299,"description":"From the vaults of Corbin Fisher:\n\n\nHooray for Travis! Hell, hooray for Trent!\n\nTo my great pleasure and excitement, Travis agreed to let another guy work that big dick of his for his very first ever bout of guy/guy action! You can tell from his previous videos that we're really excited about Travis being here at CF and that he's also a perfect new addition to CFU. He has the looks, the body, and the personality to really be a star. All that was needed was a willingness to give things a shot with another guy and, after some convincing, that willingness appeared!\n\nThis video was also the perfect opportunity to let Trent take a stab at doing the honors with breaking in a new CF stud. Trent has shown beyond a doubt that he is skilled and talented when it comes to guy/guy action and few guys look as hot, much less obviously enjoy it so much, while in action with his fellow CF studs. So why not have Trent be the one to share that enthusiasm and eagerness with a newbie?\n\nHis nervousness and shyness are two of the traits that make Travis so endearing and appealing. We are treated to quite a dose of both with this video, and it's very apparent just what a new and wild experience this was for Travis. But, just as with his earlier videos, there's just something about being naked and getting off in front of an audience that seems to really do the trick for Travis and not just put him at ease but also turn him on tremendously. It all makes for quite a video!","torrent":{"xt":"urn:btih:3461697ae75ab4d78ab9c3cd8b95f5b53e0f2d8f","amp;dn":"Corbin+Fisher+-+-+-+Blowing+Travis+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3461697ae75ab4d78ab9c3cd8b95f5b53e0f2d8f","infoHashBuffer":{"type":"Buffer","data":[52,97,105,122,231,90,180,215,138,185,195,205,139,149,245,181,62,15,45,143]},"announce":[],"urlList":[]}}