{"title":"Hard Drive Inspector 3.35 Build 279 Portable","uid":5291367,"size":6824916,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:36cfb38b7a6f6647679615d9c5ec17c3317ce052&amp;dn=Hard+Drive+Inspector+3.35+Build+279+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":3,"time":1263910266,"description":"Hard Drive Inspector 3.35 Build 279 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included.\n\n\nHard Drive Inspector is a powerful, effective and easy-to-use program that monitors hard drive health. The value of information stored on an average computer hard drive often exceeds the value of the computer itself. But a hard drive is one of the most unreliable internal computer devices. When it crashes (which happens quite frequently), the stored information will be lost fully or partially. Subsequent information recovery is either not possible at all, or constitutes a very sophisticated and expensive procedure that can be performed only by specialists.\n\nModern hard drives support S.M.A.R.T. (Self-Monitoring, Analysis, and Reporting Technology) that was specially developed to detect upcoming disk failures. Using this technology Hard Drive Inspector can monitor the current state of various life-critical parameters describing a disk's reliability and performance. Hard Drive Inspector analyzes this data and warns the user if the parameters indicate a critical reduction of disk reliability. Timely alerts make it possible to copy the data and replace an unreliable disk, thus preventing information loss.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.altrixsoft.com/en/hddinsp/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.altrixsoft.com/en/hddinsp/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:36cfb38b7a6f6647679615d9c5ec17c3317ce052","amp;dn":"Hard+Drive+Inspector+3.35+Build+279+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36cfb38b7a6f6647679615d9c5ec17c3317ce052","infoHashBuffer":{"type":"Buffer","data":[54,207,179,139,122,111,102,71,103,150,21,217,197,236,23,195,49,124,224,82]},"announce":[],"urlList":[]}}