{"title":"uTorrent 2.0 RC3 (build 17774)","uid":5287124,"size":318768,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:36d1c0414957a16fadea702b859f85ced21e0601&amp;dn=uTorrent+2.0+RC3+%28build+17774%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1263759577,"description":"Copied from Ã‚ÂµTorrent Homepage:\n\n\nWhat Is Ã‚ÂµTorrent?\n\n\nMicro-Sized Yet Feature Filled\n\nÃ‚ÂµTorrent is the world's most popular BitTorrent client.\nMost of the features present in other BitTorrent clients are present in Ã‚ÂµTorrent, including bandwidth prioritization, scheduling, RSS auto-downloading and Mainline DHT (compatible with BitComet). Additionally, Ã‚ÂµTorrent supports the Protocol Encryption joint specification (compatible with Azureus 2.4.0.0 and above, BitComet 0.63 and above) and peer exchange.\n\n\nResource-Friendly\n\nÃ‚ÂµTorrent was written with efficiency in mind.\nUnlike many torrent clients, it does not hog valuable system resources - typically using less than 6MB of memory, allowing you to use the computer as if it weren't there at all. Additionally, the program itself is contained within a single executable less than 220 KB in size.\n\n\nSkinnable and Localized\n\nVarious icon, toolbar graphic and status icon replacements are available, and creating your own is very simple. Ã‚ÂµTorrent also has support for localization, and with a language file present, will automatically switch to your system language. If your language isn't available, you can easily add your own, or edit other existing translations to improve them!\n\n\nActively Developed and Improved\n\nThe development team puts in a lot of time working on features and making things more user-friendly. Releases only come out when they're ready, with no schedule pressures, so the few bugs that appear are quickly addressed and fixed.\n\n\nChangelog:\n\n\nRelease Notes:\n\n\nWe've added UDP tracker support!\n\n\nuTP has been improved significantly over the previous alpha, with many bugs fixed and performance improvements. It's no longer hidden in Advanced settings.\n\n\nThe setup dialog has been overhauled to make it much easier to use and with a built-in speed test. It's still not quite complete yet, but this will give you a good taste of what we're up to with it!\n\n\nA new transfer cap feature has been added to track bandwidth usage, along with graphs to show your usage.\n\n\n\nFeature Overview:\n\nUDP trackers are a different protocol for tracker communication that uses significantly less processing power on the tracker end.\nIt's important for us to support this because trackers have limited resources, so this should allow them to support many more users with their current hardware and not crash under the load.\n\nuTP is an alternative communication method for BitTorrent traffic that allows the client to automatically regulate its bandwidth usage to avoid adversely impacting your internet connection. This will allow you or other users on the network to download their torrents but still allow others on the network to function with little difference. This does not require any additional setup.\nIn addition, uTP in this version has added its own form of STUN, a method of getting incoming connections without direct connectivity to the Internet.\nThis allows Ã‚ÂµTorrent to punch holes through routers and firewalls to increase connectivity and improve speeds. It is even possible to connect two firewalled peers through uTP's NAT traversal feature.\n\nThe transfer cap settings were added in response to various users who have ISP-mandated caps on how much data they can download/upload in a month.\nNow you can track your usage in MB (with a handy graph to visualize it) and even configure Ã‚ÂµTorrent to stop torrenting once the limits are exceeded.\nCurrently, you can configure the time interval, the data cap and whether it should stop based on only download, upload, or both combined.\nAs a privacy notice, this traffic data is not sent back to us or anyone. \n\n\n\n2010-01-12: Version 2.0 RC3 (build 17774)\n\n\nFix: Compelete pending Disk operations before automatically shutting down\n\nFix: Don't exceed the upload limit with overhead when calc_overhead is on\n\nFix: Point uT at correct help url.\n\n\nChange: Improve downloading/uploading performance with mixed-mode TCP and uTP\n\nChange: Improve torrent gray out by also graying out progress bar when stopped by scheduler\n\nChange: Disable net.calc_overhead by default\n\n\nFix: Don't gray out force started torrents when scheduler has stopped other torrents\n\nFix: Compatibility with old skins\n\n\nChange: Use different icon for disabled RSS feed\n\n\nFix: Sharpen icon edges\n\n\nED2K Link:\ned2k://|file|utorrent.exe|318768|AA71375A1134AB000842A55F1364DFBE|h=FVTUTTCK4A7DH44EEUYAEEE5HCUQSOFJ|/\n\n\n\nComments from the uploader (olofolleola4):\nHere is a link if you cannot download it through this torrent:\nupload box  .  com  /  files  /  3ac3ed10b3\nrapid share  .  com  /  files  /  336812279  /  utorrent.exe","torrent":{"xt":"urn:btih:36d1c0414957a16fadea702b859f85ced21e0601","amp;dn":"uTorrent+2.0+RC3+%28build+17774%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d1c0414957a16fadea702b859f85ced21e0601","infoHashBuffer":{"type":"Buffer","data":[54,209,192,65,73,87,161,111,173,234,112,43,133,159,133,206,210,30,6,1]},"announce":[],"urlList":[]}}