{"title":"Whereisit Ver 2010 Build 218 + All Languages.zip","uid":12514384,"size":7724913,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:39c1bc5f4a4725107128cf8e26016c8150ec300f&amp;dn=Whereisit+Ver+2010+Build+218+%2B+All+Languages.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1443645738,"description":"upload dzaga29\r\n\r\nWhereIsIt is an application designed to help you maintain and organize a catalog of your computer media collection, including CD-ROMs, audio CDs, diskettes, removable drives, hard drives, network drives, DVDs, or any other media that Windows can access as a drive.\r\n\r\nThe most basic goal for WhereIsIt is to provide access to the contents of any media you have from a cataloged database, even if the media itself is not available on the system - you can browse lists of files and folders, search by any criteria, use descriptions, thumbnails, categories, flags, etc.\r\n\r\nWhereIsIt can be used to handle any kind of data, including downloaded programs, magazine CD-ROMs, music collections like MP3s or audio CDs, graphics collections, document backups, etc. WhereIsIt can handle lots of them, too, a couple hundreds or thousands disks in a catalog is nothing unusual, yet catalogs remain reasonably small, single-filed and easy to transfer or send to other users. You can also create more than one catalog, and at any time open and work with as many catalogs at once as needed.\r\n\r\nWhereIsIt is easy to use for both beginners and advanced users. It features a familiar and well thought-out, Explorer-like user interface, combined with strong searching and reporting capabilities, multi-language support, automated description and thumbnails importing through extendable plugins from more than 70 different sources, and much more besides","torrent":{"xt":"urn:btih:39c1bc5f4a4725107128cf8e26016c8150ec300f","amp;dn":"Whereisit+Ver+2010+Build+218+%2B+All+Languages.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39c1bc5f4a4725107128cf8e26016c8150ec300f","infoHashBuffer":{"type":"Buffer","data":[57,193,188,95,74,71,37,16,113,40,207,142,38,1,108,129,80,236,48,15]},"announce":[],"urlList":[]}}