{"title":"[DOC] Speciale Beppe Grillo [DVDrip Divx ITA] TNT Village","uid":12564112,"size":439351296,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3ae49e4ebd9e18e81cace66f8fac9cb246cc9402&amp;dn=%5BDOC%5D+Speciale+Beppe+Grillo+%5BDVDrip+Divx+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"l.diliberto","files":1,"time":1444758001,"description":"[DOC] Speciale Beppe Grillo [DVDrip Divx ITA] TNT Village\r\n\r\n.: Release Originale :.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=91828\r\n\r\nUno speciale su Bebbe Grillo, comico che da tanti anni non appare più in video. Lo speciale è intitolato &quot;Te la do io l'Italia&quot; (richiamando il titolo di alcuni spettacoli che Grillo fece negli anni '80) e fa parte del programma La storia siamo noi di Giovanni Minoli.\r\nImmagini inedite, backstage e interviste, fra gli altri, a Maurizio Crozza, Antonio Ricci, Stefano Benni e Pippo Baudo. Proprio Crozza dà una divertente descrizione del comico (ex?) ligure, ora blogger più famoso d'Italia:\r\n&quot;E' partito comico e' diventato filosofo. Ha fatto la carriera invertita di Buttiglione. Ogni volta che parla di un azienda questa fallisce&quot;\r\nTutti sapeete come il pubblico sia diviso quando si parla di lui: c'è chi lo ama e lo considera un personaggio coraggioso, in prima linea nelle lotte contro i mulini a vento; c'è però anche chi lo denigra, definendolo un falso predicatore, un guru fallito. La &quot;voce del web&quot; sarà presa in considerazione?\r\n\r\nEra stato annunciato con la dovuta enfasi. Con un'intervista rilasciata al Corriere della Sera, Beppe Grillo fece sapere che non era d'accordo, e che ha cercato con ogni mezzo di bloccare lo special che La storia siamo gli dedicò. Ha potuto ben poco, Grillo, considerato il fatto che la trasmissione è fatta di contributi &quot;storici&quot; relativi alle sue passate apparizioni in RAI. Apparizioni di cui la RAI detiene fieramente e indiscutibilmente i diritti.\r\nMa ci ha tenuto lo stesso a mostrare il proprio disappunto, visto che i suoi interessi sono ben lontani dalla televisione: blog, YouTube e wikipedia sono al centro dei pensieri del comico-filosofo, che di tv non vuole proprio più saperne.\r\nDa parte sua, Minoli ribatte che si tratta di un omaggio, non di uno sfruttamento a posteriori. Noi non entriamo nella polemica e ci limitiamo a consigliarvene la visione. Sebbene, un piccolo appunto a Grillo ci sentiamo di farlo: la tv continua a essere un mezzo di comunicazione di massa. Un suo ritorno sarebbe auspicabile, almeno dal punto di vista dello spettatore.\r\n\r\n[img]http://static.blogo.it/tvblog/beppegrillo.jpg[/img]\r\n\r\n========================================\r\n\r\n.: Dati tecnici del file :.\r\n\r\nVideo Codec..: DivX 5.0\r\nVideo Bitrate: 1002 kb/s\r\nAudio Codec..: MP3\r\nAudio Bitrate: 96 kb/s\r\nFrame Size...: 720x576","torrent":{"xt":"urn:btih:3ae49e4ebd9e18e81cace66f8fac9cb246cc9402","amp;dn":"%5BDOC%5D+Speciale+Beppe+Grillo+%5BDVDrip+Divx+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ae49e4ebd9e18e81cace66f8fac9cb246cc9402","infoHashBuffer":{"type":"Buffer","data":[58,228,158,78,189,158,24,232,28,172,230,111,143,172,156,178,70,204,148,2]},"announce":[],"urlList":[]}}