{"title":"SampleKings AKAI MPC 5000 3 DVD Tutorial","uid":12572341,"size":3614117882,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4075154b3a8ba1acfbb22c38e34db695c747ce9f&amp;dn=SampleKings+AKAI+MPC+5000+3+DVD+Tutorial&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"A_Garden","files":10,"time":1444861118,"description":"Description from http://www.samplekings.com/akai_mpc5000.html:\r\n\r\n&quot;These 3 DVD's cover every feature on the MPC5000, we explain how the buttons, pads, knobs, and sliders, work with the software to give you a better understanding of how to get around. We set up the back with the right cables, next we show you how to install the memory card, and DVD rom drive.After we set it up we start to sample and explain every feature there is in the sampling menu.They have a new feature which is called SNAP-0, it allows you to move your start and end values to the nearest point where the next 0 crossing is, it works and it helps you get the right sample size. We cover everything including Time Stretching, Chop Shop, Patched Phrase, sliced sample to a program and much more. Next we et in to sequencing track with looped samples and setting up programs for your samples and using the new Q-link features. This is the newest MPC to date and we know it inside out. This DVD is 90 minutes long after this its on to the MPC5000 Instructional DVD part 2 to learn more about the MPC5000.\r\n\r\nOn the AKAI MPC5000 DVD PART 2 we take the sample we turned into a patch phrase and use it in a sequence we put it in a program, next we setup the right BPM (beats per minute), next we need to select a track to record on, here we cover all aspects of the sequence window and we change the tempo to show how the sample remains in sync. We teach you how to copy the measures to extend the sequence and how to change the events in a sequence. Next we cover step editing, here we go to the exact place in our sequence and place a sample where we want, whether it's the duration of a note, the attack (how hard we hit the pad), the volume, the midi note or delete the part we don't need. Our next lesson is how to use the program section on the MPC5000, this very similar to other mpc's, we can place up to 4 samples for any part and change their volume level, tuning, range , make it poly, and add it to a mute group, and much more. This use full when combining samples and setting them up into groups. We also cover how to use the all the effects in the system, from the master effects on the output to the effects in the mixer section and switching from 1 2 3 or 4 sends. We add more sequences so we can create a song form and explain how to get the right bars and tempo of for the samples. Next we cover the newest feature recording in a song, which allows you record vocals, a bass player, a DJ, or a guitar over your song. We cover a lot on this DVD it's over 90 minutes long. [see video previews]\r\n\r\nWhen we got this MPC it was so cool to have a new MPC to play with again, it can do so much, it's got this synth on it as well as a multi track recorder, so we made the first 2 DVD's and I said we need to make a new DVD with all the best features on this MPC5000 so here it is. Doc sets it up his way, loads up some samplekings samples, of course, gets a loop from a CD, chops it up, then takes another loop and patch phrases it so it will loop at any tempo. Next we make a beat with the loop and do a little time correction throw some samples in, apply some swing, and get some levels. Then we use the new synth section, just want to see if it can do as good as other synths but first we got to setup a midi keyboard to trigger the synth sounds, once we get a sound we like we try to edit some of the parameters. The multi track recorder is diffrent from the first verison in the MPC2500.&quot;","torrent":{"xt":"urn:btih:4075154b3a8ba1acfbb22c38e34db695c747ce9f","amp;dn":"SampleKings+AKAI+MPC+5000+3+DVD+Tutorial","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4075154b3a8ba1acfbb22c38e34db695c747ce9f","infoHashBuffer":{"type":"Buffer","data":[64,117,21,75,58,139,161,172,251,178,44,56,227,77,182,149,199,71,206,159]},"announce":[],"urlList":[]}}