{"title":"Deadline Live with Jack Blood - 2010 Jan 20 WE [sebaygo1]","uid":5298405,"size":22001703,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4175d9e7a368a064f699572cb6a0a4b6abf03f0c&amp;dn=Deadline+Live+with+Jack+Blood+-+2010+Jan+20+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":9,"time":1264135533,"description":".\n\nDeadline Live with Jack Blood\nWednesday, 20 January 2010\n\naudio files are divided on half-hour breaks\n\n\n\n[sebaygo1]\n\n\n\n\n[show description as reported in Jack's archives]\n\n\n\nFirst Hour: \n\nO'Bomba gets a nasty message from &quot;wee tha Peeps&quot; on his one year anny of being &quot;Teleprompter reader and Chief!&quot; We are joined by Jake Witmer from the Joe Kennedy campaign. Joe was the REAL liberty candidate running in this crucial(s)election in Mass. Who was the REAL T Party candidate? What is the REAL T Party movement? Why isn't Ron Paul supporting guys like Joe Kennedy (no relation to Teddy)??? BREAKING NEWS FROM http://WWW.DEADLINELIVE.INFO\n\n\n\nSecond Hour: \n\nWe are joined by Donna Conroy Executive Director at http://www.brightfuturejobs.com . Donna is an IT lobbiest working to keep IT jobs in the USA, and for Americans. She is champoining legislation to do just this. Lou Dobbs endorses it.\n\n\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n NOTE: The material here is made available strictly as\n information. Do not assume support or endorsement on my\n part of all contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n my torrents since 26 Nov 2009:\t\n &lt;a href=&quot; http://thepiratebay.se/user/sebaygo1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/sebaygo1&lt;/a&gt;\n \n my RSS feed:\t\n &lt;a href=&quot; http://rss.thepiratebay.se/user/7621f7439b536868ef7a883e0b221961&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://rss.thepiratebay.se/user/7621f7439b536868ef7a883e0b221961&lt;/a&gt;\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n\n\n\n\n\n==============================\nDeadline Live with Jack Blood is now in its 8th year of broadcasting. With several years of research and comprehensive information gathering, Jack has a serious understanding of how the Global Super Elite do their business, and delivers a daily analysis of world events with satire and a song.\n\nHe understands and decodes the doublespeak, and groupthink of the mainstream media, and outlines the agenda of those who would seek to kill off or enslave the planet. Jack discusses mind control, corporate corruption, the police state, globalism, the United Nations agenda (inalienable rights vs UN privileges), secret societies, government sponsored terrorism, and collectivism vs individual sovereignty.\n\nJack Blood is an activist, an investigative blogger, multimedia artist, and a thought criminal. Deadline Live is an Infusion of music, culture, news du jour, opinions, and reality.\n==============================\n\n","torrent":{"xt":"urn:btih:4175d9e7a368a064f699572cb6a0a4b6abf03f0c","amp;dn":"Deadline+Live+with+Jack+Blood+-+2010+Jan+20+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4175d9e7a368a064f699572cb6a0a4b6abf03f0c","infoHashBuffer":{"type":"Buffer","data":[65,117,217,231,163,104,160,100,246,153,87,44,182,160,164,182,171,240,63,12]},"announce":[],"urlList":[]}}