{"title":"Advanced Thermoforming - Methods, Machines and Materials, Applic","uid":12403205,"size":4649181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:440d51bf95424581f7f5ec00158744b41ca59e05&amp;dn=Advanced+Thermoforming+-+Methods%2C+Machines+and+Materials%2C+Applic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"clouderone","files":1,"time":1442054573,"description":"Advanced Thermoforming - Methods, Machines and Materials, Applications and Automation (Wiley Series on Polymer Engineering and Technology).pdf\n\nISBN 978-0-470-49920-7\n\nIntroduces the latest innovations in thermoforming materials, processes, and applications\n\nAdvanced Thermoforming brings readers fully up to date with the latest standards, processes, materials, and applications in the field. From forming to filling to sealing processes, the author explains everything that can now be accomplished using the most advanced thermoforming technologies available. Moreover, readers learn how to fully leverage these technologies in order to design and manufacture products that meet all specifications at minimum cost and maximum efficiency.\n\nEmphasizing the application of advanced thermoforming for the production of technical parts and packaging, the book:\n\nGuides readers through all facets of development, design, and machine and mold technology\n\nRecommends new technologies that offer higher productivity, better quality, and lower costs\n\nDescribes common raw materials used in thermoforming, including how specific materials affect the production process\n\nExplains the proper handling of semi-finished products and formed parts\n\nSets forth the basic principles of extrusion, an essential process underlying thermoforming\n\nIntroduces the latest software techniques to simulate the thermoforming of new products\n\nThroughout the book, readers learn about the latest innovations in thermoforming, from thermoformed automobile body parts to fully automated packaging assembly lines. The author offers valuable content from his interviews with leading industrial thermoformers, sharing insights and tips from their years of hands-on experience with readers.\n\nWith Advanced Thermoforming as their guide, polymer and plastics engineering professionals and students can now explore and exploit the full range of possibilities that thermoforming technology offers","torrent":{"xt":"urn:btih:440d51bf95424581f7f5ec00158744b41ca59e05","amp;dn":"Advanced+Thermoforming+-+Methods%2C+Machines+and+Materials%2C+Applic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"440d51bf95424581f7f5ec00158744b41ca59e05","infoHashBuffer":{"type":"Buffer","data":[68,13,81,191,149,66,69,129,247,245,236,0,21,135,68,180,28,165,158,5]},"announce":[],"urlList":[]}}