{"title":"Abounding Grace An Anthology Of Wisdom by M. Scott Peck (unabrid","uid":12340739,"size":190725136,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:455fcbb94bf15a3048c6d5cf32f8aa421d9cf0b4&amp;dn=Abounding+Grace+An+Anthology+Of+Wisdom+by+M.+Scott+Peck+%28unabrid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kristi2374","files":1,"time":1441294950,"description":"Abounding Grace An Anthology Of Wisdom by M. Scott Peck\n\nAbounding Grace.mp3\n\nM. Scott Peck, renowned for his writings on spiritual growth and author of the classic, The Road Less Traveled, has inspired countless people with his words of wisdom and insight. Now, in Abounding Grace, Dr. Peck presents us with a collection of his favorite quotations on such essential aspects of life as happiness, love, faith, and virtue. Gleaned from writers and thinkers, both famous and obscure, ancient and modern, these words-sometimes paradoxical, sometimes humorous, always eloquent and thought provoking-serve as guideposts on the road to a more spiritual existence. In his commentary introducing each of the 12 parts of his book, Dr. Peck challenges us to live a life of consciousness, goodness, and wholeness, and to look within ourselves and seriously consider how we may make the most of who we are. Through questions, examples, and anecdotes from his own experiences, Dr. Peck provides an original, fascinating, and enriching reading experience, creating, in truth, An Anthology of Wisdom. Abounding Grace is divided into 12 parts: Happiness, Courage, Compassion, Purity, Perseverance, Courtesy, Faith, Goodness, Love, Respect, Strength, and Wisdom. Dr. Peck has written a lengthy introduction and a commentary for each of the 12 parts. Below is an excerpt from his commentary on Happiness:&quot;Happiness as an unmodified goal will likely be self-defeating. . . . Seek to be loved and you probably won't be; seek to love, on the other hand, and you probably will be. Look solely for happiness, and I doubt you'll find it. Forget about happiness, seek wisdom and goodness, and happiness will probably find you.&quot; The following are a few quotations from the same part:&quot;Happiness depends upon ourselves.&quot; -Aristotle&quot;The bird of paradise alights only upon the hand that does not grasp.&quot; -John Berry&quot;When you jump for joy, beware that no one moves the ground from beneath your feet.&quot; -Stanislaw Lec&quot;We all may have come on different ships, but we're in the same boat now.&quot; -Martin Luther King Jr.&quot;Arrange whatever pieces come your way.&quot; -Virginia Woolf &quot;Joy is not in things; it is in us.&quot; -Richard","torrent":{"xt":"urn:btih:455fcbb94bf15a3048c6d5cf32f8aa421d9cf0b4","amp;dn":"Abounding+Grace+An+Anthology+Of+Wisdom+by+M.+Scott+Peck+%28unabrid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"455fcbb94bf15a3048c6d5cf32f8aa421d9cf0b4","infoHashBuffer":{"type":"Buffer","data":[69,95,203,185,75,241,90,48,72,198,213,207,50,248,170,66,29,156,240,180]},"announce":[],"urlList":[]}}