{"title":"Tweetbot for Twitter 2.1 (Mac OSX)","uid":12537232,"size":11885227,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4606f5ff3317afa6a570791eb1f0d8fd7f7e657f&amp;dn=Tweetbot+for+Twitter+2.1+%28Mac+OSX%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1444337560,"description":"From MacTake.com\r\n\r\nTweetbot is an award-winning, native Twitter client for the Mac. This full-featured client has fantastic support for multiple accounts and lists. It also has powerful mute filters, multiple column views, and much more. \r\n\r\nHighlights: \r\n\r\nDesigned for OS X. \r\nTweetbot feels right at home in Yosemite with its beautiful interface, animations, support for Retina Displays and Notification Center. \r\n\r\nMultiple Columns &amp; Windows. \r\nOpen saved searches, lists, mentions, direct message conversations and more into columns or windows and never miss a tweet. \r\n\r\nMute Filters. \r\nHide tweets that you don’t want to see for a short period or forever. Mute people, hashtags, or tweets via keywords (includes regex). \r\n\r\nMultiple Device Sync. \r\nIf you use Tweetbot on iOS, your timeline, unread status, and mute filters will automatically stay in sync so you can always continue where you left off across devices. \r\n\r\nSupport for 3rd Party Services. \r\nTweetbot supports bitly, CloudApp, Droplr, img.ly, Instapaper, Mobypicture, Pinboard, Pocket, Readability, and yfrog\r\n\r\nWHAT'S NEW\r\nVersion 2.1:\r\n- New Activity View. \r\n- Quoted tweets now show up in mentions. \r\n- Play Twitter, Instagram, and Vine video within the app. \r\n- Pinch to zoom images or resize the image view window. \r\n- Support for uploading Twitter hosted videos. \r\n- Retweets button in the status detail now shows who retweeted. \r\n- Swipe-back gesture now works in the profile view. \r\n- People search popover has been simplified and should return more relevant results. \r\n- Direct message images are now displayed. \r\n- Added &quot;View &gt; Scroll To Last Read&quot; to easily return to last read tweet. \r\n- Fixed the issue where you weren't able to see all list members. \r\n- Fixed the issue where you wouldn't see &quot;Subscribed Lists&quot; in the timeline list picker or column button in bottom left of main window. \r\n- Fixed the issue where you could keep clicking on media and get many loading views. \r\n- Fixed the issues with the selected tweet not being fully visible while navigating using the up/down arrow or page up/down keys. \r\n- If the search field is visible in a column titlebar and you press &quot;esc&quot; when search field not active it will now be dismissed. \r\n- When viewing a status detail view, you can select words, control-click, and look up the word in the dictionary. \r\n- Improved memory management. \r\n- Many minor bug fixes","torrent":{"xt":"urn:btih:4606f5ff3317afa6a570791eb1f0d8fd7f7e657f","amp;dn":"Tweetbot+for+Twitter+2.1+%28Mac+OSX%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4606f5ff3317afa6a570791eb1f0d8fd7f7e657f","infoHashBuffer":{"type":"Buffer","data":[70,6,245,255,51,23,175,166,165,112,121,30,177,240,216,253,127,126,101,127]},"announce":[],"urlList":[]}}