{"title":"TextPad v5.3.1","uid":5287983,"size":3133058,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:46839a4204e69b50adf9872ef7bbd499d37dc43b&amp;dn=TextPad+v5.3.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"covertopz","files":-1,"time":1263787538,"description":"TextPad is a powerfull text editor for Microsoft Windows.\n\n\nKey features include:\n\n    * the ability to maintain block indents\n    * automatic code indentation\n    * regular expression based search and replace, including multiline regex\n    * macro recording feature to facilitate complex text transformations and data processing.\n       - macro feature supports multiple regex searches (and replacements) within a macro\n    * syntax highlighting (extendable to many different languages)\n    * ability to call external programs (such as compilers)\n       - regex matching can be used to jump to a line number in a file given in the output from external programs (e.g. to locate the cause of a compiler error)\n       - automatic integration with Java JDK, if JDK is already on the machine\n    * large file support\n    * support for editing multiple files, with tabbed document selection\n    * block select mode\n    * synchronized scrolling of multiple files\n    * clip libraries - snippet management for reusable portions of text to insert into documents\n    * clipboard history - Allowing textpad to function as a Multiple Clipboard tool\n    * Bookmarking of lines, therefore allowing users to copy specific lines (e.g. log file error messages), and then paste them to another document.\n\n\nSnippets (Clip Library):\n\nThe Clip Library is a TextPad sidebar that allows users to store small items persistently, and then use them easily. This is done by double clicking clip names in the Clip Library sidebar.\n\nTextPad comes with a number of pre-defined clip libraries, including ANSI characters, HTML characters and HTML tags. A very useful clip library is the Clipboard History. This is a list of previous Clipboard contents. So even though the standard Windows Clipboard can only hold one piece of information, the TextPad Clipboard History Clip Library can access a whole history of entries.\n","torrent":{"xt":"urn:btih:46839a4204e69b50adf9872ef7bbd499d37dc43b","amp;dn":"TextPad+v5.3.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46839a4204e69b50adf9872ef7bbd499d37dc43b","infoHashBuffer":{"type":"Buffer","data":[70,131,154,66,4,230,155,80,173,249,135,46,247,187,212,153,211,125,196,59]},"announce":[],"urlList":[]}}