{"title":"iPhoto Library Manager 4.2.1 (Mac OSX)","uid":12467659,"size":7259353,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4947d34c5c0e6293c31aa7b7fc7290ae5ef3983a&amp;dn=iPhoto+Library+Manager+4.2.1+%28Mac+OSX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1442876606,"description":"From MacTake.com\n\niPhoto Library Manager allows you to organize your photos among multiple iPhoto libraries, rather than having to store all of your photos in one giant library. You can browse the photos in all your libraries directly from iPhoto Library Manager, without having to open each library in iPhoto just to see its photos, and search across all your libraries to help track down a particular photo.\n\nFeatures include\n- Multiple iPhoto libraries. iPhoto Library Manager lets easily create libraries to split up your collection, avoiding iPhoto slowdowns.\n- Smarter searching. iPhoto Library Manager lets you search for photos across one library or many. You don't even need to launch iPhoto.\n- Copy photos and metadata. Put everything in its right place by dragging and dropping images from library to library.\n- Nix the dupes. Need to identify and remove duplicate photos across multiple libraries? iPhoto Library Manager does it quickly and easily.\n- Merge libraries. Take entire libraries and merge them together into one, eliminating duplicates in the process.\n- FIx iPhoto corruption. Use iPhoto Library Manager to rebuild your library from scratch while retaining all your iPhoto organization and metadata.\n\n\n\nWHAT'S NEW\nVersion 4.2.1:\n\n- When bringing up the QuickLook window to browse photos on Yosemite, navigating using the arrow keys now works again\n- Keep the duplicate browser from gradually scrolling up while adjusting the photo size\n- Added documentation on how to update iPhoto on OS X 10.10.3\n- Fixed a hang that could occur on startup if a large number of libraries were inaccessible, e.g. on an unconnected external drive","torrent":{"xt":"urn:btih:4947d34c5c0e6293c31aa7b7fc7290ae5ef3983a","amp;dn":"iPhoto+Library+Manager+4.2.1+%28Mac+OSX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4947d34c5c0e6293c31aa7b7fc7290ae5ef3983a","infoHashBuffer":{"type":"Buffer","data":[73,71,211,76,92,14,98,147,195,26,167,183,252,114,144,174,94,243,152,58]},"announce":[],"urlList":[]}}