{"title":"Dinosaur World","uid":5292177,"size":4462641464,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:495a7ff889fbca196cd7ed10cc59094ba8a1b23d&amp;dn=Dinosaur+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"andxxx92","files":2,"time":1263931129,"description":" Dino-World is provided by Feenixx Publishing, Inc., publisher of the popular content-intensive Info-posters.  Our posters cover many aspects of science and nature.  Each provides a comprehensive overview of the subject presented through magnificent illustrations and informative text.  The first step in preparing a poster is to extensively research the subject.  Many people work on each poster so, to aid coordination, everything is published to an &quot;in-house&quot; website that keeps everyone informed as the current status of a project.  \n    Although our posters cover many subjects (See Feenixx.com), those dealing with prehistoric life are especially popular. It is also an area in which our knowledge is rapidly expanding, so we are continually updating our in-house web to include new discoveries.  Prior to reprinting, each poster is reviewed to determine if it requires updates.  This new information helps us to make that decision.  We realized that the results of our efforts could also be very useful to others and this led to the decision to publish a version accessible to everyone.  A poster contains only so much space, so the web could be used to present additional information.\n    This web is organized by poster.  It includes those now in print as well as those now being created.  The inclusion of the latter permits us to share information with specialists around the world.                                  ","torrent":{"xt":"urn:btih:495a7ff889fbca196cd7ed10cc59094ba8a1b23d","amp;dn":"Dinosaur+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"495a7ff889fbca196cd7ed10cc59094ba8a1b23d","infoHashBuffer":{"type":"Buffer","data":[73,90,127,248,137,251,202,25,108,215,237,16,204,89,9,75,168,161,178,61]},"announce":[],"urlList":[]}}