{"title":"The Order of Lucifer (Frederick W. Nagash)","uid":12574434,"size":7827849,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ea4da52df0bbd14821fc7d11409a8f238ed35f1&amp;dn=The+Order+of+Lucifer+%28Frederick+W.+Nagash%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":70,"time":1444878402,"description":"##########################################################################\r\n\r\n# # # The Order of Lucifer (Frederick W. Nagash)# # #\r\n\r\nALL eBOOKS ARE IN PDF FORMAT.\r\n\r\n--- Modern Luciferianism -- Real Satanism ---\r\n\r\n#About Luciferianism:\r\n\r\nLuciferianism is a belief system that includes both theistic and atheistic denominations and is, therefore, heavily influenced by differing personal beliefs. Considered by many to be a religion, and by some to be a philosophy or way of life, luciferianism as a whole has no specific dogma to which its followers adhere. Rather, it encompasses a broad range of beliefs with numerous personal variations, ranging from the veneration of a literal deity and the practice of occultism, to a secular set of principles that use mythological references as a form of symbolism and cultural tradition.\r\n\r\n#About the Church of Lucifer:\r\n\r\nThe Church of Lucifer has been in existence for over 20 years, and has been known by other names. \r\n\r\nThe COL was founded by Rev. Robert Stills, 22nd American Generation of our tradition, whom ran the COL under the names of Order of the Archon, Temple of Shaitan and many others. It was then, when Rev. Frederick Nagash was studying under Rev. Stills. Later, Rev. Stills died of cancer, and had made Rev. Frederick Nagash, ordained 28th American Generation the High Priest of the Church of Lucifer. A few years later (1996), the Church of Lucifer was introduced to the internet. Rev. Frederick Nagash was ordained only a short time before he took over the COL. Rev. Frederick Nagash, trained by Rev. Robert Stills, has studied and mastered all forms of magick. These include, but are not limited to, Enochian Magick, Luciferic Magick, Goetia, Hermetic, Necromantic, Chaos, Kabbalah and many other forms, too numerous to name here. \r\n\r\nIn 1997, Rev. Frederick Nagash had found another apprentice to teach our traditional ways. That is when Rev. Satrinah Nagash had become his apprentice. Rev. Satrinah Nagash's studies prior to Rev. Frederick Nagash's training include: Tarot, Satanic Witchcraft, Herbal and Mineral Studies, Babylonian/Sumerian studies and Modern Satanism. She had decided that modern satanism was not the way to go and had talked to Rev. Frederick Nagash on several occasions through e-mail. That is when she took tutelage from Rev. Frederick Nagash. After six months, they were married and her intensive training had begun in all forms of magick. Currently, Rev. Satrinah Nagash is the 29th American Generation of our Tradition and is the High Priestess of the Church of Lucifer.\r\n\r\nThough always interested in discovering hidden things, Rev. Xul first became actively interested in the occult at the age of 14. First exploring the LaVeyan branch of Modern Satanism, then moving on to more traditional forms such as Voodoun, folklore, and Shamanism, Maskim developed a firm foundation for his occult studies. At the age of 18, he discovered a section of the Left-Hand Path known as Luciferianism. The philosophical tenets were already in line with his own, and the spiritual aspect was very appealing. Maskim applied for membership in the Church of Lucifer and made his way up. On top of the Satanism and Luciferian studies, Maskim has also done extensive research and ritual practice in the Sumerian, Norse, and Vampiric fields of the Left-Hand Path. Currently, the Church of Lucifer is run by the Order of the Quadragram. The Order of the Quadragram is a group of people, 3 women and 2 men, whom have a background in every facet of the Left Hand Path. All administrative duties are carried out by the Order of the Quadragam.\r\n\r\n##########################################################################","torrent":{"xt":"urn:btih:4ea4da52df0bbd14821fc7d11409a8f238ed35f1","amp;dn":"The+Order+of+Lucifer+%28Frederick+W.+Nagash%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ea4da52df0bbd14821fc7d11409a8f238ed35f1","infoHashBuffer":{"type":"Buffer","data":[78,164,218,82,223,11,189,20,130,31,199,209,20,9,168,242,56,237,53,241]},"announce":[],"urlList":[]}}