{"title":"Geniet.Och.Pojkarna.2009.SWESUB.XviD-Movieboys","uid":5291489,"size":714161656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4eff8645b7462e85b8d2443da1970ca5b9ef9ea2&amp;dn=Geniet.Och.Pojkarna.2009.SWESUB.XviD-Movieboys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RosaMannen","files":2,"time":1263914087,"description":"movieboys proudly presents:\ngeniet och pojkarna\n\nsource:dvb\nyear:2009\nruntime:89 min\ngenre:documentary\nlanguage:english\nsubtitles:swedish\nurl:n/a\n\nplot:\nCarleton Gajdusek fick Nobelpriset 1976 fÃƒÂ¶r upptÃƒÂ¤ckten av galna kosjukan\nhos ett kannibalfolk pÃƒÂ¥ Nya Guinea. Han var ett av vÃƒÂ¤rldens stÃƒÂ¶rsta genier\noch adopterade 57 barn frÃƒÂ¥n SÃƒÂ¶derhavet.\n\nMen nÃƒÂ¤r hans karriÃƒÂ¤r stod pÃƒÂ¥ sin hÃƒÂ¶jdpunkt anklagades han fÃƒÂ¶r pedofili och \nspÃƒÂ¤rrades in ett ÃƒÂ¥r i fÃƒÂ¤ngelse. Trots det fÃƒÂ¶rsvaras han av legendariska \nvetenskapsmÃƒÂ¤n som Oliver Sacks och kaosteorins Benoit Mandelbrot. En film \nav Bosse Lindquist om insiktens och sexualitetens grÃƒÂ¤nser.\n\n\n\n\nD Carleton Gajdusek won the Nobel Prize for the discovery of Prions - \nthe particles that would emerge as the cause of Mad Cow disease - while working\nwith a cannibal tribe on New Guinea. He was a star of the scientific world. \nOver his years working amongst the tribes of the South Seas, he adopted 57 kids,\nbringing them to a new life in Washington DC. His adoptions were hailed as \nwonderful fatherly beneficence. But, at the height of his career, rumours began\nto spread he was a paedophile.\n\nGajdusek would argue that if sex with children was okay in their own cultures, \nhe wasn't wrong to join in. How could a great mind like Gajdusek's lose insight\nso totally, and why would the scientific community to which he was a hero be so \nquick to leap to his defence and dismiss the allegations?\n\nCarleton Gajdusek himself participates in the film, as well as some of the men \nand women who came to know him closely as children - a majority of whom, when \ncontacted by the film, claimed not to have been abused.\n\nLeading scientist friends of Gadjusek, including Benoit Mandelbrot, one of the \nfounders of Chaos Theory; Robert Gallo, who discovered HIV; and the world-famous \nauthor and neurologist Oliver Sacks, discuss whether matters of science can seem \nmore important to some than questions about sex and criminality.\n\nThe film also features Gajdusek's own - previously never before released - films\nof first contact with stone-age communities in the South Seas.\n\nThis striking and powerful documentary explores the limits of insight and the power\nof self-delusion, through one of the century's true geniuses - a man prepared to defy\nconvention and challenge people's most cherished beliefs, a man whose scientific \nbrilliance seemed to blind many to his extraordinary personal failings.","torrent":{"xt":"urn:btih:4eff8645b7462e85b8d2443da1970ca5b9ef9ea2","amp;dn":"Geniet.Och.Pojkarna.2009.SWESUB.XviD-Movieboys","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eff8645b7462e85b8d2443da1970ca5b9ef9ea2","infoHashBuffer":{"type":"Buffer","data":[78,255,134,69,183,70,46,133,184,210,68,61,161,151,12,165,185,239,158,162]},"announce":[],"urlList":[]}}