{"title":"O.R.B.: Off-World Resource Base (GOG)","uid":12593403,"size":676537087,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:505d740592792588c49857590e302da853e687e8&amp;dn=O.R.B.%3A+Off-World+Resource+Base+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mercs215","files":5,"time":1445197440,"description":"Install instructions:\r\n- Run &quot;setup_orb_2.0.0.5.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: O.R.B.: OFF-WORLD RESOURCE BASE\r\nGenre: Strategy - Real-time - Sci-fi\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: English\r\nModes: Single-player - Multi-player\r\nReleased: November 8, 2002\r\nSize: 572 MB\r\nCompany: Strategy First / Strategy First\r\nRating:\tESRB Rating: Everyone (with Animated Violence)\r\nStore page: http://www.gog.com/game/orb_offworld_resource_base\r\n\r\nAbout:\r\nThe Malus are a product of their planet’s harsh environment. Scarce water, extremely high temperatures, and a volatile climate forged a stout and rigidly disciplined culture based on strength and triumph over adversity. They have come to see themselves as the rightful rulers of the cosmos. The Alyssians are an independent, self-sufficient and fatalistic race, who forsook their individualism for the greater good. They are democratic and egalitarian. However, in an age of scientific progress, those who excel in the military sciences are esteemed above all. Both races will soon discover they are not alone...\r\nO.R.B., the acronym for Off-World Resource Base, is a real-time strategy game that involves the desperate struggle between the forces of two planets for control of the Aldus solar system. You command the military forces of both the Malus and the Alyssians - two radically different races with fundamentally different cultures and motives. Extract resources from asteroid belts throughout several systems to expand and build upon your fleet. Research new technologies to upgrade the capabilities of your existing ships and test your enemies by building new prototypes. Capture enemy ships and steal their technology to open up new research branches. \r\n\r\nMultiplayer notice: The game's official multiplayer servers have been taken offline and the only multiplayer options available are LAN or Direct IP.\r\nTwo fully developed races with their own campaigns, strategies, and technologies.\r\nIncludes a campaign editor along with all the tools you need to script your own scenarios and campaigns.\r\nEpic fleet combat with a plethora of vessels and specialized units such as: Duelist, Interceptor, Marksman, Destroyer, and Assault Carrier.\r\n\r\nMinimum system requirements - Windows: Windows XP / Vista / 7 / 8 / 10, 1 GHz Processor (1.4 GHz recommended), 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 9.0c, Mouse, Keyboard","torrent":{"xt":"urn:btih:505d740592792588c49857590e302da853e687e8","amp;dn":"O.R.B.%3A+Off-World+Resource+Base+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"505d740592792588c49857590e302da853e687e8","infoHashBuffer":{"type":"Buffer","data":[80,93,116,5,146,121,37,136,196,152,87,89,14,48,45,168,83,230,135,232]},"announce":[],"urlList":[]}}