{"title":"Kitchen Stories (2003), [DivX - ITA Mp3]","uid":12526201,"size":725943322,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5084a5200fbba444d49b5d7ce273943314c33a5d&amp;dn=Kitchen+Stories+%282003%29%2C+%5BDivX+-+ITA+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ebasso","files":1,"time":1444059862,"description":".: Release Originale:.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=92268\r\n\r\n.: Copertina :.\r\n \nhttp://i.imgur.com/kQU54XT.jpg\r\n\r\n.: Trama :.\r\n\r\nSiamo negli anni '50. In uno sperduto paesino della Norvegia giungono dalla vicina Svezia un gruppo di ricercatori incaricati dal governo del loro Paese di svolgere un'indagine sociologica. Oggetto dello studio è il comportamento delle persone nello spazio della propria cucina, i loro movimenti, le loro abitudini, i loro costumi. Forti di una analoga esperienza compiuta in Svezia, devono ora confrontarla con il comportamento di questo borgo norvegese abitato solo da uomini single.\r\nIl regista norvegese Bent Hamer, ci dice, è partito da uno studio realmente compiuto in Svezia da studiosi appartenenti all'Istituto Svedese per la ricerca Domestica. Lo scopo era quello di ottimizzare i movimenti in cucina delle casalinghe, i cui spostamenti erano riportati in un diagramma che vediamo riprodotto anche nel film, al fine di fare in modo che le casalinghe svedesi &quot;anziché camminare l'equivalente di un viaggio dalla Svezia al Congo avrebbero potuto camminare solo la distanza di un viaggio fino al Settentrione d'Italia&quot;.\r\nFolke (Tomas Norstrom) è uno dei tecnici incaricati di effettuare le rilevazioni. Si installa in casa di Isak. (Joachim Calmeyer, uno dei massimi attori norvegesi), appollaiato su un sediolone da arbitro di tennis, dall'alto del quale osserva ed annota tutti i movimenti del suo padrone di casa. Con un ritmo lento, e la quasi totale assenza di dialoghi, Hamer ci racconta degli sviluppi dei rapporti tra i due uomini, dapprima improntati alla diffidenza per poi approdare, approfondendosi la conoscenza reciproca, ad un rapporto di amicizia e calorosa solidarietà.\r\nÈ una storia di solitudini, quella raccontata dal regista norvegese, fredde come la neve che circonda la stamberga di Isak. Ma il film, del quale è da lodare l'accurata ricostruzione degli ambienti, è anche una velata critica alla presunta infallibilità del &quot;positivismo&quot; che animava, ed anima, le indagini sociologiche di questo tipo. Sistema che, invece, trova proprio nell' &quot;umanità&quot; dell'operatore la propria fallibilità. I ruoli rischiano di invertirsi, ed è proprio quello che accade nel film, quando l'osservatore comincia a sentirsi osservato, e quando sul diagramma le ascisse e le coordinate cedono il campo ai sentimenti ed alle emozioni.\r\nIl film, costruito con gli elementi tipici della commedia, è discretamente diretto da Hamer il quale conosce la materia di cui parla così come ben dirige i due bravi attori che duettano tra di loro come una &quot;strana coppia&quot; nelle fredde lande scandinave e che invece di hot-dogs pasteggiano ad aringhe e lardo. Come detto, l'opera però risulta per certi versi pesante a causa dei frequenti lunghi silenzi e ad una lentezza di base dalla quale il regista norvegese non riesce a sottrarsi facendosi irretire, a mio giudizio, dalla languidezza del copione da lui stesso scritto.\r\nDa notare, infine, la colonna sonora jazz che inframezza piacevolmente le scene di questo piccolo film norvegese, candidato all'Oscar come miglior film straniero per il proprio Paese. \r\n\r\n.: Scheda Tecnica DivX :.\r\n\r\nTipo File: AVI(.AVI)\r\nDimensione File: 725,943,322 bytes\r\nDurata (hh:mm:ss): 1:31:19\r\n\r\nVideo Codec Tipo: DX50\r\nVideo Codec Nome: DivX 5.1.1 (Maupiti)\r\nVideo Bitrate: 919 kbps\r\nRisoluzione Larghezza: 720 pixels\r\nRisoluzione Altezza: 336 pixels\r\nFPS: 25.000 Frames/sec\r\nQF (Frame quality): 0.152\r\n\r\nAudio Codec: 0x0055 MPEG-1 Layer 3\r\nAudio Bitrate: 128 kbps\r\nTipo Di Audio Bitrate: CBR\r\nFrequenza Audio: 48000 Hz\r\nCanali Audio: 2","torrent":{"xt":"urn:btih:5084a5200fbba444d49b5d7ce273943314c33a5d","amp;dn":"Kitchen+Stories+%282003%29%2C+%5BDivX+-+ITA+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5084a5200fbba444d49b5d7ce273943314c33a5d","infoHashBuffer":{"type":"Buffer","data":[80,132,165,32,15,187,164,68,212,155,93,124,226,115,148,51,20,195,58,93]},"announce":[],"urlList":[]}}