{"title":"Macondo Well Deepwater Horizon Blowout","uid":12548930,"size":9041028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:522489731610f77748d35ec9cfbad3672af6ed64&amp;dn=Macondo+Well+Deepwater+Horizon+Blowout&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1444511659,"description":"Macondo Well Deepwater Horizon Blowout - Lessons for Improving Offshore Drilling Safety (NAP, 2012).pdf\r\n\r\nISBN 9780309221382\r\n\r\nThe blowout of the Macondo well on April 20, 2010, led to enormous consequences for the individuals involved in the drilling operations, and for their families. Eleven workers on the Deepwater Horizon drilling rig lost their lives and 16 others were seriously injured. There were also enormous consequences for the companies involved in the drilling operations, to the Gulf of Mexico environment, and to the economy of the region and beyond. The flow continued for nearly 3 months before the well could be completely killed, during which time, nearly 5 million barrels of oil spilled into the gulf.\r\n\r\nMacondo Well-Deepwater Horizon Blowout examines the causes of the blowout and provides a series of recommendations, for both the oil and gas industry and government regulators, intended to reduce the likelihood and impact of any future losses of well control during offshore drilling. According to this report, companies involved in offshore drilling should take a &quot;system safety&quot; approach to anticipating and managing possible dangers at every level of operation -- from ensuring the integrity of wells to designing blowout preventers that function under all foreseeable conditions-- in order to reduce the risk of another accident as catastrophic as the Deepwater Horizon explosion and oil spill. In addition, an enhanced regulatory approach should combine strong industry safety goals with mandatory oversight at critical points during drilling operations.\r\n\r\nMacondo Well-Deepwater Horizon Blowout discusses ultimate responsibility and accountability for well integrity and safety of offshore equipment, formal system safety education and training of personnel engaged in offshore drilling, and guidelines that should be established so that well designs incorporate protection against the various credible risks associated with the drilling and abandonment process. This book will be of interest to professionals in the oil and gas industry, government decision makers, environmental advocacy groups, and others who seek an understanding of the processes involved in order to ensure safety in undertakings of this nature","torrent":{"xt":"urn:btih:522489731610f77748d35ec9cfbad3672af6ed64","amp;dn":"Macondo+Well+Deepwater+Horizon+Blowout","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"522489731610f77748d35ec9cfbad3672af6ed64","infoHashBuffer":{"type":"Buffer","data":[82,36,137,115,22,16,247,119,72,211,94,201,207,186,211,103,42,246,237,100]},"announce":[],"urlList":[]}}