{"title":"Composite Materials, Design and Applications","uid":12404171,"size":19279011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52ba387331c8afd66e527d495d5ff229e5345dfb&amp;dn=Composite+Materials%2C+Design+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1442068153,"description":"Composite Materials, Design and Applications (CRC, 2003).pdf\n\nComposite materials have grown rapidly both in their applications and their economic importance, and they will no doubt continue to do so. With this growth has come increased attention in engineering curricula, but most coursework tends to focus on laminate theory and the analysis of composites, not on the practical design aspects most important to engineers. \nComposite Materials: Design and Applications fills that gap. Updated and translated from the successful French text Materiaux Composites, it offers comprehensive coverage of composites and their use in a broad range of applications. \nPart I provides a detailed introduction to composite materials, including fabrication processes, properties, design concepts, assembly, and applications. This section could also be used by itself in a course on advanced materials. \nPart II discusses elastic anisotopic properties, the directional dependence of different properties, and the mechanical properties of thin laminates. Alone, this section is suitable for a course on the mechanics of composite materials. \nPart III addresses the orthotropic coefficients needed for design activities, the Hill-Tsai failure criterion, the bending and torsion of composite beams, and the bending of thick composite plates. While somewhat more theoretical than the preceding chapters, it helps students better understand the behavior of composite parts. \nPart IV contains 41 detailed, numerical examples illustrating the design and use of composites. These are presented on three levels and cover the mechanical properties of composite structures in different forms, thermoelastic properties and failure analysis and the bonding of cylinders, sandwich beam buckling and flexure shear, and vibrations in composite plates. \nClearly written and filled with more than 500 illustrations, Composite Materials: Design and Applications forms an outstanding textbook for senior undergraduate and beginning graduate-level course work-one that can make a significant contribution to the training of future engineers","torrent":{"xt":"urn:btih:52ba387331c8afd66e527d495d5ff229e5345dfb","amp;dn":"Composite+Materials%2C+Design+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52ba387331c8afd66e527d495d5ff229e5345dfb","infoHashBuffer":{"type":"Buffer","data":[82,186,56,115,49,200,175,214,110,82,125,73,93,95,242,41,229,52,93,251]},"announce":[],"urlList":[]}}