{"title":"The Boys Are Back 2009 Inspired by a true story Nlsubs","uid":5297091,"size":3856154880,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:52d12e3b60bb8c2fde462f089e135b3d09f4d694&amp;dn=The+Boys+Are+Back+2009+Inspired+by+a+true+story+Nlsubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLUPPER","files":-1,"time":1264096814,"description":"The Boys Are Back (gebasseerd op ware feiten)\n\nPLOT\n\nInspired by a true story, THE BOYS ARE BACK is a deeply moving, wryly confessional tale of fatherhood, that intimately evokes both the fragility and wonders of family life. It follows a witty, wisecracking, action-oriented sportswriter (Academy AwardÃ‚Â® nominee and Golden Globe winner CLIVE OWEN) who, in the wake of his wife's tragic death, finds himself in a sudden, stultifying state of single parenthood. With turbulent emotions swirling just below the surface, Joe Warr throws himself into the only child-rearing philosophy he thinks has a shot at bringing joy back into their lives: &quot;just says yes.&quot; Raising two boys - a curious six year-old (NICHOLAS MCANULTY) and a rebel teen (GEORGE MACKAY) from a previous marriage -- in a household devoid of feminine influence, and with an unabashed lack of rules, life becomes exuberant, instinctual, reckless . . . and on the constant verge of disaster. United by unspoken love, conflicted by fierce feelings and in search of a road forward, the three multi-generational boys of the Warr household, father and sons alike, must each find their own way, however tenuous, to grow up. Their story is not just about the transforming power of a family crisis -- but the unavoidable grace of everyday life and love that gets them through. Academy AwardÃ‚Â® nominee Scott Hicks (&quot;Shine&quot;) directs from a screenplay by Allan Cubitt based on the acclaimed 2001 memoir by Simon Carr, The Boys Are Back, an unflinchingly funny and honest recounting of his journey from grieving husband to full-contact fatherhood in the aftermath of profound loss. Shot on location in the stunning countryside of South Australia, the film is produced by Greg Brenman (&quot;Billy Elliot&quot;) and Tim White (&quot;Ned Kelly&quot;). The executive producers are Peter Bennett-Jones and Clive Owen.\n\n\nAustraliÃƒÂ« / Verenigd Koninkrijk\nDrama\n104 minuten\n\ngeregisseerd door Scott Hicks\nmet Clive Owen, Laura Fraser en Emma Booth\n \nAls Joe (Clive Owen) zijn vrouw verliest, blijft hij alleen met zijn zesjarige zoontje Artie achter.\nHij besluit alle regels aan de kant te schuiven en laat naar bed gaan, rommelige kamers\nen junk food behoren tot de orde van de dag.Maar als Harry, Joe's tienerzoon uit zijn eerste huwelijk,\narriveert, loopt de situatie uit de hand.\n\n\nMM:   &lt;a href=&quot; http://www.moviemeter.nl/film/53685&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/53685&lt;/a&gt;\n\nIMDB:   &lt;a href=&quot; http://www.imdb.com/title/tt0926380/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0926380/&lt;/a&gt;\n\n\n\nDvd-info\nsource: limited.dvdrip.xvid\nVideo: NTSC 16:9\nAudio: ac3 5.1\nSubs: Dutch On-Of\nMenu: Yes simple \nCover: Inside","torrent":{"xt":"urn:btih:52d12e3b60bb8c2fde462f089e135b3d09f4d694","amp;dn":"The+Boys+Are+Back+2009+Inspired+by+a+true+story+Nlsubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d12e3b60bb8c2fde462f089e135b3d09f4d694","infoHashBuffer":{"type":"Buffer","data":[82,209,46,59,96,187,140,47,222,70,47,8,158,19,91,61,9,244,214,148]},"announce":[],"urlList":[]}}