{"title":"GetGo Video Converter Pro 4.1.0.600 (Install + Portable)","uid":12608879,"size":77274321,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:54876bf230c78151750c4e4fbc4a6c38282a865c&amp;dn=GetGo+Video+Converter+Pro+4.1.0.600+%28Install+%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jovo_bih","files":1,"time":1445431177,"description":"********************************************************\r\nGetGo Video Converter Pro 4.1.0.600 (Install + Portable)\r\n********************************************************\r\n\r\n*************\r\nMain features\r\n*************\r\n\r\nBurn DVDs\r\n\r\nBurn any set of videos, complete with ISO image file, to DVD for playback on NTSC and PAL systems. Enjoy watching your videos on a DVD player, or send the discs to your friends and family for easy sharing.\r\n\r\nRip DVDs\r\n\r\nCopy the contents of your DRM-free DVDs to your hard drive in a number of popular video and audio formats, including MP4, AVI, MOV, and WMV. Backup your videos, or convert and transfer them for playback on mobile devices and other media players.\r\n\r\nConvert a video in 3 easy steps\r\n\r\n1.Click the Add button to select a video file.\r\n2.Choose your output file format.\r\n3.Click the Start button to start converting your video.\r\n\r\nMultiple Videos, Multiple Formats\r\n\r\nAdd a group of videos to your list and choose a different output format for each. Press the Start button to begin batch converting all the videos on your list. You can even set the program to close after the batch conversion is done, or pause and restart at your convenience.\r\n\r\nConvert Videos and Audio Among All Popular File Formats\r\n\r\nConvert between all kinds of video and audio formats, including: AVI, MP4, MKV, FLV, 3GP, 3G2, WMV, MOV, VOB, MPG, PSP, M4V, VCD, DVD, ARM, ASF, AVS, SWF, MPEG, MTV, OGG, H261, H263, H264, MP3, M2TS, and more.\r\n\r\nDesigned for Portable Media Devices\r\n\r\nStart converting right away, thanks to optimized presets for all kinds of portable media devices, such as the iPhone 5, the new iPad, Samsung Galaxy S4, Apple TV, PSP and Zune, mobile phones, including HTC, Google Nexus One, Motorola, BlackBerry and Nokia, and game consoles, like the PS3 and Xbox 360.\r\n\r\nFill Your Screen\r\n\r\nThe smart video aspect ratio clipping feature makes full use of your device’s screen. When the input video aspect ratio does not match the output profile screen aspect ratio, GetGo Video Converter will automatically trim the edges of the input video to ensure it takes advantage of your full screen.\r\n\r\nSave Sounds\r\n\r\nEasily extract the audio from your favorite videos. Convert the background music from videos downloaded from the Internet to an audio format, such as MP3 and WMA, for listening on the go on your iPhone, iPod, Android, or other mobile device.\r\n\r\nSupported Input File Formats\r\n\r\nAVI MP4 MKV FLV 3GP 3G2 WMV MOV VOB MPG PSP M4V VCD DVD ARM ASF AVS SWF MPEG MTV OGG H261 H263 H264 RM VID BFI C93 DRC DNXHD DSICIN DV DIF DXA EA FFM FLIC V4L GXF CIN CGI MVE LMLM4 LIBDC1394 NUT MJPEG M1V M2V M2T M2TS MVI MXF V NSV NUV OGV V4L2 RCV VMD PVA R3D YUV CIF GCIF RGB RL2 ROQ RPL CPK VB SON SMK STR THP SEQ TXD VC1 4XM VFM WC3 VQA Y4M\r\n\r\nSupported Output File Formats\r\n\r\nAVI WMV MP4 3GP FLV MOV ASF M4V MKV DV MPEG1 MPEG2 VOB WMA MP3\r\n\r\nSupported Mobile Device Profile\r\n\r\nApple iPhone 3G/4/4S/5, iPod Touch/Touch 4/5/Classic/Nano, iPad, iPad 2, the new iPad, Apple TV 2/3; Samsung S II/III/4, Wave723; Nokia N86, 7230, 5233, N76, N82; Blackberry 8520, Curve 8300, Bold 9900, Bold Series; LG Optimus 4X HD P880; HTC Flyer, Sensation, Vivid; Motorola RAZR HD; Sony Ericsson W700I; Microsoft Zune, and many more!\r\n\r\nSystem Requirements: Windows XP SP3, Vista, 7, 8.\r\n\r\nHomepage http://www.getgosoft.com/getgovcp/","torrent":{"xt":"urn:btih:54876bf230c78151750c4e4fbc4a6c38282a865c","amp;dn":"GetGo+Video+Converter+Pro+4.1.0.600+%28Install+%2B+Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54876bf230c78151750c4e4fbc4a6c38282a865c","infoHashBuffer":{"type":"Buffer","data":[84,135,107,242,48,199,129,81,117,12,78,79,188,74,108,56,40,42,134,92]},"announce":[],"urlList":[]}}