{"title":"JÃƒÂ©sus de MontrÃƒÂ©al (1989)","uid":5290554,"size":722427904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56e9f17d3b6784cea48bba342cb0834e323a4487&amp;dn=J%C3%83%C2%A9sus+de+Montr%C3%83%C2%A9al+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"wresbill","files":1,"time":1263884106,"description":"A group of actors putting on an interpretive Passion Play in Montreal begin to experience a meshing of their characters and their private lives as the production takes form against the growing opposition of the Catholic church.\n\nCannes 1989 (Nominated for Golden Palm)\nNominated for Best Foreign film at Academy Awards 1990\n\nDirector: Denys Arcard (Le dÃƒÂ©clin de l'Empire Americain; Nominated Best Foreign Film - 1986, Les Invasions Barbares; Best Foreign Film - 2003)\n\n\n\nfilename .......................... (QC) JÃƒÂ©sus de MontrÃƒÂ©al [1989].avi\nfilesize ......................................... 722,4 MO\nduration ......................................... 1:50:40\n\n--------\nAll of us knows who Jesus is, right?\n\nThis movie brings to light a concept of Jesus that most people do not know is a topic of serious academic scholarship. The question is, &quot;What can we reasonably say about Jesus based solely on historical sources?&quot; Of course, the Bible is the primary source, since Jesus is referred to only in passing by nonreligious sources of his time. And, because this is an historical pursuit, one goal is also to separate those things which are clearly matters of faith from those which do not require a religious faith in the man. Therefore, we are left with a Jesus who led an iconoclastic life and was killed for it. The historian cannot say in an historical journal that Jesus was divine, walked on water, or was raised from the dead. This portrait is called &quot;The Historical Jesus&quot;.\n\nThe historian can, however, make a personal statement of faith-- &quot;I believe Jesus is the Anointed of God, who saves us from our sins&quot;. This is not the statement made by &quot;Jesus of Montreal&quot;. Masterfully, the cast and crew of the film weave a tale which demands several viewings to fully consume. Both explicitly and through the use of metaphor, Jesus is depicted as a revolutionary teacher of great charisma and whose life was one of tragedy. But this film is not about the traditional Christian concept of Jesus; rather, it illustrates only the human aspects of the man who is, to me, God incarnate. This is the story of Jesus, the man-- not Jesus, the Christ. Christians may be disappointed by it, or outraged, but I encourage us all to remember that where that where faith (trust in that which cannot be observed) begins, there the historian (or scientist) must stop. Believers go further. I highly recommend this movie to anyone who wants to think, be they a believer or not.","torrent":{"xt":"urn:btih:56e9f17d3b6784cea48bba342cb0834e323a4487","amp;dn":"J%C3%83%C2%A9sus+de+Montr%C3%83%C2%A9al+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56e9f17d3b6784cea48bba342cb0834e323a4487","infoHashBuffer":{"type":"Buffer","data":[86,233,241,125,59,103,132,206,164,139,186,52,44,176,131,78,50,58,68,135]},"announce":[],"urlList":[]}}