{"title":"Guns N' Roses - You Could Be Mine  (2nafish)","uid":5298903,"size":212639748,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:58e83be9b3c4aa3ca98cc2a7a2c9bcc81fb56570&amp;dn=Guns+N%5C%27+Roses+-+You+Could+Be+Mine++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264158134,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;You Could Be Mine&quot; is a song by American hard rock band Guns N' Roses, featured on their 1991 fourth studio album Use Your Illusion II. It was released as the band's seventh single, and the first from the Use Your Illusion albums, in June 1991. Backed with &quot;Civil War&quot; from Use Your Illusion II, the single reached number twenty-nine on the Billboard Hot 100 chart and number three on the UK Singles Chart.\n\nSchwarzenegger appears in the music-video as the T-800 Terminator from the film who arrives at a Guns N' Roses concert, having mission orders to assassinate Axl. However, when the song is finished, the Terminator confronts the band and individually assesses each member. He gets to Axl and assesses that killing him would be &quot;a waste of ammo.&quot; He then stares at Axl Rose for a while and walks off. Izzy Stradlin was conspicuously absent from the end section of the video. Edited by Jeffrey Abelson, it was one of the most requested music videos during that period, and contributed to the hype surrounding Terminator 2. At the end of 1991, MTV placed it at #1 on their top 100 videos for that year.\n\nAs the video features clips from the movie, it could not be put on the DVD Welcome to the Videos due to licensing issues. The video was also not included on any of the DVD releases of Terminator 2: Judgment Day.\n\nContrary to popular belief, &quot;You Could Be Mine&quot; was not originally going to be the official theme of Terminator 2: Judgment Day. However, the references to Guns N' Roses that were made in the film (from John Connor's friend's Guns N' Roses t-shirt to the T-800 taking out his shotgun from a box of roses, thus playing a pun on the band's name) were so clear and obvious that it was a wise business decision to make when director James Cameron decided to recruit the band to perform a song. As it would turn out, &quot;You Could Be Mine&quot; was selected to be included in the film. Arnold Schwarzenegger had the band members over for dinner at his own home to negotiate the deal.\n\nThe lyric &quot;With your bitch slap rappin' and your cocaine tongue you get nothin' done&quot; from the chorus appeared on the inner sleeve of Guns N' Roses' debut album Appetite for Destruction, released in 1987 (the song had already been written by then). This &quot;tradition&quot; was followed by the line &quot;Ain't It Fun&quot; on the Use Your Illusion albums released in 1991 - two years later GN'R cover of the song &quot;Ain't It Fun&quot; appeared on &quot;The Spaghetti Incident?&quot; album. Slash states that the song's writing began at the first preproduction session for Appetite for Destruction.\n\nThe song is remembered for its minute-long drum and guitar intro[by whom?]. It was played during the ending credits of Terminator 2 and was heard in the film itself in early scenes with John Connor. The original script called for The Ramones song &quot;I Wanna Be Sedated&quot; to be played instead. The song also featured in another part of the Terminator series, Terminator Salvation.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:58e83be9b3c4aa3ca98cc2a7a2c9bcc81fb56570","amp;dn":"Guns+N%5C%27+Roses+-+You+Could+Be+Mine++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58e83be9b3c4aa3ca98cc2a7a2c9bcc81fb56570","infoHashBuffer":{"type":"Buffer","data":[88,232,59,233,179,196,170,60,169,140,194,167,162,201,188,200,31,181,101,112]},"announce":[],"urlList":[]}}