{"title":"Clash of CLans Farmbot","uid":12474863,"size":269005298,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:58ea1198ae36ebf879dd40c9cd9011744ca73458&amp;dn=Clash+of+CLans+Farmbot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Giminar1","files":1,"time":1442966446,"description":"I will attempt to seed for as long as I can.\n\n\n\nZip includes: \n\nClashFarmer (This is a ripoff of ClashBot, but has all the vip features for free) \n\nBluestacks Emulator installer for windows -- [www.Bluestacks.com] (Required)\n\nRestartOnCrash.exe  -- This will restart anything that is crashed or just not running. (This has to ran as administrator for some reason)\n-----------------------------------------\n\n&quot;Can you be Banned?&quot;\n\n6 months 24/7, without a ban.. I think you guys are good.\n\n\n-----------------------------------------\n\nFALSE POSITIVE ALERT:\n\nClashFarmer is awesome, but scares every AV I've come across. Consult your local geek, and put this through your favorite virus scanner if you want, but I've got my entire family using it, and their doing fine.\n\nOnce you are finished freaking out about it being a false positive, add it to your AV exclusions list.\n\n-----------------------------------------\nRead Me: (Will also be in the zip file)\n\nStep 1: UNZIP \n\nStep 2: Install BlueStacks and ClashFarmer as Admin. (Sorry)\n\nStep 3: Put RestartonCrash.exe wherever you want to; It's not an installer.\n\nStep 4: Use the image I have placed in the zip, to setup RestartonCrash.exe\n\nStep 5: Go on Bluestacks, log in with your google account, and download Clash of Clans.\n\nStep 6: Open ClashFarmer (It tells you to restart, after making size adjustments to BS)\n\nStep 7: Change your Text display settings to 100% in the Windows Display Settings. (It probably is already on that setting)\n\nStep 8: TURN OFF WINDOWS ERROR REPORTING!! You can do this through Regedit or the Group Policy Editor  (Google this)\n\nStep 9: Change your power settings to &quot;High Performance&quot; and disable all sleep functions. This includes your display turning off, hard disk turning off, and all sleep settings.  (This is the most important thing.\n\n[[ IF YOU ARE USING A LAPTOP, please dim your display also to keep it cool, and watch the power pack, so that it doesn't overheat ]]\n\n\n    \n   ||||||    EVERY TIME YOU MOVE YOUR TH, YOU MUST MANUALLY RELOCATE IT  ||||||\n      (Or you can just make a profile for each location, under the misc tab)\n\n\n\n--------------------------------------------------------------------------------\n\nI don't mind answering questions about settings. Just give me some time to get back to you guys.  As a starter, I recommend using barrack mode for troops, and just running barbs and archers. Also set your Heroes to use their spells when they get low health.\n\n--------------------------------------------------------------------------------\n\n\nRecommended Hardware: i3 processor or equivalent and at least 6G of ram. 4G can handle it, but you need to make sure that you hide BS with the &quot;Hide BS&quot; button on the bot. This works well on Windows 10","torrent":{"xt":"urn:btih:58ea1198ae36ebf879dd40c9cd9011744ca73458","amp;dn":"Clash+of+CLans+Farmbot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58ea1198ae36ebf879dd40c9cd9011744ca73458","infoHashBuffer":{"type":"Buffer","data":[88,234,17,152,174,54,235,248,121,221,64,201,205,144,17,116,76,167,52,88]},"announce":[],"urlList":[]}}