{"title":"CDRoller 8.70.50 Portable","uid":5291377,"size":14201845,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5e7bb7ef4a9669279a265b2b201aacafcd93aaf6&amp;dn=CDRoller+8.70.50+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":3,"time":1263910443,"description":"CDRoller v8.70.50 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Serial are included.\n\n CDRoller is a powerful, easy-to-use toolset for CD/DVD data recovery. CDRoller supports industry-standard ISO 9660 file system, including Microsoft's extensions for long file names support, so-called Joliet extensions. CDRoller also supports the discs formatted in UDF file system, including versions 1.02, 1.50, 2.0, 2.01 and also so-called UDF Bridge format. Support of wide set of CD, CD-R, CD-RW and DVD formats such as: CD-DA, CD-ROM, CD-WO, CD-ROM XA and Mixed-Mode CD, Stamped multisession CD, CD-MRW (&quot;Mt. Rainier&quot; CD-RW), DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+RW, DVD-RAM.\n\nKey Features:\n\n    * Effectively retrieves the lost data from the discs created by &quot;drag and drop&quot; CD/DVD/BD writing software, such as well-known Sonic (Roxio, Adaptec) and Ahead Nero software packages, CeQuadrat's PacketCD, DLA, B's CLiP and others.\n    * Reads unfinalized (&quot;open&quot;, &quot;left as-is&quot;) CDs and DVDs, including the discs with Microsoft's Live File system.\n    * Recovers DVD movies and photos, created by a wide set of standalone devices that record directly onto disks: Hitachi, Canon, Panasonic, Samsung and Sony DVD camcorders as well as standalone video recorders.\n    * Splits the recovered VOB or VRO video files into a several clips (scenes), automatically converting a &quot;raw&quot; DVD-video into generic MPEG files without loss of quality. Specially tested on the discs, recorded by Hitachi DVD camcorders.\n    * Burns a new DVD with recovered video that can be played back in the most DVD players.\n    * Recovers CD data written by Sony Mavica CD digital cameras.\n    * Retrieves the lost pictures, video and other types of files from flash memory cards, such as SmartMedia, Memory Stick, CompactFlash, xD Picture Card and other flash memory drives.\n    * Includes a fault-tolerant UDF Reader. Provides direct access to UDF discs, including CDs and DVDs written by old versions of Roxio (Adaptec) DirectCD and Drag-To-Disk. Finds and retrieves accidently deleted files, files located in the corrupted folders, files on incorrectly closed disks, etc.\n    * &quot;On-the-fly&quot; unpacks the files initially compressed by Roxio (Adaptec) DirectCD.\n    * Retrieves back up files from the discs recorded in several stages (multisession discs).\n    * Includes a built-in CD/DVD/BD data burner. There is no need to run third-party CD/DVD/BD mastering software if you wish to burn a new DVD-video disc or backup your files and folders immediately after recovery. The &quot;Burn&quot; option is integrated into a common shell. Just write a new disc with recovered data shortly, without leaving CDRoller!\n    * Erases CD, DVD and BD re-writable media. Supports quick and full erase methods.\n    * Examines disc sectors at low level. Displays the sector content in text, binary, hexadecimal or unicode mode. It also scans all sectors of a disc (selected track or file) for particular data. Recommended for engineering purposes and also for law enforcement and forensic investigators.\n    * Identifies the lost files on ISO/Joliet discs with the damaged file system (volume descriptors, path tables and directories), using the raw data only.\n    * Rescues the data from scratched, damaged or defective discs.\n    * Provides direct access to hardware, bypassing the Windows File System. Looks for the lost tracks (sessions) every time when you insert a new disc into the drive. Supports SCSI Pass Through Direct (SPTD) layer as alternative method under Windows 2000/XP/2003/Vista/7.\n    * Digitally extracts audio tracks into a wide set of wave formats.\n    * Tests disc readability.\n    * Extracts ISO Image file. Burns ISO Image file to a new disc.\n    * Catalogs files and folders into CD/DVD library.\n    * All features are integrated into a common and easy-to-use intuitive shell.\n\nSupport of wide set of CD, DVD, BD and HD-DVD formats such as:\n\n    * CD formats (CD-DA, CD-ROM, CD-WO, CD-ROM XA and Mixed-Mode)\n    * CD format CD-MRW (&quot;Mt. Rainier&quot; CD-RW),\n    * DVD formats (DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+R DL, DVD+RW, DVD-R DL, DVD-RAM).\n    * Blu-ray disc (BD) formats (BD-ROM, BD-R, BD-RE, BD-R DL, BD-RE DL).\n    * High Definition DVD (HD-DVD) formats (HD-ROM, HD DVD-R, HD DVD-RAM).\n\nSupported File Systems:\n\n    * ISO 9660 file system, including so-called Joliet and Rock Ridge extensions for long file names (Windows and Unix files names).\n    * Universal Disk Format (UDF), including versions 1.02, 1.50, 2.0, 2.01, 2.50, 2.60 and so-called UDF Bridge format.\n    * FAT32 (for DVD-RAM and BD-RE discs).\n    * FAT16 / FAT32 (for flash memory cards and drives).\n\nSystem Requirements\nTo run CDRoller, you need at least:\n\n    * Microsoft Windows 95/98/ME/2000/XP/2003/Vista/7 operating system,\n    * Intel Pentium or compatible CPU,\n    * 256 MB of RAM,\n    * 12 MB free hard disk space for program installation and some additional space for CD/DVD images,\n    * CD/DVD/Blu-ray drive(s). The devices with IDE or SCSI interfaces are highly recommended under Windows 95/98/ME.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.cdroller.com/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cdroller.com/index.html&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:5e7bb7ef4a9669279a265b2b201aacafcd93aaf6","amp;dn":"CDRoller+8.70.50+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7bb7ef4a9669279a265b2b201aacafcd93aaf6","infoHashBuffer":{"type":"Buffer","data":[94,123,183,239,74,150,105,39,154,38,91,43,32,26,172,175,205,147,170,246]},"announce":[],"urlList":[]}}