{"title":"The Fixx - Secret Separation  (2nafish)","uid":5293358,"size":127825924,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5ea7a7e442df8bca82e5bbaffa19fb53cc1f46e9&amp;dn=The+Fixx+-+Secret+Separation++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1263973438,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles\n\n\nThe Fixx are an English New Wave band. They are one of the few such bands to have enjoyed significant success outside their country of origin (in their case, notably in the United States and Canada) while remaining almost unknown in their home land. The band is best known for their song &quot;One Thing Leads to Another&quot;, from their most successful album Reach the Beach in 1983. Their other hits include &quot;Red Skies&quot;, &quot;Stand or Fall&quot;, &quot;Saved by Zero&quot;, &quot;Sign of Fire&quot;, &quot;Are We Ourselves?&quot;, &quot;Secret Separation&quot;, &quot;Driven Out&quot;, &quot;How Much Is Enough?&quot; and &quot;Deeper and Deeper&quot;, which was featured on the soundtrack of Streets of Fire. &quot;A Letter to Both Sides&quot; appears on the Fletch soundtrack.\n\nCollege friends Cy Curnin on vocals and Adam Woods on drums formed the group in London in 1979, initially calling themselves The Portraits. The pair placed an ad for additional members, and recruited keyboardist Rupert Greenall, guitarist Tony McGrail and bassist Charlie Barret. Under the name The Portraits the band issued two singles for Ariola Records: &quot;Little Women&quot; (1979), and &quot;Hazards In The Home&quot; (1980). Neither single charted.\n\nLater in 1980, McGrail left. At this point, the band added guitarist Jamie West-Oram and changed their name to The Fix. This iteration of the band recorded for 101 Records, releasing their first single (&quot;Lost Planes&quot;) in February 1981. This track, along with several live tracks issued by 101 on various compilations, received some radio exposure on the BBC.\n\nThe Fix's raised profile eventually led to the group being offered a contract by MCA Records. Worried about the potential drug-user implication of the band's name, MCA insisted on a name change before signing them to the label. A compromise was reached as the band altered the spelling of their name to The Fixx, and a deal was duly inked.\n\nWalkabout is the fourth studio album by British new wave band The Fixx, released in 1986. First single &quot;Secret Separation&quot; spent two weeks atop the Mainstream Rock Tracks chart to become the band's second #1 single on this chart in July 1986.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5ea7a7e442df8bca82e5bbaffa19fb53cc1f46e9","amp;dn":"The+Fixx+-+Secret+Separation++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea7a7e442df8bca82e5bbaffa19fb53cc1f46e9","infoHashBuffer":{"type":"Buffer","data":[94,167,167,228,66,223,139,202,130,229,187,175,250,25,251,83,204,31,70,233]},"announce":[],"urlList":[]}}