{"title":"Razer Cortex 6.2.12.0","uid":12413460,"size":53482496,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6027632cfeae1db4ddc8e40e6b4534545ab4e733&amp;dn=Razer+Cortex+6.2.12.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1442186879,"description":"Razer Cortex (Game Booster) - a program developed by IObit, in collaboration with Razer, and allows gamers to help optimize their computers to work with the latest computer games one click to enjoy gameplay without the &quot;lag&quot; and &quot;loose&quot;.\nThe utility allows you to achieve excellent levels of performance previously available only for technical enthusiasts.\nThe program offers a variety of tools: Driver Update, download the necessary tools for games, to configure your system for gaming, defragmenting game directories, temporarily shut down background processes, cleaning RAM, CPU activation. This means that you can activate the processes of Windows, when you need them, and turn them off to begin the serious business - the game. Razer Cortex allows you to enjoy all the advantages of the latest games, you increase your level of their passage.\nAdditional Information:\nRazer Cortex - Easy-to-use utility that disables non-critical processes of operating the system with the PC game mode. This is done in order to increase productivity, optimize the use of resources of the computer. The utility has an intuitive interface, it is easy to switch between normal mode and the game in general - is a simple but at the same time - a powerful program.\n\nOf the available interfaces, based on first-time users can easily switch to the main sophisticated interface. In the center of the program window is a list of 24 non-critical processes that can be completed before the start of the game. Using a system of check boxes, you can select the specific processes that you want to disable","torrent":{"xt":"urn:btih:6027632cfeae1db4ddc8e40e6b4534545ab4e733","amp;dn":"Razer+Cortex+6.2.12.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6027632cfeae1db4ddc8e40e6b4534545ab4e733","infoHashBuffer":{"type":"Buffer","data":[96,39,99,44,254,174,29,180,221,200,228,14,107,69,52,84,90,180,231,51]},"announce":[],"urlList":[]}}