{"title":"Gilbert &amp; Sullivan Weekend","uid":5285352,"size":323976418,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60631c1e3cbf82b3d69cb5d788d0dc7c6c539457&amp;dn=Gilbert+%26+Sullivan+Weekend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mrneon","files":20,"time":1263693160,"description":"\n1. H. M. S. Pinafore (The Lass that Loved a Sailor), operetta: Now Give Three Cheers. . . I Am the Monarch of the Sea. . . When I Was \n\n2. H. M. S. Pinafore (The Lass that Loved a Sailor), operetta: I'm Called Little Buttercup \n\n3. H. M. S. Pinafore (The Lass that Loved a Sailor), operetta: Never Mind the Way and Wherefore \n\n4. The Mikado (The Town of Titipu), operetta: A Wand'ring Minstrel I \n\n5. The Mikado (The Town of Titipu), operetta: Three Little Maids From School Are We \n\n6. The Mikado (The Town of Titipu), operetta: As Someday It May Happen \n\n7. The Mikado (The Town of Titipu), operetta: The Flowers That Bloom in the Spring \n\n8. The Mikado (The Town of Titipu), operetta: On a Tree by a River A Little Tom-Tit \n\n9. The Yeomen of the Guard (The Merryman and his Maid), operetta: When Our Gallant Norman Foes \n\n10. The Yeomen of the Guard (The Merryman and his Maid), operetta: I Have A Song to Sing \n\n11. The Pirates of Penzance, operetta: I Am the Very Model of a Modern Major-General \n\n12. The Pirates of Penzance, operetta: When the Foreman Bares His Steel \n\n13. The Pirates of Penzance, operetta: Poor Wand'ring One \n\n14. The Pirates of Penzance, operetta: When Felon's Not Engaged in his Empolyment \n\n15. Iolanthe (The Peer and the Peri), operetta: Loudly Let the trumpet Bray \n\n16. Iolanthe (The Peer and the Peri), operetta: If You Go in You're Sure to Win \n\n17. The Gondoliers (The King of Barataria), operetta: We're Called Gondolieri \n\n18. The Gondoliers (The King of Barataria), operetta: In Enterprise of Martial Kind \n\n19. The Gondoliers (The King of Barataria), operetta: Take a Pair fo Sparkling Eyes \n\n20. The Gondoliers (The King of Barataria), operetta: Dance a Cachucha Fandango Bolero\n\n\n","torrent":{"xt":"urn:btih:60631c1e3cbf82b3d69cb5d788d0dc7c6c539457","amp;dn":"Gilbert+%26+Sullivan+Weekend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60631c1e3cbf82b3d69cb5d788d0dc7c6c539457","infoHashBuffer":{"type":"Buffer","data":[96,99,28,30,60,191,130,179,214,156,181,215,136,208,220,124,108,83,148,87]},"announce":[],"urlList":[]}}