{"title":"Tom Russell - Box OF Visions (1993) (  ) [FrankFoo]","uid":12516560,"size":139794453,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:60cb4732c56333e5570ca834fa5d8e07fa4b8cb1&amp;dn=Tom+Russell+-+Box+OF+Visions+%281993%29+%28MP3%40320%29+%5BFrankFoo%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FrankFoo2","files":28,"time":1443778695,"description":"\nTom Russell - Box OF Visions (1993) (  )\r\n\r\nIncluded: NFO, PLS, M3U\r\nCovers: Front Back CD Booklet\r\nTags: ID3 v1.1, ID3 v2.3\r\n\r\nReviews:\r\n\r\n-For his sixth release, Russell hired West Coast roots rock producer/bassist Dusty Wakeman for a big sound that at times recalls Bruce Springsteen's Darkness On the Edge of Town. . . . Russell is a gifted songwriter who populates his songs with empathetic characters and adds details that evoke the smell of blood or choking power of dust. Manzanar&quot; adopts the point of view of a former Japanese-American prisoner put in an American concentration camp built after Pearl Harbor was bombed; &quot;Hong Kong Boy&quot; depicts the violence and racism of Chinese gangs vs. the Vietnamese . . . and the pumped-up, blue-eyed soul of &quot;The Extra Mile&quot; pays tribute to durable singer Mitch Ryder.\r\n\r\n-On &quot;box of visions,&quot; songwriter Tom Russell takes his trademark characters - burned-out gamblers, madmen, death-wish women, drunks and holloweyed dreamers - and portrays them as visionaries. Russell's protagonists are continually haunted by apparitions from the past, obsessed with what might have been as the present slips away.\r\n\r\nBox opens with &quot;Angel of Lyon,&quot; the story of a rich man who pursues his vision of love to the point of poverty, dissolution and madness; he never attains it - his &quot;angel&quot; is a woman who has joined a convent. Box contains some of Russell's finest moments as a lyricist - &quot;Heart of Hearts&quot;; &quot;Purgatory Road,&quot; a lament written with Tom Pacheco; &quot;Manzanar,&quot; about the World War II internment camps for Japanese-Americans; &quot;Blood Oranges,&quot; a mystical fable written for Paul Bowles; and &quot;The Extra Mile,&quot; an R&amp;B-style tribute to Mitch Ryder.\r\n\r\nRussell forgoes his regular band in favor of such guest musicians as David Hidalgo, Katy Moffatt, David Mansfield, Dusty Wakeman and others; only lead guitarist Andrew Hardin remains. As a result, the arrangements are stiffer and less evocative than on previous records (the absence of multi-instrumentalist Fats Kaplin is especially noticeable). \r\nStill, most of the time it works, and even when it doesn't, Russell's words and voice carry him through.\r\n\r\n\r\n01. Angel of Lyon\r\n02. Annette\r\n03. Heart of Hearts \r\n04. Purgatory Road\r\n05. Manzanar \r\n06. Waterloo \r\n07. Coney Island Moon\r\n08. Hong Kong Boy\r\n09. Wedding Dress Mary (A Place to Hang Your Heart) \r\n10. The Blood Oranges Listen \r\n11. Extra Mile\r\n12. Box of Visions \r\n\r\nPlaying Time:......... 49:47\r\n\r\n\r\nMultiTracker @ FrankFoo","torrent":{"xt":"urn:btih:60cb4732c56333e5570ca834fa5d8e07fa4b8cb1","amp;dn":"Tom+Russell+-+Box+OF+Visions+%281993%29+%28MP3%40320%29+%5BFrankFoo%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60cb4732c56333e5570ca834fa5d8e07fa4b8cb1","infoHashBuffer":{"type":"Buffer","data":[96,203,71,50,197,99,51,229,87,12,168,52,250,93,142,7,250,75,140,177]},"announce":[],"urlList":[]}}