{"title":"ET Species 101 - watchZEITGEISTnow","uid":5298637,"size":26567312,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:61e2c0ce7cedaf0fa9686f137b5318fbe4ed225e&amp;dn=ET+Species+101+-+watchZEITGEISTnow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trippy123","files":1,"time":1264147077,"description":"karl12 is an amazing ATS member who has some epic threads.\nThis is karl12's thread I suggest you all read in order to establish who saw or met these ETs represented where and when in this video. &lt;a href=&quot;\nhttp://www.abovetopsecret.com/forum/thread525580/pg1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.abovetopsecret.com/forum/thread525580/pg1&lt;/a&gt;\n\n With karl12's permission I have made a video about ET races or species that are to have visited our planet Earth [Terra-3].\n\n**You can view the video on my you * tube name: trippy123\n\n The Greys (Dows), Reptilians (Many different species) , Pleiadians, Andromedans , Sirians, Lyrans, Arcturians, Aldebarans, to name a few are all represented here - along with what could be described as organic-robots and clones that have also been reported through ET sightings.\n\n One way to think of our cosmic brothers and sisters is how you'd think of our planet and the different races that reside on her - good, bad, loving, greedy, caring, selfish - the whole gamut of personality 'types'. But far more advanced in spiritual, and technological achievement - than us [Terrans] that live here today.\n\n The universe is infinite with infinite possibilities, so therefore one who cannot subscribe to this method, will be lost - and hide in a space of denial, fear or anger. This is OK, but those that choose to accept there is life 'out there' will have a smoother transition into a galactic, then eventually cosmic conscience... then the fun will begin.\n\n2010 the year WE make contact - open your hearts and minds, and will for an open and transparent transition of knowledge, truth, and unconditional limitless love. :)","torrent":{"xt":"urn:btih:61e2c0ce7cedaf0fa9686f137b5318fbe4ed225e","amp;dn":"ET+Species+101+-+watchZEITGEISTnow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61e2c0ce7cedaf0fa9686f137b5318fbe4ed225e","infoHashBuffer":{"type":"Buffer","data":[97,226,192,206,124,237,175,15,169,104,111,19,123,83,24,251,228,237,34,94]},"announce":[],"urlList":[]}}