{"title":"Directory List &amp; Print PRO v3.01","uid":12553593,"size":5240280,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:628b22fb32d30c74d91beadb4c3c1df937d9e450&amp;dn=Directory+List+%26amp%3B+Print+PRO+v3.01&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZarkBit","files":1,"time":1444598996,"description":"v3.01 changelog\r\nAdded many new Meta Tags for EXIF, IPTC, AUDIO, VIDEO, DOCUMENTS (please see website for details).\r\nAdded tab &quot;Columns&quot; to select and reorder the columns of the list.\r\nAdded PDF output (page size is adjusted automatically up to A0).\r\nAdded column aligning with blanks for outputting to Notepad-editor.\r\nImproved rendering and appearance of the generated file list.\r\nImproved progress indication during output generation.\r\nImproved speed outputting to Word and Excel.\r\nImproved speed for various functions.\r\nOutput generation is now interruptible (also for Word and Excel).\r\nSeveral other minor improvements.\r\n\r\nDirectory List &amp; Print is a software tool for Windows™ and enables listing and printing the content of any directory in a simplest way. In addition, the file lists can be formatted, filtered, saved to several file formats and also be further processed (delete/copy/move files). By copying to the clipboard the lists can be exported into other programs or opened directly in Word™ and Excel™. \r\n\r\nFeatures\r\n\r\nPro Version\r\n...Selection of directories to be listed by a tree structure.\r\n...Selection of directories by entering the path as a text string.\r\n...Drag &amp; Drop of directories (or a file) from Windows Explorer.\r\n...Integration of &quot;Open in Directory List &amp; Print&quot; in the directory context menu of ...Windows Explorer.\r\n...Direct selection of important system directories as &quot;My Documents&quot; etc.\r\n...Listing of sub-directories and/or files and looping through sub-directories (recursion).\r\n...Update file list automatically or manually.\r\n...Display of last modification and creation date.\r\n...Display of last modificatione and creation time.\r\n...Display of file size.\r\n...Display of file name with or without directory path.\r\n...Display of file names with or without file extensions.\r\n...Indication of number of entries of files and directories in the list.\r\n...Print directory listing, direct printing of corresponding list.\r\n...Export list into other programs by copying to the clipboard. The corresponding data will be organized in columns and separated by tabs so that the list can be pasted directly into Excel ™ as a table.\r\n...Open the list directly in Microsoft Word™ and Excel™.\r\n...Support for connecting and disconnecting network drives.\r\n...Automatic saving of display options when exiting the program.\r\n...Start program with a directory path as a parameter.\r\n...Save own directory favorites.\r\n...Set directory recursion depth for subdirectories.\r\n...Display of file attributes (archive, read-only, hidden, system, compressed, encrypted).\r\n...Calculate CRC32 checksums for files.\r\n...Display of title of document files (pdf,doc,docx,xls,xlsx,ppt,pptx).\r\n...Display of extent of document files if possible (pdf,doc,docx,xlsx,pptx).\r\n...Display the version number and title of executables (exe,dll).\r\n...Display format of audio/video and image files.\r\n...Display of dimensions like width, height, bit depth, dpi or frames/s.\r\n...Display duration and title of audio and video files.\r\n...Display of sampling and bit rates for audio files.\r\n...Display of frame rate and bit rate of video files.\r\n...Display of a continuous numbering of the objects.\r\n...Display of column titles in the first row.\r\n...Show number and sum of size and length of the displayed objects.\r\n...Display of the date in many different international formats.\r\n...Display of the time in many different international formats.\r\n...Display the duration of media files in different time formats.\r\n...Sort files by name, size, date/time, duration (A/V), ascending/descending.\r\n...Set filter to certain file size range.\r\n...Set filter to include or exclude certain file types.\r\n...Set filter to include or exclude files and directories by certain terms.\r\n...Set filter to include or exclude files by date range, date created or modified.\r\n...Set filter to include or exclude files by attributes (archive, read-only, hidden, ...system, compressed, encrypted).\r\n...Set filter on audio/video/image properties (Width, Height, BitDepth, Resolution DpI, FrameRate FpS, BitRate KBpS, SamplingRate KHz, Duration in Seconds).\r\n...Set filter on length of filenames, eg. to analyze the file system when copying it to a new directory structure (path+filename, filename only, &gt;, =, &lt;).\r\n...Action, further processing of the files in the file list with a preview of the intended processing. Listed files can be deleted, moved to the Recycle Bin, copied and moved to another destination directory. Already existing files in the target directory can be overwritten or not. The directory structure will be taken over in the destination directory.\r\n...Output the list directly to the default printer.\r\n...Output the list as HTML table (font and color etc. customizable).\r\n...Output the list as XML file.\r\n...Output the list in comma- or tab-delimited file or CSV file.\r\n...Linking of files and directories in Excel™ and HTML output for direct open by mouse click. \r\n(This function is customizable for any language variant of Excel)","torrent":{"xt":"urn:btih:628b22fb32d30c74d91beadb4c3c1df937d9e450","amp;dn":"Directory+List+%26amp%3B+Print+PRO+v3.01","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"628b22fb32d30c74d91beadb4c3c1df937d9e450","infoHashBuffer":{"type":"Buffer","data":[98,139,34,251,50,211,12,116,217,27,234,219,76,60,29,249,55,217,228,80]},"announce":[],"urlList":[]}}