{"title":"Infernal Restraints--Caged BONUS Felonie High","uid":12483175,"size":1750566103,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:63fad690dd345cb446ffbcbfa1f15678a3f1c68f&amp;dn=Infernal+Restraints--Caged+BONUS+Felonie+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1443081504,"description":"\nCaged BONUS | Felonie\r\n\r\nSeptember 23, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nFelonie is confined in a small metal cage for hours, while relentlessly being poked and prodded. \r\n\r\nPD sets an agonizing pace. Felonie's confined in a cage, hanging in the barn for hours. Every step plays like a psychological thriller as PD slowly transforms Felonie's terror.\r\n\r\nIn the beginning, PD lets Felonie's confinement do its work. Then he gives her an orgasm. Just a little one. Just enough to relax her. \r\n\r\nShe's anally impaled, rammed with a rigid set of stainless steel ass beads. Using forceps, PD grasps her tongue and ties it outward. This presses her neck against the steel of the cage. Then vaginal impalement and she's given another orgasm, more intense. \r\n\r\nThe vibrator again. At the same time, he chokes her by forcing her throat hard against the bar of her cage. Another orgasm, this one huge. PD sucks Felonie into her own torment, winning her compliance and complicity.\r\n\r\nShe's sprayed down with cold water. Another orgasm puts Felonie in la-la land. PD's permanently altered her inner terrain.\r\n\r\nThe head cage with a metal bit holds her head even more still. Clamps on her labia are weighed down with chain. Her pussy's swollen, engorged from all her orgasms. \r\n\r\nShe sobs, and the tenor of her scream changes, slightly warped, an unsettling sound. The vibrator nearly disappears inside the swelled lips of her pussy. \r\n\r\nAnother orgasm, and another. PD slips his hand inside of her up to the knuckles. He rams all of her holes and she comes again, over-stimulated into some never-never land of sexual exhaustion.\r\n\r\nNow she's standing, tightly strapped with leather, held up by her hair. A singletail brings her to tears again. She begs PD to let her down. She promises him anything. He tells her she must make herself stop crying. Her face slowly reduces. It becomes a face that is not crying. She exchanges one unbearable condition for another. The dissolution of one self. The emergence of another. \r\n \r\nScreens \nhttp://www.infernalrestraints.com/device/bondage/trailer.php?y=2015&amp;p=09_23felonie2&amp;u=InfernalRestraints-Felonie-Caged-BONUS\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:63fad690dd345cb446ffbcbfa1f15678a3f1c68f","amp;dn":"Infernal+Restraints--Caged+BONUS+Felonie+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63fad690dd345cb446ffbcbfa1f15678a3f1c68f","infoHashBuffer":{"type":"Buffer","data":[99,250,214,144,221,52,92,180,70,255,188,191,161,241,86,120,163,241,198,143]},"announce":[],"urlList":[]}}