{"title":"Supertramp - Give a Little Bit (Sight and Sound, 1977).VOB","uid":12545210,"size":251195392,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:64c862c4297256be9d6995c7ba213f324af35882&amp;dn=Supertramp+-+Give+a+Little+Bit+%28Sight+and+Sound%2C+1977%29.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":1,"time":1444461596,"description":"Supertramp - Give a Little Bit (Sight &amp; Sound In Concert, 1977).VOB\r\n\r\n\r\nHQ rare live performance at Sight and Sound In Concert. &quot;Give a Little Bit&quot; is the opening song on Supertramp's 1977 album Even in the Quietest Moments.... The song was released as a single that same year and became an international hit for the band, peaking at number 15 on the Billboard Pop Singles chart. It was a chart hit in the band's native UK, reaching number 29 on the UK Singles Chart. The single was re-released in 1992 to raise funds for the ITV Telethon Charity event, but failed to chart.\r\n\r\nIts writing credits are given to Rick Davies and Roger Hodgson, although it is a Hodgson composition. Hodgson and Davies shared writing credits from 1974 until 1983, when Hodgson left Supertramp. The song is characterized by the ringing tones of 12-string acoustic guitars, which is joined by a Hohner Clavinet through a Leslie speaker in the bridge of the song.\r\n\r\nDrummer Bob Siebenberg recounted that &quot;Roger had been working at Malibu for quite a while on this tune. I'd hear the song in hotel rooms and places like that. He had the song on a little tape when I first joined the band so I was quite familiar with the tune. We tried out various drum things and it seemed right to ride it along on the snare drum... giving it something almost like a train beat. So it's all on the snare and bass drum, with no tom-tom fills or anything.&quot;\r\n\r\nA short snippet of the song is played in the film &quot;Superman&quot; shortly before Lois Lane's &quot;death&quot; scene. The song, however, is not featured on the movie's soundtrack.\r\n\r\nThe song was used interwoven with the final scenes and part of the end credits for the Ricky Gervais film &quot;The Invention of Lying&quot;.\r\n\r\nThe song was used in 2014 for Stouffer's, Coca Cola´s Share Happiness commercials and for Target Australia's Christmas commercials in 2014.\r\n\r\n\r\nSupertramp are an English rock band formed in 1969 under the name Daddy before renaming themselves in early 1970. Though their music was initially categorised as progressive rock, they later incorporated a combination of traditional rock, pop and art rock into their music. The band's work is marked by the songwriting of founders Rick Davies and Roger Hodgson and the prominent use of Wurlitzer electric piano and saxophone.\r\n\r\nWhile the band's early work was mainstream progressive rock, they would enjoy greater commercial success when they incorporated more conventional and radio-friendly elements into their work in the mid-1970s, going on to sell more than 60 million albums. Hodgson’s song &quot;Dreamer&quot; became their first hit single and drove the album Crime of the Century to the top of the charts. They reached their commercial peak with 1979's Breakfast in America, which has sold more than 20 million copies. The line-up with Davies, Hodgson, John Helliwell (woodwinds, keyboards, synthesizers, vocals), Bob Siebenberg (drums) and Dougie Thomson (bass) achieved international success from the album Crime of the Century to ...Famous Last Words....\r\n\r\nThough their albums were generally far more successful than their singles, Supertramp did enjoy a number of major hits throughout the 1970s and 1980s, including Hodgson's songs &quot;Give a Little Bit&quot;, &quot;The Logical Song&quot;, &quot;Take the Long Way Home&quot;, &quot;Dreamer&quot;, &quot;Breakfast in America&quot;, &quot;It's Raining Again&quot;, and Davies' songs, &quot;Bloody Well Right&quot;, &quot;Goodbye Stranger&quot;, and &quot;Cannonball&quot;. The band attained significant popularity in the United States, Canada, Europe, South Africa and Australia. Since co-founder Hodgson's departure in 1983, Rick Davies has led the band by himself.\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Give_a_Little_Bit \r\n      \nhttp://postimg.org/image/jvk2llve7/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\r\n   Audio: MP3 Digital 48000Hz stereo 192kbps\r\n   Duration: 00:04:02\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:64c862c4297256be9d6995c7ba213f324af35882","amp;dn":"Supertramp+-+Give+a+Little+Bit+%28Sight+and+Sound%2C+1977%29.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64c862c4297256be9d6995c7ba213f324af35882","infoHashBuffer":{"type":"Buffer","data":[100,200,98,196,41,114,86,190,157,105,149,199,186,33,63,50,74,243,88,130]},"announce":[],"urlList":[]}}