{"title":"Soundgarden - Burden in My Hand (promo).VOB","uid":12544825,"size":220407808,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:67a211571849f2273ced93055963b3b4a1050226&amp;dn=Soundgarden+-+Burden+in+My+Hand+%28promo%29.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":1,"time":1444455702,"description":"Soundgarden - Burden in My Hand (promo).VOB\r\n\r\n\r\nHQ rare music video from a promo DVD. &quot;Burden in My Hand&quot; is a song by the American rock band Soundgarden. Written by frontman Chris Cornell, &quot;Burden in My Hand&quot; was released on September 18, 1996 as the second single from the band's fifth studio album, Down on the Upside (1996). The song topped the Billboard Mainstream Rock Tracks chart, where it spent a total of five weeks at number one. The song was included on Soundgarden's 1997 greatest hits album, A-Sides.\r\n\r\nThe music video for &quot;Burden in My Hand&quot; was directed by Jake Scott, who had previously directed the &quot;Fell on Black Days&quot; music video for the band. The video features the band members walking through what appears to be the Kelso Dunes of the eastern Mojave Desert. The fighter aircraft seen in the video can be identified as a J 35 Draken, apparently operated out of the Mojave Air &amp; Space Port. The video was released in June 1996.\r\n\r\nThe lyrics of 'Burden in My Hand' suggest the song is about a man who murders a woman he is in a relationship with and leaves her in the desert, not without regret. Some fans believe the lyrics are 'deeper' than the surface and indicative of something such as drug abuse or an abusive relationship; however, guitarist Kim Thayil called the song &quot;the &quot;Hey Joe&quot; of the '90s.&quot; In a 2011 interview with ARTISTdirect.com, Chris Cornell was asked what the song had come to mean for him, years later. Cornell responded:\r\n\r\n\r\n&quot;That was a song that really came from the guitar itself. It was mostly like the guitar was dictating what the lyrics should be and creating a mental image. The mental image was this sort of destitute guy. I guess he'd lost his cool if you want to put it that way. He's sort of coming to grips with what had happened and not necessarily feeling particularly emotional about it either way. He's trying to figure out how he would stand up and put one foot in front of the other—or not—and the song never really resolves any of that. It's just that moment of somebody sitting in the dirt. I had more moments like that after that song was written than I ever had before it was, so it means a lot more to me now than it did then.&quot;\r\n\r\n\r\n\r\nSoundgarden is an American rock band formed in Seattle, Washington, in 1984 by singer and rhythm guitarist Chris Cornell, lead guitarist Kim Thayil, and bassist Hiro Yamamoto. Matt Cameron became the band's full-time drummer in 1986, while bassist Ben Shepherd became a permanent replacement for Yamamoto in 1990.\r\n\r\nSoundgarden was one of the seminal bands in the creation of grunge, a style of alternative rock that developed in Seattle, and was one of a number of grunge bands signed to the record label Sub Pop. Soundgarden was the first grunge band to sign to a major label (A&amp;M Records, in 1988), though the band did not achieve commercial success until they popularized the genre in the early 1990s with Seattle contemporaries Pearl Jam, Nirvana, and Alice in Chains.\r\n\r\nSoundgarden achieved its biggest success with the 1994 album Superunknown, which debuted at number one on the Billboard charts and yielded the Grammy Award-winning singles &quot;Black Hole Sun&quot; and &quot;Spoonman&quot;. In 1997, the band broke up due to internal strife over its creative direction. After several years working on projects and other bands, Soundgarden reunited in 2010 and their sixth studio album, King Animal, was released two years later.\r\n\r\nAs of 2012, Soundgarden had sold more than 10.5 million records in the United States, and an estimated 22.5 million worldwide. VH1 ranked Soundgarden at number 14 in their special 100 Greatest Artists of Hard Rock.\r\n*(video does not have any logos and was extracted untouched from the promo DVD)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Burden_in_My_Hand \r\n      \nhttp://postimg.org/image/hu6nfai9d/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 5500kbps\r\n   Audio: Dolby Digital AC3 48000Hz stereo 256kbps\r\n   Duration: 00:05:00\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:67a211571849f2273ced93055963b3b4a1050226","amp;dn":"Soundgarden+-+Burden+in+My+Hand+%28promo%29.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a211571849f2273ced93055963b3b4a1050226","infoHashBuffer":{"type":"Buffer","data":[103,162,17,87,24,73,242,39,60,237,147,5,89,99,179,180,161,5,2,38]},"announce":[],"urlList":[]}}