{"title":"Joydel - Nao Oikawa ( Japanese Supermodel as Teacher","uid":12522156,"size":1105152000,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:67b5512e667eb11fa1cf097891c797356d50a0a8&amp;dn=Joydel+-+Nao+Oikawa+%28+Japanese+Supermodel+as+Teacher&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"feeldabyte","files":1,"time":1443893691,"description":"Joydel - Nao Oikawa ( Japanese Supermodel as Teacher Nao) Uncen XXX DVDRip [avi]\r\n\r\nScreens &amp; Info :\r\n\r\n----------------------------------\r\n  \nhttp://imgkiss.com/image/ftlSN \nhttp://imgkiss.com/image/ft7wF \nhttp://imgkiss.com/image/ftUG5\r\n\r\n----------------------------------\r\n\r\nPerformers: Nao Oikawa\r\n\r\nAnother great title comes out from the Joydel series. The title, Joydel: Teacher Nao. As the title speaks for itself, this movie stars a very slim and beautiful woman by the name of Nao Oikawa. Nao, when she was a mere student got violated. 6 years later she still dreams about that evil incident. To her, this nightmare is also her inner desire. She will becomes a sex slave of her students! Watch this beautiful girl get fucked, fucked, and fucked! This is one blowout movie! No mosaics are scene and the picture quality is great! Go Joydel! After she wakes up from her nightmare, one of her student tells her to masturbate. Not wanting to resist, she do as he insist. You gotta take a close look at her body after she takes off her clothes. She has one hell of a dynamite body! Another student hearing about this, he goes up to the teacher after class and tells her that it’s not fair, why does he get to see it and I don’t? Again, she can’t resist, so will suck his clock in the class room! Now her sex slave days starts. She will do the nasty everywhere now, long as the students request it! Eventually she will even fuck with a teacher in the teacher’s lounge! After many many sex, she has changed from a nerdy smart looking girl who resist sex to a super sexy whore who craves for sex! Watch the change; it’s amazing! Don’t miss out on interview located with in the special features! Overall, this is a great movie. I highly recommend this movie and I would also say this is a much watch movie! Once you look at this movie, you WILL fall in love with this 21 years beauty!\r\n\r\nSail to another one :\r\n  \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:67b5512e667eb11fa1cf097891c797356d50a0a8","amp;dn":"Joydel+-+Nao+Oikawa+%28+Japanese+Supermodel+as+Teacher","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67b5512e667eb11fa1cf097891c797356d50a0a8","infoHashBuffer":{"type":"Buffer","data":[103,181,81,46,102,126,177,31,161,207,9,120,145,199,151,53,109,80,160,168]},"announce":[],"urlList":[]}}