{"title":"From.Darkness.s01e03.EN.SUB.x265.WEBRIP.[MPup]","uid":12599493,"size":154060094,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:68c0cda0a766fd9966b4cb0fdc09c6eddaacbaea&amp;dn=From.Darkness.s01e03.EN.SUB.x265.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1445306303,"description":"From.Darkness.s01e03.EN.SUB.x265.WEBRIP.[MPup]\r\n\r\n[b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nFormat: HEVC\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]3 of 4[/b]\r\n\r\nAs the threat to her own life intensifies, Claire grapples with the mind of her tormentor. Desperate to atone for the past, will her sense of guilt stand in the way of survival?\r\n\r\n[img]http://extraimago.com/images/2015/10/19/31aecdabf32443cf26117ca02b6d65e4.jpg[/img]\r\n\r\nA direct threat on Claire's life pushes her uncomfortably close to John, sending her fleeing to the Western Isles. Convinced she's being watched, Claire finds she can't outrun the darkness this time as Norrie, frightened for his daughter's safety, banishes Claire back to Manchester. To win her family back, Claire must solve the murders and trap her tormentor.\r\n\r\nJohn also faces mounting pressure to crack the case, as ambitious DSI Lola Keir dangles his pending misconduct investigation over him. She needs a clean arrest based on hard evidence; with Claire's reliability in question, John must dismiss her theory of a new killer and play by Lola's rules.\r\n\r\nSidelined from the investigation, Claire attempts to get inside her stalker's mind. Her frenzied investigations lead her straight to into her target's path, igniting a dangerous line of communication that severely tests Claire's loyalties and professionalism. When a high-profile prime suspect re-emerges, Claire repeats a fatal mistake when she makes a promise she can't keep.\r\n\r\nDetermined to end the violence, Claire entices John into a reckless mission that could cost them much more than his career. She believes it's a risk worth taking. But the explosive consequences of their rebellion threaten to launch a fresh wave of terror, and to drive the pair apart forever","torrent":{"xt":"urn:btih:68c0cda0a766fd9966b4cb0fdc09c6eddaacbaea","amp;dn":"From.Darkness.s01e03.EN.SUB.x265.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68c0cda0a766fd9966b4cb0fdc09c6eddaacbaea","infoHashBuffer":{"type":"Buffer","data":[104,192,205,160,167,102,253,153,102,180,203,15,220,9,198,237,218,172,186,234]},"announce":[],"urlList":[]}}