{"title":"SD Maid Pro - System Cleaning Tool.apk","uid":12610744,"size":6330637,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:68cc3510ca6b494bc41087ed90340b07a705f3da&amp;dn=SD+Maid+Pro+-+System+Cleaning+Tool.apk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bunbur","files":1,"time":1445456696,"description":"This is a powerful tool! Use at own risk!\r\n\r\nNobody is perfect and Android neither.\r\nApps you have already deleted, sometimes leave data behind.\r\nThe system constantly creates logs, crash reports and debug files you don't really need.\r\nYour SD-card is collecting files and directories you don't recognize.\r\nLets not go on here...\r\n\r\nWhy not get a maid to clean it all up?\r\nSD Maid will help you keep your device neat, clean and tidy :-)!\r\n\r\nGive it a try, you won't find a more thorough cleaning tool!\r\n\r\nChoose a tab, press start and then either click a single item to delete or press the clean all button. It's just that easy.\r\n\r\nThere are various features available:\r\n* Explorer is a full fledged filemanager, use it to crawl through your Androids files.\r\n* You can use the Searcher if you know what file you are looking for.\r\n* The CorpseFinder searches your device for orphaned items and compares those to the list of installed applications.\r\n* AppControl lets you freeze, reset and remove applications (even system apps).\r\n* The SystemCleaner scans your device and filters directories which contain unnecessary files. You an even create your own filters!\r\n* You can optimize and shrink bloated databases to speed up access and free space.\r\n* View your biggest files and find out what is hogging all the space.\r\n* Find files that have been modified in the last X minutes.\r\nAnd more...\r\n\r\nA few additional features as well as comfort and convenience functions can be unlocked by buying and installing the unlocker (SD Maid Pro).\r\n\r\nSD Maid is constantly being developed and designed very carefully","torrent":{"xt":"urn:btih:68cc3510ca6b494bc41087ed90340b07a705f3da","amp;dn":"SD+Maid+Pro+-+System+Cleaning+Tool.apk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68cc3510ca6b494bc41087ed90340b07a705f3da","infoHashBuffer":{"type":"Buffer","data":[104,204,53,16,202,107,73,75,196,16,135,237,144,52,11,7,167,5,243,218]},"announce":[],"urlList":[]}}