{"title":"Composite Materials, Science and Applications","uid":12404225,"size":6344974,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b71fe2f3711cd8fe66b339c4c2934286440bcf1&amp;dn=Composite+Materials%2C+Science+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"clouderone","files":1,"time":1442068410,"description":"Composite Materials, Science and Applications (Springer, 2010).pdf\n\nISBN 978-1-84882-830-8\n\nThe applications of composite materials continue to be of increasing importance due to the industry's need for modern analysis and improved performance. The first edition of Composite Materials introduced a new way of looking at composite materials: covering composites in accordance with their functions. This second edition expands the book's scope to emphasize application-driven and process-oriented materials development. Although applications are the economical and technological driving force of materials development, processes often determine the feasibility and practicality. This tutorial-style reference book examines both structural composite materials (including their mechanical properties, durability, and degradation) and functional composite materials (including their electrical, piezoresistive, and thermal properties), as needed for a substantial range of applications. The emphasis on application-driven and process-oriented materials development is enhanced by a large amount of experimental results that provide real illustrations of composite materials development.Composite Materials is an essential book for researchers and engineers who are interested in materials development for industrial applications. It has a vibrant yet functional approach, making it suitable for both students and practitioners, and provides a full explanation of all of the fundamental concepts related to the structural and functional properties covered","torrent":{"xt":"urn:btih:6b71fe2f3711cd8fe66b339c4c2934286440bcf1","amp;dn":"Composite+Materials%2C+Science+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b71fe2f3711cd8fe66b339c4c2934286440bcf1","infoHashBuffer":{"type":"Buffer","data":[107,113,254,47,55,17,205,143,230,107,51,156,76,41,52,40,100,64,188,241]},"announce":[],"urlList":[]}}