{"title":"Y0utube Music Downloader 3.1 + Serial [1337x] [Ahmed]","uid":5291871,"size":3689906,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6cab841c0191b0ef48730f9610f479d4dd565448&amp;dn=Y0utube+Music+Downloader+3.1+%2B+Serial+%5B1337x%5D+%5BAhmed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ahmed1337x","files":4,"time":1263924395,"description":"[img]http://www.any-video-converter.com/images/adc-left.jpg[/img]\n\nAs professional video converter, Any Video Converter performs its excellence in converting AVI, MPG, RMVB, MOV, MKV and many other video formats to WMV, AVI, MP4, FLV, 3GP and other popular formats at fast speed and with outstanding quality.\nAny Video Converter supports iPod, iPhone, Zune, PSP and other Portable Media Players (PMPs) and cell phones. Besides the output formats dedicated for iPod, iPhone, Zune, PSP and cell phones, \n\nAny Video Converter supports customizing WMV, AVI and 3GP formats.\n  \nAny Video Converter Pro. is a professional video converter which can convert video files from various formats with fast converting speed and excellent video quality.\nIt can convert almost all video formats including DivX, XviD, MOV, rm, rmvb, MPEG, VOB, WMV, AVI to MPEG-4, AVI, WMV, 3GP, 3G2 format for your iPod, PSP, iPhone, Archos, Creative Zen, iRiver and many other portable media players. It also supports any user defined video file formats as the output. It has an unmatchable speed and high quality. \n\nAny Video Converter Pro. makes it easy for anyone to enjoy videos in any formats video on the go.\n \nAny Video Converter Pro. makes batch file conversion simple.\nYou can simply add a batch of videos and convert them with clicking the convert button. The converted files will be saved to a pre-selected directory folder and the original files will remain untouched. Auto-shutdown function is provided so that you can just walk away after the batch conversion is started.\n \nAny Video Converter Pro. is aVideo Converter which can download video fromand convertvideos to other formats. With the &quot;downloading + converting&quot; one-step solution, Any Video Converter Pro.\neasily downloads and convertsvideos to play on your iPod, iPhone, PSP, Zune, 3GP mobile phone, Apple TV, etc. Besides, you can specifyvideo quality to download, types of video quality could be standard FLV movies, 3GP mobile phones, high quality AVC MPEG-4 movies and high definition (HD) MP4 videos.\n \nAny Video Converter Pro is also a HD video converter which allows you to convert HD movies including HD AVI, HD MKV, HD WMV, AVCHD, TS, TP, MKV to videos playable on iPod, PSP and other devices.\nHigh definition output video size up to 1920x1080 are also available for MKV, AVI, WMV and MP4 output formats.\n \nAny Video Converter comes with many practical functions including video trimming,\nvideo merging, output profile management, customizable settings which makes it convenient and extendable for both beginners and advanced users.\n \nAny Video Converter provides an audio extraction feature as a bonus.\nYou can extract audio from any video formats it supports to MP3, AAC, M4A, WMA, OGG and Wave.","torrent":{"xt":"urn:btih:6cab841c0191b0ef48730f9610f479d4dd565448","amp;dn":"Y0utube+Music+Downloader+3.1+%2B+Serial+%5B1337x%5D+%5BAhmed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cab841c0191b0ef48730f9610f479d4dd565448","infoHashBuffer":{"type":"Buffer","data":[108,171,132,28,1,145,176,239,72,115,15,150,16,244,121,212,221,86,84,72]},"announce":[],"urlList":[]}}