{"title":"Liza Marklund S01 Nordic 2012 NL Subs","uid":12545824,"size":9006525168,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6e67c8641026465df2f47b6bd754999dfdc8a9bb&amp;dn=Liza+Marklund+S01+Nordic+2012+NL+Subs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":6,"time":1444473690,"description":"Na Sarah Lund, Saga Norén en Birgitte Nyborg is hier Annika Bengtzon, het hoofdpersonage uit de Liza Marklund’s Annika Bengzton, een nieuwe crimeserie van de producenten van Millennium. \r\n\r\nHaar hoofdpersonage, Annika Bengtzon, is net zoals voornoemde dames, een vrouw met ballen. Een kuitenbijter die regelmatig buiten de lijntjes kleurt en die voortdurend flirt met het gevaar. Dat dat ten koste gaat van haar relatie met Thomas, met wie ze twee schattige kinderen heeft, neemt ze er noodgedwongen bij. Werk combineren met de taak van huismoeder is ook in Zweden geen gemakkelijke taak, vooral als je verslaafd bent aan je werk. \r\n\r\nBengtzon is een gedreven journaliste. Ze werkt op de redactie van de fictieve tabloid Kvällspressen. Haar baas Anders Schyman geeft haar de nodige ruimte, maar gebruikt ook zijn autoriteit wanneer hij volgens de wet bepaalde dingen niet mag publiceren. Veel vrienden heeft Annika niet. De enige met wie ze een goede band heeft is haar collega Berit. Met wie ze ook vaak contact heeft en met wie ze regelmatig nieuws uitwisselt is politie-inspecteur Q, een man die weet wat hij aan Annika heeft, maar die wel steeds zijn grenzen stelt. \r\n\r\n1. Het Testament Van Nobel: Wanneer op het galadiner voor de Nobelprijzen een aanslag wordt gepleegd blijkt niet de winnaar het doelwit, maar iemand van de commissie. Annika is kroongetuige","torrent":{"xt":"urn:btih:6e67c8641026465df2f47b6bd754999dfdc8a9bb","amp;dn":"Liza+Marklund+S01+Nordic+2012+NL+Subs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e67c8641026465df2f47b6bd754999dfdc8a9bb","infoHashBuffer":{"type":"Buffer","data":[110,103,200,100,16,38,70,93,242,244,123,107,215,84,153,157,253,200,169,187]},"announce":[],"urlList":[]}}