{"title":"Saving.The.Cybersex.[Cyber.Sex].Girls.Part.1.EN.SUB.x265.[MPup]","uid":12605596,"size":276804080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6f3a29dd57cac01884714196feeb4c01efcf4a03&amp;dn=Saving.The.Cybersex.%5BCyber.Sex%5D.Girls.Part.1.EN.SUB.x265.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1445380572,"description":"Stacey.Dooley.Investigates.2015.10.19.Saving.The.Cybersex.[Cyber.Sex].Girls.Part.1.EN.SUB.x265.WEBRIP.[MPup]\r\n\r\n[b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nFormat: HEVC\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]1 of 2[/b]\r\n\r\nStacey Dooley travels to the Philippines, learning how poverty combined with cheap internet access has led to an increasing number of girls being exposed to online sexual abuse.\r\n\r\n[img]http://extraimago.com/images/2015/10/20/be9da11de3fa3b76eb285a6716206ab4.jpg[/img]\r\n\r\nStacey Dooley presents the first of two hard-hitting films from the worst places in the world to be female, to investigate why some young women today live in such dangerous, desperate and degrading conditions. In this episode Stacey travels to the Philippines - fast becoming the world capital of the cybersex industry.\r\n\r\nHere, girls who are rarely let out and often underage must perform on webcams and be photographed for a global online audience. Within the last year alone, 139 Brits were investigated for paying to watch Philippine children being abused. Stacey learns how poverty combined with cheap internet access has led to an increasing number of girls being exposed to online sexual abuse.\r\n\r\nDiscovering the harrowing truth behind this widespread exploitation, Stacey then exposes an even darker side - cybersex dens. She goes undercover for the first time and joins the police on a major sting, where she confronts the criminals behind this new and disturbing phenomenon. Stacey also follows charity workers as they intercept traffickers smuggling teenage girls into Manila for the cybersex trade.\r\n\r\nStacey also travels north of Manila and learns that efforts are being made to help some of the 100,000 victims of exploitation using therapy and counselling led by psychologists - who have often suffered the same abuse as the children they are helping. Stacey is overwhelmed at the sheer scale of the billion-dollar industry, but remains hopeful that if police forces across the world work together, there's a chance this secretive trade can be tackled","torrent":{"xt":"urn:btih:6f3a29dd57cac01884714196feeb4c01efcf4a03","amp;dn":"Saving.The.Cybersex.%5BCyber.Sex%5D.Girls.Part.1.EN.SUB.x265.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3a29dd57cac01884714196feeb4c01efcf4a03","infoHashBuffer":{"type":"Buffer","data":[111,58,41,221,87,202,192,24,132,113,65,150,254,235,76,1,239,207,74,3]},"announce":[],"urlList":[]}}