{"title":"[NubileFilms] Nikki Dreams (All My Love) SD **NEW OCT 13,2015**","uid":12562241,"size":180257016,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6fceac26d1fb4b21bc81fff52586350a615a4804&amp;dn=%5BNubileFilms%5D+Nikki+Dreams+%28All+My+Love%29+SD+%2A%2ANEW+OCT+13%2C2015%2A%2A&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UniX","files":1,"time":1444727261,"description":"[NubileFilms] Nikki Dreams (All My Love) SD **NEW OCT 13,2015**\r\n\r\nSCREENS;\r\n \nhttp://imgurx.net/share-EF78_561CAC60.html\r\n\r\nFresh from the shower, Nikki Dream gets back into bed so that she can enjoy a day of relaxation with Lutro. The couple spends plenty of time together, playing and flirting until finally Nikki winds up on the bed naked with Lutro giving her a back massage.\r\n\r\nUnable to keep from sampling Nikki's juices, Lutro works his way down her tanned body until he has reached his goal. He takes a sample lick of her snatch, and then dives in when he finds her delicious and wet for him. Soon Lutro is engaged in a full-on pussy feast while Nikki moans her approval of his every touch to her needy twat.\r\n\r\nHappy to repay the favor, Nikki pulls off Lutro's briefs and wraps her sweet lips around his thick cock. Using her hands and magic mouth to their fullest potential, Nikki blows her man with plenty of enthusiasm.\r\n\r\nLutro could let Nikki suck him off all day, but the blonde wants to get fucked! Always willing to please, Lutro rises up on his knees and sinks his cock balls-deep into Nikkis' fuck hole so that he can start thrusting hard enough to make her boobs with their huge areolas bounce.\r\n\r\nFlipping onto her belly, Nikki raises her rump in the air to invite Lutro back inside. He grants her wish, sliding home once again and using this new angle to pound deeper and harder until Nikki can barely keep up. By the time her gasps of ecstasy have reached their orgasmic peak, Lutro can barely hold on another moment. He pulls out at the last second, covering Nikki's ass with his cum as a final stamp of approval for a long loving afternoon","torrent":{"xt":"urn:btih:6fceac26d1fb4b21bc81fff52586350a615a4804","amp;dn":"%5BNubileFilms%5D+Nikki+Dreams+%28All+My+Love%29+SD+%2A%2ANEW+OCT+13%2C2015%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fceac26d1fb4b21bc81fff52586350a615a4804","infoHashBuffer":{"type":"Buffer","data":[111,206,172,38,209,251,75,33,188,129,255,245,37,134,53,10,97,90,72,4]},"announce":[],"urlList":[]}}