{"title":"Courdek - Synchronicicity","uid":5302573,"size":174573407,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7348b09a70367629a5a9f10a840b35751acbedf1&amp;dn=Courdek+-+Synchronicicity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":18,"time":1264272791,"description":"This debut album composed and performed by Avenue of the Arts member COURDEK, takes an introspective journey into themes that most experience, but do not always reflect upon. Drawing from personal observation and experience COURDEK shapes a landscape of inner turmoil and resolution through carefully painted scenarios that reel you in from start to finish and leave you with a feeling of refreshment. He describes the album as a sort of self-help session intended for his own personal advancement, but also states, &quot;if one person can find help or make a connection with the music then I at least doing one thing right.&quot; He adds, &quot;What good is creating something if not to share it with everyone possible?&quot;\n\nThe album was produced primarily by COURDEK himself, with guest spots by DJ LES and KONRADIO of the Unusuals. The sonic landscape is vast with many styles that seem to dance in a kaleidoscope of emotion and soul. COURDEK's eccentricities are easily discerned, characterized in his blend of progressive hip hop and traditional instrumentals that enhance and drive the album in a &quot;forward at a good speed&quot; kind of way.\n\nIf you are feeling warm and fuzzy, you could always buy it from iTunes(http://itunes.apple.com/us/album/synchronicity/id218134235). Either way, Enjoy.","torrent":{"xt":"urn:btih:7348b09a70367629a5a9f10a840b35751acbedf1","amp;dn":"Courdek+-+Synchronicicity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7348b09a70367629a5a9f10a840b35751acbedf1","infoHashBuffer":{"type":"Buffer","data":[115,72,176,154,112,54,118,41,165,169,241,10,132,11,53,117,26,203,237,241]},"announce":[],"urlList":[]}}