{"title":"Final Uninstaller v2.5.6 w/serials","uid":5282361,"size":2934784,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7a330617cf49a21f90c1c12db8e8b47f03b2ac5a&amp;dn=Final+Uninstaller+v2.5.6+w%2Fserials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2mean2die","files":1,"time":1263592693,"description":"Final Uninstaller is an ultimate tool that has the capability to completely remove the remains of all files and registry entries after software un-installation. \nAfter un-installing any software there are chances that your hard disk is left with some remains of the software. This problem has the capability to crop up because of the inability to clean leftovers from un-installed software or getting error messages while re-installing software. Searching and tracing these remains is waste of your precious time. Hence, you need an application that can efficiently clear up such remains. With the help of this amazing un-installation software, the user can completely remove files from an incomplete un-installation and clean up your registry. \nBundled in a simple to use interface this tool features; a powerful database that has stored in features of left files and their behavior, it can completely scan the entire Windows registry and drives to trace any leftovers in a click, in-built application with power and intelligence can trace and safely remove all leftovers from un-installed software with a single click, has the capability to safely remove stubborn drivers, services and leftovers of files and registry entries that cannot be removed by the add and remove program.\n","torrent":{"xt":"urn:btih:7a330617cf49a21f90c1c12db8e8b47f03b2ac5a","amp;dn":"Final+Uninstaller+v2.5.6+w%2Fserials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a330617cf49a21f90c1c12db8e8b47f03b2ac5a","infoHashBuffer":{"type":"Buffer","data":[122,51,6,23,207,73,162,31,144,193,193,45,184,232,180,127,3,178,172,90]},"announce":[],"urlList":[]}}