{"title":"GTA Vice City ","uid":12410946,"size":1394145280,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7af8d738c20e3e227c2476b7a8b58ef503f1d2d3&amp;dn=GTA+Vice+City+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pcgames.R.us","files":2,"time":1442105446,"description":"GTA Vice City\n\n\nTommy Vercetti, a loyal former member of the Forelli Family, has just been released in 1986, serving 15 years for killing 11 men in the Harwood District of Liberty City in early 1971, earning him the nickname The Harwood Butcher. Tommy's old boss, Sonny Forelli, fears that Tommy's presence in Liberty City will heighten tensions between the other Liberty City families and bring unwanted attention to his organisation's criminal activities.\n\n\nTommy makes alliance with Umberto Robina's Cubans against Auntie Poulet's Haitians, even though he is at the same time hypnotised by Poulet's voodoo into helping the Haitians as well. However, Tommy and Poulet part ways Tommy and the Cubans sneak explosives into the Haitian drug factory disguised in Haitian gang cars and blow it up, effectively ending the conflict and putting the Haitians out of business, enabling the Cubans to take over Little Havana. Umberto then becomes Tommy's partner. He also becomes friends with Big Mitch Baker, a leader of the biker gang and a Vietnam veteran, with both the bikers and the Cubans becoming protectors of Vercetti family business.\n\n\n\n\nBurn or mount disk images\nInstall from disks\nRun Crack.exe (located on Disk 2)\nIt will ask you to replace with cracked files in default directory:\nC:Program Files (x86)Rockstar GamesGrand Theft Auto Vice City\nSelect &quot;Yes to all&quot;","torrent":{"xt":"urn:btih:7af8d738c20e3e227c2476b7a8b58ef503f1d2d3","amp;dn":"GTA+Vice+City+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7af8d738c20e3e227c2476b7a8b58ef503f1d2d3","infoHashBuffer":{"type":"Buffer","data":[122,248,215,56,194,14,62,34,124,36,118,183,168,181,142,245,3,241,210,211]},"announce":[],"urlList":[]}}