{"title":"The Upperfloor--tUF-38872 Dani Daniels, Bella Rossi, Tommy Pisto","uid":12493896,"size":2688131776,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7bb77c2b0d3b469fac9fa0873b0a49e9bf0d3f08&amp;dn=The+Upperfloor--tUF-38872+Dani+Daniels%2C+Bella+Rossi%2C+Tommy+Pisto&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":101,"time":1443224284,"description":"\n\r\nAfternoon Delight: Twin Set of Sex Slaves Well Used\r\n\r\nSep 25, 2015 - Performers: Tommy Pistol ,  Bella Rossi  and  Dani Daniels \r\n\r\n\r\nMed and HD MP4 + Pics.\r\n\r\n\r\nNo new girls to train, no party to entertain. Today is a meditation on pure, well trained submissive female sex. Two of our most elegant slaves are on hand to serve and entertain our discerning male guest Tommy with their gorgeous bodies and well mannered submission. \r\n\r\nDani Daniels and Bella Rossi are the picture of slavehood, sweating silently in stress positions and tight bondage, waiting to see what their master will do with them. Tommy has decided today he would like to further refine Dani's posture training and Bella's orgasm control, and the best way to achieve any training with two slaves is predicament, namely a hard cock in both ladies mouths, a relentless vibrators on Bella's trapped pussy, and a crop on Dani's exposed cunt. Artfully playing the ladies off against each other, Tommy takes both their holes in turn, face fucking Dani while she balances silver trays loaded with books and pounding Bella into Dani's ass while both ladies try desperately not to cum until they have been given permission. \r\n\r\nTommy has both ladies tied in tight rope bondage like perfect table dressing in his room. Both nubile asses in the air, the slaves are given a hard flogging and are made to beg for their fucking. Vibrators tied tightly against their exposed clits, the slaves call for relief while being fucked like little toys and cum again and again. \r\n\r\nFinally allowed on their Master's bed Dani and Bella display their training in sexual service, entertaining Tommy and the home viewer with a deft show of whorish hunger, swallowing cock, slapping each other around for entertainment, bouncing on Tommy's cock, and lapping at each other cunts like greedy pets. Both girls beg for a cream pie, but it is Dani who ultimately earns the cum out of her Master, but that doesn't mean she can't share, scooping it out of herself and using it as lube to fuck one more orgasm out of her slave sister.\r\n\r\nScreens \nhttp://www.theupperfloor.com/site/shoot/38872-Afternoon-Delight-Twin-Set-of-Sex-Slaves-Well-Used.html\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:7bb77c2b0d3b469fac9fa0873b0a49e9bf0d3f08","amp;dn":"The+Upperfloor--tUF-38872+Dani+Daniels%2C+Bella+Rossi%2C+Tommy+Pisto","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bb77c2b0d3b469fac9fa0873b0a49e9bf0d3f08","infoHashBuffer":{"type":"Buffer","data":[123,183,124,43,13,59,70,159,172,159,160,135,59,10,73,233,191,13,63,8]},"announce":[],"urlList":[]}}