{"title":"Meiden van de Herengracht S01E01 - S01E06 HDTV x264 2015","uid":12562632,"size":4220869871,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7c1738b5beaeff9d869653dbb99796c4b82942b6&amp;dn=Meiden+van+de+Herengracht+S01E01+-+S01E06+HDTV+x264+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Moses35i","files":6,"time":1444734135,"description":"Meiden van de Herengracht Aflevering 1 t/m 6 2015\r\n\r\nDrie hartsvriendinnen proberen hun drukke carrières zo goed mogelijk te combineren met hun turbulente privélevens. Het glamourleven van de powervrouwen in de hoofdstad gaat echter niet altijd over rozen. Hanna (Sarah Chronis) staat aan het roer van een modelabel, maar haar laatste modecollectie flopt. Het lukt haar ook maar niet om de ware te vinden, of maakt haar nieuwe date, miljardair Gijs (Nasrdin Dchar), hier een einde aan? Wendy (Fockeline Ouwerkerk) is de baas van een grote tv-zender en haar huwelijk met muzikant Steven (Cas Jansen), huisvader tegen wil en dank, loopt nogal stroef. Gelukkig heeft ze op haar werk collega Sil (Manuel Broekman) die haar op zijn eigen wijze steunt, maar ook uitdaagt. Nico (Kim Pieters) is hoofdredacteur bij een toonaangevend tijdschrift en verliest zich in een affaire met de jonge fotograaf Hugo (Kay Greidanus), waardoor ze haar huwelijk en reputatie op het spel zet. En dan moet ze ook nog dagelijks dealen met haar collega Jorrit (Oscar Aerts), die niet per se het beste met haar voor heeft. De steun van de drie vriendinnen aan elkaar en liefdevolle en humoristische eerlijkheid helpt hen in balans te blijven tijdens lastige tijden in hun snelle bestaan","torrent":{"xt":"urn:btih:7c1738b5beaeff9d869653dbb99796c4b82942b6","amp;dn":"Meiden+van+de+Herengracht+S01E01+-+S01E06+HDTV+x264+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c1738b5beaeff9d869653dbb99796c4b82942b6","infoHashBuffer":{"type":"Buffer","data":[124,23,56,181,190,174,255,157,134,150,83,219,185,151,150,196,184,41,66,182]},"announce":[],"urlList":[]}}