{"title":"Sketch Tales - Early Access","uid":12509114,"size":562236539,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7fa594535a31111c245b8b0d03df5ed4dab6bb0e&amp;dn=Sketch+Tales+-+Early+Access&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1443498336,"description":"\nAbout This Game\r\nWhat is Sketch Tales?\r\nSketch Tales is an immersive action-RPG sandbox where what you draw becomes what you play. You appear in a hand-drawn world, wherefrom all the colors had been stolen by a supervillain warlock. Get revenge on him, join him or ignore him – you have all the options for both gameplay and story are non-linear.\r\nWhat can I do there?\r\nThe game has action RPG mechanics (with quests, dungeons, loot and weapons) that are based on drawing gameplay: your own artistic creations drive the world, which provides freedom of choice and stimulates creativity. With drawing you can create ingame items, weapons, spells, construction parts, living beings and much more. For instance, you could draw a monster within mere seconds and get him instantly live in the game.\r\nKey Features:\r\nIn Early Access now:\r\n\r\n    Drawing magic: create anything and change the game world with doodling;\r\n    No sweat fun: zero artistic skills required to get instant fun;\r\n    Freedom of choice: create a fully unique character and chose any path for him;\r\n    Show your true colors: fight enemies, avoid deadly traps and magic anomalies.\r\n\r\n    Will be added with upcoming updates:\r\n    Paint the town red: invite your friends into the world you created, explore together or fight each other, exchange your creations with other players.\r\n    Living universe: huge open world with deep atmosphere and random events. AI life simulation system gives each NPC unpredictable behavior patterns, desires, needs and emotional connections.\r\n    Law &amp; disorder: Abide by the laws of physics or break them - destructible objects, forces of nature and degradable materials are affected by you and affect the world around you.\r\n    Cross-platforming: Join a game session with your friends while using different platforms.\r\n    Languages: Sketch Tales will speak to you in your mother tongue","torrent":{"xt":"urn:btih:7fa594535a31111c245b8b0d03df5ed4dab6bb0e","amp;dn":"Sketch+Tales+-+Early+Access","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fa594535a31111c245b8b0d03df5ed4dab6bb0e","infoHashBuffer":{"type":"Buffer","data":[127,165,148,83,90,49,17,28,36,91,139,13,3,223,94,212,218,182,187,14]},"announce":[],"urlList":[]}}