{"title":"Orange Is The New Black 3x11 [HDTv Ac3 Cas] By JBilbo","uid":12493902,"size":723390464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:800f5e3e867dbfc2907bf2deddbfbbbd9cf32777&amp;dn=Orange+Is+The+New+Black+3x11+%5BHDTv+Ac3+Cas%5D+By+JBilbo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JBilbo","files":1,"time":1443224612,"description":"Título original    Orange Is the New Black (TV Series)\r\n\r\nAño    2013\r\n\r\nDuración    60 min.\r\n\r\nPaís    [Estados Unidos]  Estados Unidos\r\n\r\nDirector    Jenji Kohan (Creator), Michael Trim, Andrew McCarthy, Phil Abraham, Uta Briesewitz, Jodie Foster, Constantine Makris, Matthew Penn\r\n\r\nGuión    Piper Kerman, Jenji Kohan, Sian Heder, Sara Hess, Nick Jones, Lauren Morelli, Marco Ramirez, Liz Friedman, Tara Herrmann, Gary Lennon\r\n\r\nFotografía    Vanja Cernjul\r\n\r\nReparto    Taylor Schilling, Laura Prepon, Danielle Brooks, Taryn Manning, Laverne Cox, Michael Harney, Uzo Aduba, Michelle Hurst, Kate Mulgrew, Jason Biggs, Natasha Lyonne, Pablo Schreiber, Nick Sandow, Dascha Polanco, Joel Garland, Lea DeLaria, Samira Wiley, Matt McGorry, Yael Stone, Catherine Curtin, Ruby Rose, Jackie Cruz, Adrienne C. Moore, Emma Myles, Annie Golden, Diane Guerrero, Jessica Pimentel, Elizabeth Rodriguez, Abigail Savage, Kimiko Glenn, Selenis Leyva, Matt Peters, Alysia Reiner\r\n\r\nProductora    Netflix / Lionsgate Television\r\n\r\nGénero    Serie de TV. Drama. Comedia | Drama carcelario. Homosexualidad. Basado en hechos reales. Comedia dramática\r\n\r\nWeb oficial    http://movies.netflix.com/Movie/70242311\r\n\r\n\r\n\r\nSinopsis    Serie de TV (2013-Actualidad). Piper Chapman (Taylor Schiling), una mujer de Connecticut con una vida estable y un alto cargo ejecutivo, es detenida a raíz de un delito de drogas que cometió hace una década: en aquellos días llevó un maletín con droga para Alex Vause (Laura Prepon), una traficante y antigua amante de Piper. Tras el juicio, es enviada a prisión de mujeres en Litchfield, Nueva York. Basada en las vivencias reales de Kerman, cuya experiencia entre rejas le sirvió para escribir el best-seller autobiográfico 'Orange Is The New Black: My Year In A Women's Prison'. A medio camino entre el drama y la comedia, una aclamada serie -fue una de las que mejor críticas obtuvo en su primera temporada en el 2013- que aborda temas relacionados con la cárcel como el sistema penitenciario norteamericano, el lesbianismo, la represión sexual, el abuso de poder o la corrupción policial. (FILMAFFINITY)","torrent":{"xt":"urn:btih:800f5e3e867dbfc2907bf2deddbfbbbd9cf32777","amp;dn":"Orange+Is+The+New+Black+3x11+%5BHDTv+Ac3+Cas%5D+By+JBilbo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"800f5e3e867dbfc2907bf2deddbfbbbd9cf32777","infoHashBuffer":{"type":"Buffer","data":[128,15,94,62,134,125,191,194,144,123,242,222,221,191,187,189,156,243,39,119]},"announce":[],"urlList":[]}}