{"title":"Why the World Does Not Exist","uid":12329764,"size":1228165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:803c03d3051056a1053d5107162a0e114f636c93&amp;dn=Why+the+World+Does+Not+Exist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mdusanjay","files":1,"time":1441165121,"description":"Why the World Does Not Exist by Markus Gabriel\n\nOverview: Where do we come from? Are we merely a cluster of elementary particles in a gigantic world receptacle? And what does it all mean?\n\nIn this highly original new book, the philosopher Markus Gabriel challenges our notion of what exists and what it means to exist. He questions the idea that there is a world that encompasses everything like a container life, the universe, and everything else. This all-inclusive being does not exist and cannot exist. For the world itself is not found in the world. And even when we think about the world, the world about which we think is obviously not identical with the world in which we think. For, as we are thinking about the world, this is only a very small event in the world. Besides this, there are still innumerable other objects and events: rain showers, toothaches and the World Cup. Drawing on the recent history of philosophy, Gabriel asserts that the world cannot exist at all, because it is not found in the world. Yet with the exception of the world, everything else exists; even unicorns on the far side of the moon wearing police uniforms","torrent":{"xt":"urn:btih:803c03d3051056a1053d5107162a0e114f636c93","amp;dn":"Why+the+World+Does+Not+Exist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803c03d3051056a1053d5107162a0e114f636c93","infoHashBuffer":{"type":"Buffer","data":[128,60,3,211,5,16,86,161,5,61,81,7,22,42,14,17,79,99,108,147]},"announce":[],"urlList":[]}}