{"title":"Left Of The Dial","uid":5301126,"size":1437016200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8044f8e1891588c382be1cdf6cf304f9d8b055bb&amp;dn=Left+Of+The+Dial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubusdemonoid","files":-1,"time":1264230252,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 50 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nLeft Of The Dial - The Rise of America's First All-liberal Talk Radio Network\n\nFrom AllMovie:\nExperience the turbulent rise of America's first all-liberal radio network firsthand as documentary filmmakers Patrick Farrelly and Kate O'Callaghan follow the progression of Air America Radio from conception to the airwaves through interviews with such key figures as Al Franken, Randi Rhodes, Mark Walsh, and Evan Cohen. When a group of investors chose to challenge the conservative standards of talk radio by launching a liberal radio network in early 2004, few could see the monumental struggles that lay ahead. Despite the financial, creative, and logistical challenges that nearly sunk the entire endeavor, Air America Radio beat the odds by going live on March 31, 2004. As the presidential race between George W. Bush and John Kerry heated up, the struggle to sustain Air America Radio in the middle of a political firestorm gave testament to the tenacity and undying vision of those willing to put their livelihood on the line to ensure the public a quality alternative to the conservative viewpoints of such outspoken Republican media figures as Rush Limbaugh and Bill O&quot;Reilly.\nFeatures\n\n* Audio commentaries with Randi Rhodes, Marc Maron and with filmmakers Patrick Farrelly and Kate O'Callaghan\n* Deleted scenes, including an appearance by Tim Robbins, a stand-up performance by Marc Maron and an exclusive interview with Randi Rhodes and Janeane Garofalo\n\n\nMake SURE you listen to the second audio file included within the video file - the Marc Maron and Randi Rhodes commentary. They are HILARIOUS together!!!!\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8044f8e1891588c382be1cdf6cf304f9d8b055bb","amp;dn":"Left+Of+The+Dial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8044f8e1891588c382be1cdf6cf304f9d8b055bb","infoHashBuffer":{"type":"Buffer","data":[128,68,248,225,137,21,136,195,130,190,28,223,108,243,4,249,216,176,85,187]},"announce":[],"urlList":[]}}