{"title":"Jogajog-HEVC-DDR","uid":12500935,"size":739169495,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8059366dbe03272cf40f6c5ef3f02ed7ffae7936&amp;dn=Jogajog-HEVC-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":1,"time":1443363606,"description":"DDR Presents\r\n\r\n\r\nJogajog(2015)\r\n(A film by Sekhar Das based on a Story by Rabindranath Tagore)\r\n\r\nBangla - WEBHD rip - 720x304p (2.35:1)- 705 MB - x.265.AAC (2 Ch) - 2 Hrs:17 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/dwx \nhttp://extraimago.com/image/dw6 \nhttp://extraimago.com/image/dwu \nhttp://extraimago.com/image/dwW \nhttp://extraimago.com/image/dwf \nhttp://extraimago.com/image/dwf \nhttp://extraimago.com/image/d28 \nhttp://extraimago.com/image/d2a \nhttp://extraimago.com/image/d2w\r\n\r\nTech Specifications: \r\n \nhttp://extraimago.com/image/d2W\r\n\r\nSynopsis:\r\nThe Chatterjees and the Ghoshals have a feud running into generations. Once upon a time, the Chatterjees forced the Ghoshals out of their native village, but times have changed, and the aristocratic Chatterjees have fallen into difficult times. They are deep in debt to Madhusudan Ghoshal and are forced by circumstances to marry their daughter Kumudini to him, even though she is much younger to him.\r\n\r\nKumudini, a devout girl, goes to her husband's house, determined to make the best of the circumstances, but is repelled by his coarseness and by his flaunting of his wealth. Her dislike grows, as he openly flaunts his mistress, shyama to her face. The last straw is when he forces himself upon her. She can take it no longer and leaves him to return to her brother's home.\r\n\r\nBut she is still not free of him, for she learns that she is pregnant with his child. The world now tells her that her place is in her husband's home, much against her desire to be free. Yet, Madhusudan too has changed. When Shyama leaves him, he realises that he needs Kumudini and asks he to come back..\r\n\r\nComments:\r\nTagore set this novel in the 1870's. Shekhar Das brings it to 1970. Despite the universality of Tagore's messages, this transition makes it hard to place the events in proper perspective. Women were not as oppressed in the 1970's as a century earlier. There were new opportunities opening up and the legal protection was much much more. It may not be modern times, but Kumudini of 1970 could never be the Kumudini of 1870. And that is where the screenplay falls flat. The attitudes of Madhusudan, of Kumudini, her sisters-in-laws and almost everyone else are those of a past era. By the 70's, the be all and end all of women had ceased to be her marriage. Women had started to gain independence. Kumudini's rebellion would not be an earth shaking event, even if it were not something passe.. Also the story of old world graciousness and nouveau riche had also started to lose its sharp dividing lines. Bengali society was still in transition, but the focus had changed. What remained is Tagore's concern for the role of women in society and his protest against marital rape and these are concerns that are reflected in Sekhar Das' film as well.\r\n\r\nHaving said that, there are some fine performances. Bratya Basu as Madhusudan is naturally obnoxious, Subhalagna as Kumudini is wooden in the beginning, but as the movie progresses she comes into her own. Locket Chatterjee excels as usual in a supporting role. Saheb Chatterjee does well as the dominated young brother. But, of all the actors, my pick would be Anannya Chatterjee as Shyama Sundari. She portrays a variety of emotions. Sometimes sultry, often amoral but very vulnerable. He jealousy is partly motivated by her uncertainty. Its really a masterful portrayal.\r\n\r\nDebojyoti Bose has given us some very musical bhajans from Meera and Chandidas. I thought the film was a bit too long and needed some more firm editing. Indraneel Mukherjee's camera work is a pleasure to behold.\r\n\r\n\r\nUploader's Notes:\r\nThis rip is a downsizing from an original web cast of 1080p. The source was good, but you will like the way in which detail has been enhanced. I have also muted the garish colouring of the original a bit. The HEVC encoding helped in compressing the video into just 1 CD and yet enhancing detail.\r\n\r\nBe aware that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link:\r\n \nhttp://www.imdb.com/title/tt4416012","torrent":{"xt":"urn:btih:8059366dbe03272cf40f6c5ef3f02ed7ffae7936","amp;dn":"Jogajog-HEVC-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8059366dbe03272cf40f6c5ef3f02ed7ffae7936","infoHashBuffer":{"type":"Buffer","data":[128,89,54,109,190,3,39,44,244,15,108,94,243,240,46,215,255,174,121,54]},"announce":[],"urlList":[]}}