{"title":"Magellan Roadmate 1.10 US &amp; CAN IPA TGCLEADER","uid":5286432,"size":1455238470,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:817b7bcbeb6483c6e2a3b70430c9468ccfbba7ea&amp;dn=Magellan+Roadmate+1.10+US+%26+CAN+IPA+TGCLEADER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tgcleader","files":1,"time":1263740852,"description":"                                     TGCLEADER\n\n     *******************Magellan Roadmate US &amp; CANADA 1.10 IPA ******************* \n\nFor iPhone 3G and 3GS only. (not 2G) or iPod Touch Second Generation only. (not orignal iPod Touch)\n\nThis includes all the files and tools to get Magellan Roadmate 1.10 to run correctly including: WinSCP, My Modified Info.plist so that you dont get the resolution error and how to stnc the Magellan Roadmate 1.10 app to your iPhone/iPod Touch without getting an error. Just follow the instructions below or the rar file inclused the same instructions.\n\nThe RoadMate for iPhone application includes a number of new features in version 1.10. Most significant among them\nis compatibility with the second-generation iPod Touch. Also new is customizable speed warnings and \nmulti-destination routing, Find My Car in the OneTouch menu, a variety of UI enhancements, and more.\n\nTo get what all of the new features are go to the app store and review the features on the Magellan app.\n\n\n\n\n***BEFORE CONTINUING YOU MUST HAVE A JAILBROKEN IPHONE OR IPOD TOUCH FOR IPOD TOUCH IT MUST BE SECOND GENERATION \nAND FOR IPHONE USERS IT ONLY WORKS ON 3G AND 3GS NOT 2G***\n\n\n\nHOW TO ADD THE MAGELLAN APP TO YOUR IPHONE/IPOD TOUCH \n\n(NOTE: IF YOU ALREAD HAVE YOUR PHONE PATCHED TO \nALLOW PIRATED APPS ON YOUR IPHONE/IPOD TOUCH YOU CAN SKIP TO STEP 12.) \n\nALSO IF YOU HAVE MAGELLAN INSTALLED ON \nYOUR IPHONE/IPOD TOUCH AND YOU ARE GETTING A RESOLUTION ERROR YOU NEED TO FOLLOW INSTRUCTIONS BELOW AFTER STEP 14.\n\n1. Go to Cydia.\n\n2. Go to manage tab.\n\n3. Go to sources.\n\n4. Click on edit.\n\n5. Click on add.\n\n6. Type ''http://cydia.hackulo.us'' (without quotes) and click add source\n\n7. It will pop up a message saying that the app is know for copyright infringement but just click continue anyways.\n\n8.once the source has been added go to the search tab.\n\n9. Type in ''AppSync'' (without quotes)\n\n10. Install AppSync.\n\n11. Once installed reset your iPhone/ iPod Touch.\n\n12. Extract the folder Winrar to the destination you can easly find the fokder and once done go in to the folder.\n\n13. Open up iTunes and drag the Magellan Roadmate 1.10 app to the applications folder or if you dont have any app in ituse there \nwont be an applications folder  so just drag ove the Magellan app. If you already have the previous version of\nMagellan in iTunes just drag it over and it will tell you that you already have the app and if you want to replace\nand just replace it.\n\n14. Plug in your iPhone/iPod Touch and sync it. If you have a previous version installed on your iphone/iPod Touch\nyou still need to sync your device so that it can update to the newest version so that you have the latest\nfeatures. \n\n********************HOW TO FIX THE RESOLUTION ERROR FOR MAGELLAN SO THAT IT WORKS********************\n\nMAKE SURE YOUR IPHONE/IPOD TOUCH HAS OPENSSH. IF IT DOESNT GO TO CYDIA AND SEARCH FOR OPENSSH AND INSTALL IT. \nALSO MAKE SURE YOU HAVE A WIRELESS NETWORK YOU CAN CONNECT TO AND THAT YOUR IPHONE/IPOD TOUCH AND YOUR PC IS\nCONNECTED TO THE SAME WIRELESS NETWORK.\n\n\n1. Install WinSCP.\n\n2. On your iPhone/iPod Touch go to settings.\n\n3. Turn on Wifi.\n\n4, Connect to a wireless network thats available.\n\n5. Once connected click on the blue arrow icon next to the network your connected to.\n\n6. Keep now of the IP address your connected to.\n\n7. Run WinSCP.\n\n8, In the host name field put in the IP address your connect to.\n\n9. In the username field put in ''root''(without quotes).\n\n10. In the password field enter ''alpine'' (without quotes).\n\nNOTE: if its not connecting then at some point of having OpenSSH you have changed your username and password or\nyour wifi network isnt connected to the internet.\n\n11. Go to the right side and click the drop down directory list and click /.\n\n12. Go to ''Private'' folder.\n\n13. ''Var'' folder.\n\n14. ''mobile'' folder.\n\n15. ''Applications '' folder.\n\n16. Now you need to find the Magellan app folder and since the folders are named letters and numbers it might be\ndifficult to find it. So the easiest way to find it is at the top of the window click changed so that it organizes\nthe folders by date and if your last app you added was the Magellan app then it will be the top folder.\n\n17. Now that you are in the folder you will see ''Roademate.app''folder click that and go into the folder.\n\n18. Now look for ''Info.plist'' select that and delete it.\n\n19. Now on the left window go to the directory of where you downloaded my torrent file and drag my modified \n''Info.plist'' into the left window in the ''Roadmate/app'' folder/\n\n20. Thats It enjoy.\n\nPlease Seed!!!!!!","torrent":{"xt":"urn:btih:817b7bcbeb6483c6e2a3b70430c9468ccfbba7ea","amp;dn":"Magellan+Roadmate+1.10+US+%26+CAN+IPA+TGCLEADER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"817b7bcbeb6483c6e2a3b70430c9468ccfbba7ea","infoHashBuffer":{"type":"Buffer","data":[129,123,123,203,235,100,131,198,226,163,183,4,48,201,70,140,207,187,167,234]},"announce":[],"urlList":[]}}