{"title":"Fags, Mags And Bags - S01 to 05 - Audio Sitcom - MP3 - Slimoo","uid":12356725,"size":802591537,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:82f2497f324c04b05760e553bc4dc369c79a3fd7&amp;dn=Fags%2C+Mags+And+Bags+-+S01+to+05+-+Audio+Sitcom+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":30,"time":1441484187,"description":"Fags, Mags And Bags - Audio Comedy - 128Kbps - Mp3 - Slimoo\n\n\n\n\nSitcom written by and starring Sanjeev Kohli and Donald McLeary, set in a Glasgow corner shop.\n\nThe staff of Fags, Mags and Bags are tireless in their quest to bring nice-price custard creams and cans of coke with Arabic writing on them to an ungrateful nation.\n\nwww.comedy.co.uk Review: \n[quote]A fairly middle-of-the-road Scottish radio sitcom. Fags, Mags &amp; Bags has some amusing moments, but if you missed an episode it's probably not something you'd cry about. That said, as the series have progressed, we have started to love this show as we get to know the upbeat characters a bit more...[/quote]\n\n\nCast:\nSanjeev Kohli\nDonald McLeary\nOmar Raza\nSusheel Kumar\nGerard Kelly\nKayvan Novak\nGavin Mitchell\nDonald Cameron\n\n  &lt;a href=&quot;\nhttp://www.comedy.co.uk/guide/radio/fags_mags_and_bags/episodes/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.comedy.co.uk/guide/radio/fags_mags_and_bags/episodes/&lt;/a&gt;\n\nFags, Mags And Bags - S01 - E01 - Raising Keenan \nFags, Mags And Bags - S01 - E02 - The De-Magowarning Of Ramesh \nFags, Mags And Bags - S01 - E03 - Wall Of Crisps \nFags, Mags And Bags - S01 - E04 - Build The Titanic \nFags, Mags And Bags - S01 - E05 - The Festival Of Maltodextrin \nFags, Mags And Bags - S01 - E06 - January, February \n\nFags, Mags And Bags - S02 - E01 - Beansy, Beansy, Beansy, Beansy, Beansy \nFags, Mags And Bags - S02 - E02 - Skeletor Attack \nFags, Mags And Bags - S02 - E03 - Rameshtonite \nFags, Mags And Bags - S02 - E04 - All The Best \nFags, Mags And Bags - S02 - E05 - Cousin Wacko \nFags, Mags And Bags - S02 - E06 - Confectionary McEnroe \n\nFags, Mags And Bags - S03 - E01 - Jack Black's Black Jacks \nFags, Mags And Bags - S03 - E02 - Mr Majhu Goes To Lenzie \nFags, Mags And Bags - S03 - E03 - The Wrath Of Khan \nFags, Mags And Bags - S03 - E04 - The Lenzie Splicer \nFags, Mags And Bags - S03 - E05 - Bacon Punctuation \nFags, Mags And Bags - S03 - E06 - The Fall Of Phallon And The Rise Of Bugatox \n\nFags, Mags And Bags - S04 - E01 - Sweetie Design Competition\nFags, Mags And Bags - S04 - E02 - Pennywise Empire\nFags, Mags And Bags - S04 - E03 - The Bewerdine Spectrum\nFags, Mags And Bags - S04 - E04 - Evil Narbara\nFags, Mags And Bags - S04 - E05 - Ayabassa Alan\nFags, Mags And Bags - S04 - E06 - Ramesh 50th\n\nFags, Mags And Bags - S05 - E01 - Hovering Chops\nFags, Mags And Bags - S05 - E02 - General Whitesnake Demeanour\nFags, Mags And Bags - S05 - E03 - Effervescent Members\nFags, Mags And Bags - S05 - E04 - Carnaptious Scroosh\nFags, Mags And Bags - S05 - E05 - Turn Around Dave Eyes\nFags, Mags And Bags - S05 - E06 - Meter Reading Chic\n\nAudio Format : MP3\nDuration Approx : 28mn 00s\nBit rate mode : Constant\nBit rate : 128 Kbps \nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:82f2497f324c04b05760e553bc4dc369c79a3fd7","amp;dn":"Fags%2C+Mags+And+Bags+-+S01+to+05+-+Audio+Sitcom+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82f2497f324c04b05760e553bc4dc369c79a3fd7","infoHashBuffer":{"type":"Buffer","data":[130,242,73,127,50,76,4,176,87,96,229,83,188,77,195,105,199,154,63,215]},"announce":[],"urlList":[]}}