{"title":"The Mule Skinner Band - Together Again  2015","uid":12496670,"size":96122214,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:834290a9f4dac56f071aef61897caa1a0d2e3535&amp;dn=The+Mule+Skinner+Band+-+Together+Again++2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RoffeTheCoolMan","files":15,"time":1443281138,"description":"The Mule Skinner Band består av Gert Lengstrand, Håkan Liljeblad, Göran Liljeblad och Bjarne Lundqvist - alltså fyra originalmedlemmar från ett av 60-talets populäraste rock- och popband The Streaplers.\r\n\r\n&quot;Together again&quot; innehåller en härlig mix av gamla och nya godingar och naturligtvis finns deras hits från 60-talet med på plattan. Gruppen har nämligen återinspelat Diggity Doggety, Mule Skinner Blues, Rockin´ Robin och Three Steps To Heaven i den egna studion i Ubbhult. Dessutom finns hyllningen till deras vän och musikerkollega Lasse Larsson som en värdig avslutning och med sång av bandets trummis Bjarne Lundqvist. Lasse som dessvärre gick bort 26 augusti 2004 efter en tids sjukdom.\r\n\r\nText från bandet:\r\n\r\nTack för att Du just köpt vår debutplatta &quot;Together Again&quot;.\r\nDebutplatta är väl en sanning med modifikation eftersom vi spelat in plattor sedan 1960. Men när det gäller Mule Skinner Band så är det faktiskt debut för oss gamla Streaplerslegendarer.\r\n14 spår av nostalgi som vi hoppas ni gillar och har med er i bilen, sommarstugan eller hemma i vardagsrummet. Naturligtvis återfinns våra Tio i Topp-hits från det glada 60-talet men också några nya låtar. Dessutom har vi spelat in en speciell hyllning till allas vår Lasse Larsson som dessvärre lämnade oss den 26 augusti 2004 efter en tids sjukdom.\r\nKvartetten som sprängdes har nu återuppstått och är alltså tillsammans igen på konsertscener runt om i landet. Cirkeln är sluten och trots att vi egentligen gått i pension är vi fortfarande still going strong. Och det har vi tänkt fortsätta med i många år till.\r\nEller för att citera Evert Taube; Så länge skutan kan gå, så länge hjärtat kan slå.\r\n//Gert Bjarne Håkan Göran\r\n\r\nLÅTLISTA\r\n\r\n1. Gimme some rock and roll\r\n2. You never can tell\r\n3. Together again\r\n4. Jambalaya\r\n5. Three steps to heaven\r\n6. There's a tear in my beer\r\n7. Rockin' Robin\r\n8. Love me\r\n9. Linda Lou\r\n10. Singing the blues\r\n11. You don't know what you've got\r\n12. Diggity doggety\r\n13. Mule skinner blues\r\n14. Saknar dig","torrent":{"xt":"urn:btih:834290a9f4dac56f071aef61897caa1a0d2e3535","amp;dn":"The+Mule+Skinner+Band+-+Together+Again++2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834290a9f4dac56f071aef61897caa1a0d2e3535","infoHashBuffer":{"type":"Buffer","data":[131,66,144,169,244,218,197,111,7,26,239,97,137,124,170,26,13,46,53,53]},"announce":[],"urlList":[]}}