{"title":"ESET Smart Security v3.0.551.0 Final","uid":5283702,"size":18388992,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:83ec4c123a788310b8529dd8529a882d3ec50037&amp;dn=ESET+Smart+Security+v3.0.551.0+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"d4rkseid","files":1,"time":1263642540,"description":"ESET Smart Security v3.0.551.0 Final\n\nInstall Notes:\n\nUnpack and install\nUse serial info provided in the nfo.!\nEnjoy!!\n\nTested and Working!!\n\n\nDescription:\n\nESET Smart Security is a fully integrated security solution and includes antivirus, anti-spyware, a personal firewall and antispam. While some competitive solutions purport to have similar functionality, ESET has developed a unique approach that provides true and full integration of point security solutions. The key advantage of this approach is that individual protection modules are able to communicate together seamlessly, to create unparalleled synergy to improve the efficiency and effectiveness of protection. Moreover, the integrated architecture guarantees optimal utilization of system resources, so ESET Smart Security continues ESET's well know reputation for providing rock solid security in a small footprint that will not slow down an individual's computer.\n\nESET Smart Security is based on three basic pillars:\n\nESET NOD32 Antivirus + Antispyware\n\nÃ‚Â· This component is in fact an improved version of the award-winning scanning engine of NOD32 Antivirus v2.7. With respect to program's unprecedented scanning speed, the following improvements have been made:\nÃ‚Â· Improved system of cleaning and deleting infiltrations. The antivirus system now intelligently cleans and deletes infiltrations with no need for user interaction.\nÃ‚Â· Computer scan can be run in background in order to use only a part of system resources. Thus scanning will not affect the performance of your computer and you will be able to work on it as usual.\nÃ‚Â· The resident protection supports archive scanning.\nÃ‚Â· Update optimization, smaller update package size than in version 2.7, more effective management and protection of update files against damage.\nÃ‚Â· Email protection for users of Outlook Express.\n\nESET Personal Firewall\n\nÃ‚Â· Firewall monitors all traffic between a protected computer and other computers in the local network and in the Internet. High quality protection is provided by the following functions:\nÃ‚Â· Scanning of application protocols HTTP and POP3 (used for Internet browsing and for retrieving email from servers) for infiltrations.\nÃ‚Â· Checking low-level network communication which helps to avoid many of various remote attacks.\nÃ‚Â· Ability to recognize the character of network connections established by various types of infiltrations and ability to automatically terminate them.\nÃ‚Â· Filtering of incoming and outgoing communication based on user defined rules.\nÃ‚Â· Monitoring changes in executable files.\nÃ‚Â· Interactive and automatic mode. The former enables you to create your own filtering rules, the latter filters all communication automatically.\n\nESET Anti Spam\n\nÃ‚Â· ESET Anti Spam serves to filter unsolicited email, which makes your work with email more effective. The key features of the ESET Anti Spam are:\nÃ‚Â· Support for the RCF email format\nÃ‚Â· Supports several scanning techniques including the combination of Bayesian filter, virus signatures and user defined rules.\nÃ‚Â· Supports the creation of Blacklist and Whitelist.\nÃ‚Â· Integration with the Microsoft Outlook messaging and collaboration client.\nÃ‚Â· Ability to control multiple messages simultaneously.\n\nHere are some key features of &quot;Eset Smart Security&quot;:\n\nÃ‚Â· integrated firewall and antispam module\nÃ‚Â· improved graphical user interface\nÃ‚Â· 2 operating modes for common and advanced users\nÃ‚Â· improved and automatised cleaning\nÃ‚Â· true incremental updates\nÃ‚Â· export / import settings\n\n\n\n","torrent":{"xt":"urn:btih:83ec4c123a788310b8529dd8529a882d3ec50037","amp;dn":"ESET+Smart+Security+v3.0.551.0+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ec4c123a788310b8529dd8529a882d3ec50037","infoHashBuffer":{"type":"Buffer","data":[131,236,76,18,58,120,131,16,184,82,157,216,82,154,136,45,62,197,0,55]},"announce":[],"urlList":[]}}