{"title":"The.Hairy.Bikers-Northern.Exposure-S01E05-North.Sweden-720p","uid":12511612,"size":1067547761,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8789c20c44976ec515ae8bde56e9a11555f23175&amp;dn=The.Hairy.Bikers-Northern.Exposure-S01E05-North.Sweden-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":2,"time":1443568405,"description":"With subtitles - enjoy !! (Resolution 1280x720)\r\n________________________\r\n\r\nNorth Sweden\r\nThe Hairy Bikers' Northern Exposure Episode 5 of 6\r\n\r\nWith thousands of miles under their belts, Dave and Si are delighted to arrive in Sweden, home to some of the world's top chefs and the Nordic cuisine that has put them there. Crossing the Arctic Circle into Lapland, the Bikers get straight back to basics with the Sami people, who have been cooking this way for centuries. They quickly learn that it's all about keeping it local, fresh and simple. The Samis introduce them to the traditional techniques of smoking to cure meat, manufacturing their own hunting knives and fishing to stock up for the coming winter. Inspired by it all, and with some of the best local ingredients at hand, the bikers treat their hosts to a berry and almond rice pudding and put together their own Nordic reindeer and fish dishes before hitting the road. With a hunger to know more about the traditional life of the reindeer herders, the bikers head deep into the wilderness to meet Lars, one the last surviving forest Sami folk. In the true community spirit of Sweden, the boys are also invited to a house-jumping dinner in the village of Voullerim for a feast of local specialities and a cultural introduction to the Swedes. In a country well known for its love of nature and design talent, the boys toast the end of their northern Swedish adventure in the architecturally stunning tree house rooms of the Tree Hotel","torrent":{"xt":"urn:btih:8789c20c44976ec515ae8bde56e9a11555f23175","amp;dn":"The.Hairy.Bikers-Northern.Exposure-S01E05-North.Sweden-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8789c20c44976ec515ae8bde56e9a11555f23175","infoHashBuffer":{"type":"Buffer","data":[135,137,194,12,68,151,110,197,21,174,139,222,86,233,161,21,85,242,49,117]},"announce":[],"urlList":[]}}