{"title":"Jekyll Island: The Truth Behind The Federal Reserve (2013)","uid":12547818,"size":356904226,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:87973a818d802f0f41a4708b685de9300f74b2a3&amp;dn=Jekyll+Island%3A+The+Truth+Behind+The+Federal+Reserve+%282013%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PUEDOS","files":1,"time":1444500894,"description":"\n\r\nJekyll Island: The Truth Behind The Federal Reserve (2013) \r\n\r\nimdb: tt2942444\r\n\r\nThis film is about is the greatest rip-off in history - the very way money and debt are created and controlled. This affects everyone on the planet, and is the basic cause of all of our economic problems today. Until we all recognize this - in every nation - there is nothing any national government does will fix the problem, and all of us will see mounting debts and sinking standards of living. Our children will inherit this mess, and it will get worse every single year. The truth is that depressions are NOT normal. They are contrived. The truth is that nations don't need a national debt. The truth is that nations don't have to borrow. Why would you borrow when you can create the money you need? The truth is that governments generally aren't PRINTING money wildly; governments are BORROWING money wildly. The good news is we CAN fix this. It won't take a war or a revolution; it only takes a simple understanding of the problem, and its simple solution. The truth is that ANYONE can understand what's going on. This is not rocket science. The truth is that those who are making money off this rip-off want to keep you confused - confused about the basic facts of what your money is and who creates it.\r\n- Written by William T. Still \r\n\r\nWhat's the problem with the world Economy? It's debt...too much personal debt...too much corporate debit...and most importantly, too much government debt. The good news is that it doesn't need to be this way. Banks don't need to be in control. Governments don't need to borrow. Governments don't need a national debt. This is a relatively recent phenomenon. As long as we allow government borrowing the cancer at the core of all our economic problems, we will never return governments to true democratic republics. They will all be just shams, fakes...appearing to go through the motions of free elections when in reality the big banks have effective control over the democratic process. This means that no government which borrows from banks can ever pass effective legislation","torrent":{"xt":"urn:btih:87973a818d802f0f41a4708b685de9300f74b2a3","amp;dn":"Jekyll+Island%3A+The+Truth+Behind+The+Federal+Reserve+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87973a818d802f0f41a4708b685de9300f74b2a3","infoHashBuffer":{"type":"Buffer","data":[135,151,58,129,141,128,47,15,65,164,112,139,104,93,233,48,15,116,178,163]},"announce":[],"urlList":[]}}