{"title":"Outlaw Star [1080p] [DUAL-AUDIO] [HEVC]","uid":12616368,"size":4507997844,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:88d0176f5d26ace6d655cc2799931f6edf92691d&amp;dn=Outlaw+Star+%5B1080p%5D+%5BDUAL-AUDIO%5D+%5BHEVC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"devlin85","files":38,"time":1445521921,"description":"[DONATIONS FOR CLOUD SEEDING]\r\n\r\nBitcoin Address (BTC): 1L1U4MaYvdVvkcZT3bFnVQzLdyHzXd2HdT\r\nLitecoin Address (LTC): LMrvbumxvFP2KQEGUe3LwRwEY4ZgFXpRvD\r\nPeercoin Address (PPC): PEfr11jrfxSB6BJtCk18w9EqEbtXPXSsE9\r\n\r\n[SHOW INFO]\r\n\r\nOutlaw Star (æ˜Ÿæ–¹æ­¦ä¾ ã‚¢ã‚¦ãƒˆãƒ­ãƒ¼ã‚¹ã‚¿ãƒ¼ SeihÅ BukyÅ AutorÅ SutÄ, lit. &quot;Outlaw Star: Starward Warrior Knight&quot;) is a seinen manga series written and illustrated by Takehiko ItÅ and his affiliated Morning Star Studio. The series takes place in the &quot;Toward Stars Era&quot; universe in which spacecraft are capable of traveling faster than the speed of light. The plot follows protagonist Gene Starwind and his motley crew of an inherited ship dubbed the &quot;Outlaw Star&quot;, as they search for a legendary, outer space treasure trove called the &quot;Galactic Leyline&quot;.\r\n\r\n[PLOT - SPOILER ALERT]\r\n\r\nOutlaw Star is a space opera/Space Western set in the fictional &quot;Towards Stars Era&quot; (åˆ°æ˜Ÿæ­´ TÅseireki) universe. During its past, an asteroid containing a material known as &quot;dragonite&quot; crashed in the fictional Arashon desert of northern China. Scientists found that the dragonite contained properties related to &quot;ether&quot;, an energy source that would allow spacecraft to travel faster than the speed of light, and thus traverse large distances of the universe in a short time. As new colonies were formed throughout the vast reaches of outer space, pirates, assassins, and outlaws began to threaten humanity's new frontier. To create order, the Earth Federation established four empires: USSA, Einhorn, Piotr, and Tenpa. However, internal power struggles within the factions and conflicts amongst one another become abundant, leading to inevitable lawlessness. The storyline starts shortly after an infamous outlaw named &quot;Hot Ice&quot; Hilda flees from the Kei Pirates, a branch of the Tin'Pa. Hilda has stolen from them a highly-advanced prototype ship dubbed the XGP15A-II and a suitcase containing a bio-android called Melfina, the only being capable of interfacing with the ship.\r\n\r\nOutlaw Star opens on the backwater planet Sentinel III, on which the protagonist Gene Starwind and his 11-year-old business associate James &quot;Jim&quot; Hawking run a small jack-of-all-trades business. After the two take a job as bodyguards for a disguised Hilda and engage in a brief skirmish with the Kei Pirates, Gene and Jim find themselves the owners of the XGP15A-II (which they nickname the &quot;Outlaw Star&quot;) and the caretakers of Melfina. Hilda reveals that the ship's true purpose is to locate the &quot;Galactic Leyline&quot; (éŠ€æ²³ã®é¾è„ˆ Ginga no RyÅ« Myaku, lit. &quot;Galactic Dragon Vein&quot;), a place which popular claims say is a holder of immense treasure, knowledge, and power. Throughout the course of the series, the crew grows to include the kimono-garbed contract killer &quot;Twilight&quot; Suzuka and the Ctarl-Ctarl alien catgirl Aisha Clanclan.\r\n\r\nThe Outlaw Star manga series and animated television series are paced differently than one another. The anime episodes often involve Gene and his comrades taking on various jobs or missions to fund their ship's massive maintenance costs. Throughout their travels, the crew often encounters Ronald MacDougall and Harry MacDougall, a pair of bounty hunters responsible for the death of Gene's father. Ronald acts as a rival to Gene, while Harry wishes to form a bond with Melfina, a bio-android like himself. The crew also contends with others that learn of the Outlaw Star's connection to the Galactic Leyline. They are Nguyen Khan, a scientist wishing to gain omniscience through the Leyline; and Lord Hazanko, the leader of the ruthless assassin organization the Anten Seven that seek the Leyline to gain ultimate power. The series climaxes when all parties meet on the physical plane of the Leyline. In the end, the MacDougall brothers retreat, Khan is integrated into the Leyline as data, and Hazanko is defeated by the Outlaw Star crewmembers. Once the conflict comes to a close, Gene and his friends go their separate ways but ultimately reunite to continue their adventures together.\r\n\r\n[TECHNICAL DETAILS]\r\n\r\nSource: BD / Torrent: [CBM] Outlaw Star 1-26 Compl...dio) [BDRip-1080p-8bit-FLAC]\r\n\r\n\r\nFile Container: MKV\r\nVideo Format: h.265/HEVC [8-bit]\r\nVideo Resolution: 1920x1080\r\n\r\nAudio Type: 2 Channel Stereo\r\nTrack 1: English\r\nTrack 2: Japanese\r\nAudio Format: AAC-LC\r\n\r\nSubtitle Language: English\r\nSubtitle Format: SSA","torrent":{"xt":"urn:btih:88d0176f5d26ace6d655cc2799931f6edf92691d","amp;dn":"Outlaw+Star+%5B1080p%5D+%5BDUAL-AUDIO%5D+%5BHEVC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88d0176f5d26ace6d655cc2799931f6edf92691d","infoHashBuffer":{"type":"Buffer","data":[136,208,23,111,93,38,172,230,214,85,204,39,153,147,31,110,223,146,105,29]},"announce":[],"urlList":[]}}