{"title":"WireShare v5.6.4.3 for Windows 10 Wire Share (LPT) Limwire Lime","uid":12367687,"size":22814680,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b187062cb41035f2daa3fb9ae144688b6179da0&amp;dn=WireShare+v5.6.4.3+for+Windows+10+Wire+Share+%28LPT%29+Limwire+Lime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1441623508,"description":"LimeWire(A.K.A WireShare v5.6.4.3)and the Gnutella Network are still alive and well!  Just follow every detail of the enclosed instructions and this P.E. version of LimeWire is fully functional!  Just two small work around issues.  1)If you try to change the program's download location then it will freeze but any downloads will always be safe in the default directory of your My Documents folder, which is just as good as anywhere else.  This Limewire P.E. works on both Windows 7,8,and 10 as long as all the included directions(the two files in .rtf/rich text format)are followed in full detail. If you have Windows 8 or 10 then make sure you carefully examine the dark blue block banner that somewhat hides bypass options for Microsoft's live security screening.  2)On rare occasions you may need to exit the program at the system tray and restart it to get connected (the system tray is the tiny spot on the bottom/right of the taskbar and different from the close button on the top/right corner of the Limewire window).  Also, ignore any display of being disconnected that may show anywhere on the face of the program.  Do a song or video search and when the results come up then you know you are connected to the network.  Anyone using this will be amazed by the quality and amount of music that is there!\n\nWireShare 5.6.3 which is an upgrade from LimeWire Pirate Edition 5.6.2 has been released. Download links to LPE versions &amp; WireShare can all be found here http://www.gnutellaforums.com/getting-started-using-limewire/97321-limewire-pirate-edition.html Details within the link. Updates will be coming. ;) \n\n\nSimply run this WireShare.exe file and appreciate all the ongoing efforts of the many Gnutella Network volunteers. :)","torrent":{"xt":"urn:btih:8b187062cb41035f2daa3fb9ae144688b6179da0","amp;dn":"WireShare+v5.6.4.3+for+Windows+10+Wire+Share+%28LPT%29+Limwire+Lime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b187062cb41035f2daa3fb9ae144688b6179da0","infoHashBuffer":{"type":"Buffer","data":[139,24,112,98,203,65,3,95,45,170,63,185,174,20,70,136,182,23,157,160]},"announce":[],"urlList":[]}}