{"title":"TextPipe Pro 9.7.3 (Local install + Portable)","uid":12555723,"size":22166962,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8c82b00893f7882a4c69cc171293dd18c3b00973&amp;dn=TextPipe+Pro+9.7.3+%28Local+install+%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jovo_bih","files":1,"time":1444629346,"description":"*********************************************\r\nTextPipe Pro 9.7.3 (Local install + Portable)\r\n*********************************************\r\n\r\nTextPipe is a multi-award winning, industrial strength text transformation, conversion, cleansing and extraction workbench.\r\n\r\nWith TextPipe you specify all your text processing functions in one place, rather than remembering and managing multiple manual jobs across various text editors, command line tools, custom scripts and Word and Excel macros. \r\n\r\n********\r\nFeatures\r\n********\r\n\r\nTextPipe makes it fast and easy to convert, transform and re-purpose data in text files, including\r\n\r\n- HTML, XML and other structured documents from the WWW\r\n- Fixed length or delimited files (CSV, Tab, Pipe, etc)\r\n- Unix, Mainframe and PC/Windows end-of-line formats - watch video\r\n- Inside Zip files, and Microsoft Office 2007/2010 Word (DOCX), Excel (XLSX), PowerPoint (PPTX), OpenOffice Writer (ODT), Calc (ODS) and Impress (ODP) formats\r\n- ASCII, ANSI, Unicode and EBCDIC files\r\n- Security log files from firewalls, web servers etc\r\n- EDIFACT, HL7, SWIFT and other structured formats\r\n- Spooled print files\r\n- Structured and unstructured reports of any size or dimension\r\n\r\n***************************************\r\nSeven Reasons Why TextPipe is different\r\n***************************************\r\n\r\n- TextPipe is exceptionally fast\r\n- TextPipe handles files of unlimited size, from 2 Gigabytes to 2 Petabytes! Other applications attempt to load the entire file into memory (grinding your system to a halt).\r\n- TextPipe's unique restrictions control precisely where changes are made. Restrict to a range of lines or columns, to specific Tab or CSV fields, between HTML/XML tags, and inside custom ranges. Restrictions can be combined, for example, to columns 1-10 of lines matching a pattern. Restrictions are essential for extensive but controlled search and replace\r\n- TextPipe performs multiple operations simultaneously. Other applications offer only 1, up to 5, or require a slow multi-pass approach\r\n- If TextPipe's 100+ filters don't suit your needs, you can use industry standard VBScript/JScript to write your own. Other applications either don't offer this facility, or force you to learn a proprietary language\r\n- TextPipe is unique in offering the EasyPattern pattern matching language for those not familiar with text pattern matching (regular expressions). EasyPatterns are English-like and very easy to learn\r\n- TextPipe can be scheduled for non-interactive use, and can be controlled by an external program. Other applications provide only a mouse interface.\r\n\r\n*********\r\nTechnical\r\n*********\r\nVersion 9.7 – May 29, 2014\r\nSystem requirements: Windows 8 and x64, Windows 7 and x64, Vista, Vista 64, 2012/2008/2003 Server, XP\r\nHomepage: http://www.datamystic.com/textpipe","torrent":{"xt":"urn:btih:8c82b00893f7882a4c69cc171293dd18c3b00973","amp;dn":"TextPipe+Pro+9.7.3+%28Local+install+%2B+Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c82b00893f7882a4c69cc171293dd18c3b00973","infoHashBuffer":{"type":"Buffer","data":[140,130,176,8,147,247,136,42,76,105,204,23,18,147,221,24,195,176,9,115]},"announce":[],"urlList":[]}}