{"title":"King Arthur Collection (GOG)","uid":12596932,"size":11008248866,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8dc5a0a1fafc4d5a84bcd14ccc2924f32a70dba8&amp;dn=King+Arthur+Collection+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mercs215","files":10,"time":1445275577,"description":"Install instructions:\r\n- Run &quot;setup_king_arthur_collection_2.0.0.4.exe&quot;\r\n- Run &quot;setup_king_arthur_fallen_champions_2.0.0.2.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: KING ARTHUR COLLECTION\r\nGenre: Strategy - Role-playing - Fantasy\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Text only: Deutsch (Fallen Champions), English, español (Fallen Champions), français (Fallen Champions)\r\nModes: Single-player - Multi-player\r\nReleased: May 24, 2011\r\nCompany: Neocore Games / Paradox Interactive\r\nRating:\tESRB Rating: Teen (with Alcohol Reference, Blood and Gore, Mild Language, Mild Suggestive Themes, Violence)\r\nStore page: http://www.gog.com/game/king_arthur_collection\r\n\r\nAbout:\r\nKing Arthur Collection includes the following:\r\n- King Arthur - The Role-playing Wargame\r\n- The Saxons expansion\r\n- The Druids expansion\r\n- Knights and Vassals DLC\r\n- Legendary Artifacts DLC\r\n- King Arthur: Fallen Champions standalone expansion\r\nWelcome to the lost age of chivalry, a time of magic and myth where you must rule the land as one of the era’s living legends: Arthur, the son of Uther Pendragon, and the Once and Future King spoken of in prophecy.\r\nFulfill your destiny and claim your rightful place on the throne of Britannia. Send your heroes and their followers to battle legendary warriors and monsters, while saints and faerie folk test their mettle against wizards and evil knights.\r\nReal-time fantasy battles: spectacular fight scenarios on grandiose battlefields, featuring thousands of soldiers and powerful heroes such as Sir Lancelot, Sir Galahad or Merlin. Battles rely on the strengths and weaknesses of the different arms with several tactical possibilities, the abilities of the units and the heroes, monsters and most of all, spells.\r\nTurn-based Campaign Map: Britannia is represented as a fully three dimensional topographic map where heroes move freely, conquer provinces or find adventures. In the turn-based campaign the changing seasons have effect on the gameplay and the graphics of the Campaign Map.\r\nCreate your own legend! The saga of King Arthur is an epic tale about the conquest of Britannia through a story-based campaign. The Campaign is divided into chapters, like a chronicle, each with a unique tone and theme. The chapters all have objectives, long- and short-term goals that also fit together to draw a grandiose picture of an unfolding storyline. There are many possible events and outcomes that all influence the legend itself and determine the ending of the storyline.\r\nMorality Chart: Every decision in the game will influence the position of King Arthur on the Morality Chart. King Arthur might become a Christian ruler or the Follower of the Old Faith; a rightful or a ruthless monarch. These choices unlock special contents, allies, heroes, units and developments.\r\nRPG elements: Heroes lead the armies and learn skills, spells and abilities from an ability tree for experience points. Heroes can also use magic items or become liege lords, entrusted with the leadership of a province, which is the best way to have them indebted. Arranging their marriages with the nice damsels of Arthur’s court also raises their loyalty.\r\nAdventures: adventuring is the essence of King Arthur’s world. Quests pop up on the Campaign Map regularly. In technical terms it is a short story where the chosen knight has to make important decisions. Some adventures end in battles on special battlemaps.\r\n\r\nMinimum system requirements - Windows: Windows XP / Vista / 7 / 8 / 10\r\nProcessor: AMD Athlon 3500+ or Intel Pentium IV 3.4 Ghz\r\nMemory: 1.5GB RAM, Graphics: Nvidia 6600 (256Mb) / ATI Radeon X700 (256Mb)\r\nDirectX®: 9.0c or higher\r\nHard Drive: 8 Gb of free space\r\nSound: DirectX 9-compliant sound card\r\nMouse, Keyboard","torrent":{"xt":"urn:btih:8dc5a0a1fafc4d5a84bcd14ccc2924f32a70dba8","amp;dn":"King+Arthur+Collection+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc5a0a1fafc4d5a84bcd14ccc2924f32a70dba8","infoHashBuffer":{"type":"Buffer","data":[141,197,160,161,250,252,77,90,132,188,209,76,204,41,36,243,42,112,219,168]},"announce":[],"urlList":[]}}