{"title":"[NubileFilms] Roxy James (Love Connection) SD **NEW SEP 28,2015*","uid":12504547,"size":285037523,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8f1fc9d23a335767d68f1972689b8f0ef6e9c375&amp;dn=%5BNubileFilms%5D+Roxy+James+%28Love+Connection%29+SD+%2A%2ANEW+SEP+28%2C2015%2A&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"UniX","files":1,"time":1443431448,"description":"SCREENS;\r\n \nhttp://imgurx.net/share-02CD_5608E6DA.html\r\n\r\n[NubileFilms] Roxy James (Love Connection) SD **NEW SEP 28,2015**\r\n\r\n\r\nSaucy Roxy James is happy to make Kristof Cale's day by waking him from his nap with a kiss and a naughty suggestion whispered in his ear. Kristof is instantly receptive to Roxy's advances, peeling her out of her shirt between kisses and then sliding his hand beneath her thong to enjoy the wetness of her creamy twat before he slides them off.\r\n\r\nGetting Roxy down on her belly, Kristof reaches for the bottle of massage oil that she brought with her and slathers it onto her back and big ass. Gradually Kristof's hand works lower until he has begun to rub Roxy's soft bald pussy. Finding her wet and eager, Kristof takes his time by using both hands and his talented mouth to fill and fondle her tight twat.\r\n\r\nNow that Kristof has ensured that Roxy is dripping wet and ready for him, he pulls off his briefs and presses his member into her tight fuck hole. Although he wants to take things slow for his lover, he soon finds himself slamming in and out of Roxy's warm wetness.\r\n\r\nWhen Roxy flies apart with the ecstasy of her climax, she hops onto her knees and assumes a position of power over Kristof. Using her small hand to steady his big dick, she licks her way around his cock and then takes him between her lips for some deep throat action.\r\n\r\nClimbing onto Kristof's lap, Roxy positions herself so that she can slide down with her love deep inside of her. She and Kristof take turns thrusting their hips so that Roxy is filled and fucked to her heart's content as she moans her enjoyment of her long orgasmic stiffie ride.\r\n\r\nLooking for one more trip to paradise, Roxy gets down on her knees and presses her cheek to the bed to take her man's rock hard love. The loud and proud hottie can't contain her groans of ecstasy for long, and soon her body language tells the story of her climactic joy for the last time.\r\n\r\nIt only takes a few moments with Roxy's fuck hole throbbing around him for Kristof to lose the last of his control. He waits until the last possible moment and then pulls out, covering Roxy's bottom with his hot jizz","torrent":{"xt":"urn:btih:8f1fc9d23a335767d68f1972689b8f0ef6e9c375","amp;dn":"%5BNubileFilms%5D+Roxy+James+%28Love+Connection%29+SD+%2A%2ANEW+SEP+28%2C2015%2A","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f1fc9d23a335767d68f1972689b8f0ef6e9c375","infoHashBuffer":{"type":"Buffer","data":[143,31,201,210,58,51,87,103,214,143,25,114,104,155,143,14,246,233,195,117]},"announce":[],"urlList":[]}}