{"title":"The Punisher","uid":12371533,"size":142330596,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8f5e489c22a6ff429bd2ec515f07fb00cff82bd2&amp;dn=The+Punisher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":22,"time":1441661118,"description":"[img]https://yuq.me/users/15/891/L9jaMzUHQr.jpg[/img]\n\nThe review guy below is so analytical lol All Big Papi can say is this soundtrack is great work-out music. \n\nTime to watch the movie again. This is a classic! This one has surround sound:\n\nThe Punisher 2004 720p BRRip x264 aac vice\n\n- Big Papi\n\n[quote]By A. Estes\n\nIn tradition with the &quot;Daredevil&quot; soundtrack, the &quot;Punisher&quot; soundtrack contains a wide variety of bands and styles of rock. Nineteen tracks deep, this collection does a great job at showcasing some excellent new bands (Strata, Edgewater) and giving some old material new life (Seether &amp; Amy Lee). Obviously, there are some throwaway tracks, just like any soundtrack. The Nickelback &amp; Puddle Of Mudd songs are average at best and not really worth more than one listen, and the new Drowning Pool (Jason Jones replacing deceased singer David Williams) is even more corny than ever before. \n\nBut all is not lost, because some of the best bands out today have put in some of their best new and/or unreleased material. Queens of the Stone Age deliver a superb &quot;Rated-R&quot; b-side 'Never Say Never', while the guys in Damageplan collaborate with Alice In Chains' Jerry Cantrell, creating a song that is better than anything that appears on Damageplan's debut album. \n\nChevelle go a bit darker with their new track &quot;Still Running,&quot; Trapt give us a song that is a little more subtle and textured than what is on their debut album with &quot;Lost In A Portrait&quot; while Smile Empty Soul get acoustic with &quot;Finding Myself,&quot; a song that would fit in just fine with their debut album. Finger Eleven's song &quot;Slow Chemical,&quot; which appeared on some WWF collection a few years ago, sounds better at home here. \n\nSeether make two appearances here, one with a brand new song &quot;Sold Me&quot; and a re-working of &quot;Broken,&quot; which features new string arrangements and guest vocals, courtesy of Evanescence frontwoman Amy Lee (who just happens to be dating Shaun Morgan, singer of Seether). This serves as the highlight of the album. The original version (in my opinion) was the best song from Seether's 'Disclaimer' album and it sounds ever better here. The &quot;fallen&quot; Evanescence guitarist Ben Moody makes a worthy debut with Drowning Pool frontman Jason Jones &amp; Godhead frontman Jason Miller on &quot;The End Has Come,&quot; which bears shades of Evanescence (as fronted by a male) and some classic hard-rock influences.\n\n Strata make their debut here with &quot;Piece By Piece,&quot; I saw them live (with Trapt/Smile Empty Soul/Finger Eleven -- kinda cool how they all appear on this soundtrack) recently and they were incredible for a band who were on their first major tour. Their debut CD (coming July 13th) will definitely be worth checking out. Overall, it's a great CD. I'm sure it will please a lot of people and you definitely get the bang for your buck.[/quote]\n\n\n\n---------------------------------------------------------------------\n VA - The Punisher\n---------------------------------------------------------------------\n\nArtist...............: Various Artists\nAlbum................: The Punisher\nGenre................: Soundtrack\nSource...............: CD\nYear.................: 2004\n\n[b]MP3 V0 (Highest Quality Available For MP3)[/b]\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 273kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n\n---------------------------------------------------------------------\n Tracklisting\n---------------------------------------------------------------------\n\n 1. Drowning Pool - Step Up [03:18]\n 2. Puddle of Mudd - Bleed [03:35]\n 3. Nickelback - Slow Motion [03:32]\n 4. Queens of the Stone Age - Never Say Never [04:24]\n 5. Amy Lee/Amy Lee/Seether/Amy Lee - Broken [04:19]\n 6. Smile Empty Soul - Finding Myself [03:32]\n 7. Trapt - Lost in a Portrait [04:41]\n 8. Chevelle - Still Running [03:11]\n 9. Damageplan/Jerry Cantrell - Ashes to Ashes [05:06]\n 10. Seether - Sold Me [03:40]\n 11. Edgewater - Eyes Wired Shut [03:14]\n 12. Finger Eleven - Slow Chemical [03:18]\n 13. Ben Moody/Jason Jones/Jason Miller/Jones, Jason &quot;Gong&quot; - The End Has Come[03:09]\n 14. Strata - Piece by Piece [03:38]\n 15. Hatebreed - Bound to Violence [02:23]\n 16. Seven Wiser - Sick [03:06]\n 17. Submersed - Complicated [03:08]\n 18. Atomship - Time for People [03:46]\n 19. Mark Collie - In Time [02:45]\n\nPlaying Time.........: 01:07:52\nTotal Size...........: 135.58 MB\n\nNFO generated on.....: 2/1/2015 10:41:37 AM\n\n\n---------------------------------------------------------------------\nWrite anything you want... ;)\n---------------------------------------------------------------------\n\nSoundtracks offer some of THE BEST compilations available in most cases \nPLUS they remind us of really good movies and how those movies affected \nus. Whether it was the story, the actors, or a special date or time with loved \nones. Soundtracks are great to collect.\n\nIf you have a love for soundtracks please leave the torrent in your client so \nthe music can live for other pirates who love soundtracks. These will not get \n100's of seeds like new releases do. That means they will die off without \nyour help.\n\n[b]Thanks for your generous seeding.[/b]\n\nBe sure to search for Big Papi Soundtrack to find error free high quality \nreleases in many cases the only one's available!\n\nRipped using dBpoweramp. The AccurateRip data is \nembedded in each track. \n\nAll Big Papi rips are directly from CD or vinyl unless stated otherwise","torrent":{"xt":"urn:btih:8f5e489c22a6ff429bd2ec515f07fb00cff82bd2","amp;dn":"The+Punisher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f5e489c22a6ff429bd2ec515f07fb00cff82bd2","infoHashBuffer":{"type":"Buffer","data":[143,94,72,156,34,166,255,66,155,210,236,81,95,7,251,0,207,248,43,210]},"announce":[],"urlList":[]}}