{"title":"Creation.LiMiTED.PAL.DVDR","uid":5286996,"size":4636102656,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:912292bcf8e3c0e4846fc39243d094848ed602f7&amp;dn=Creation.LiMiTED.PAL.DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rocking_cat","files":-1,"time":1263757299,"description":"Genre....: Drama, Biography\n\nRuntime..: 104 min\n\nFormat...: DVD5 PAL\n\nAudio....: Dolby Digital 5.1: English \n\nSubtitles: English\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0974014/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0974014/&lt;/a&gt;\n\n\nCreation is a partly biographical, partly fictionalised account of Charles Darwin's relationship with his eldest daughter, Annie, as he struggles to write On the Origin of Species. Produced by Jeremy Thomas, the film was directed by Jon Amiel and stars married couple Paul Bettany and Jennifer Connelly as Charles and Emma Darwin. John Collee wrote the script based on Randal Keynes's biography of Darwin titled Annie's Box.\n\n\nPlot:\nEnglish naturalist Charles Darwin has many children, but is especially fond of his eldest daughter Annie. He teaches her about his evolution theory, and tells her true stories; her favorite story, in spite of the sad ending, is about young orangutan Jenny, who is brought from Borneo to the London Zoo, where she finally dies of pneumonia, in the arms of her keeper. Darwin is furious when he learns that their clergyman has made her crawl on rock salt as punishment for defending her father's theory, which the church opposes.\n\nDarwin visits the town of Malvern for James Manby Gully's water cure therapy, to cure his chronic illness. He has a water tower built in his garden to continue the therapy. When Annie gets seriously ill he takes her in 1851 to Gully to get the water cure too, against his wife Emma's will, but Annie dies anyway, peacefully, after her father, at her request, tells her Jenny's story once more. Darwin is devastated. The film shows her in flashbacks and hallucinations. For a long time Annie's death is a taboo subject to talk about between Darwin and Emma, as Darwin fears that Emma blames him for the girl's death. Later Emma denies this, she has felt guilty herself for not stopping him, and not travelling after them.\n\nHaving returned from his expedition in the Galapagos Islands fifteen years earlier, he is still working on finishing his book On the Origin of Species. The delay is caused by his illness and worry about his relationship with his religious wife, who opposes his theory; she worries that she may go to heaven and he may not, separating them for eternity. Darwin's loss of faith is strengthened by Annie's death.\n\nHis friends Joseph Dalton Hooker and Thomas Henry Huxley encourage him to finish his book, having read his 230 page synopsis. Huxley admiringly tells Darwin that with his theory he has &quot;killed God&quot;, but Darwin is not sure this is a good thing. In his hallucinations, he also feels that Annie disapproves of his procrastination.\n\nTo provide evidence for his theory, Darwin breeds pigeons. Darwin is stopped when he receives a letter from Alfred Russel Wallace in 1855, which details the same findings as Darwin in twenty pages. He has mixed feelings about this: all his work may have been in vain, but on the other hand, as he will not have to write his book, the strife with Emma will dissipate. However, his friends encourage him to continue, his book is much more comprehensive.\n\nHe subsequently visits Malvern again for more therapy and visits the guesthouse where Annie died. Cured of his illness after addressing his grief, Darwin finishes his manuscript and hands it to Emma to read, leaving the decision to publish in her hands. She reads it and packages it to send to the publishers. She accepts that she is an &quot;accomplice&quot; now, but hopes that God will forgive both of them.\n\nDarwin dispatches the manuscript, and it is published on 24 November, 1859.\n\nCast:\nPaul Bettany.......... as Charles Darwin\nJennifer Connelly..... as Emma Darwin \nMartha West........... as Anne Darwin \nJeremy Northam........ as Reverend John Brodie-Innes \nToby Jones............ as Thomas Henry Huxley \nBenedict Cumberbatch...as Joseph Dalton Hooker","torrent":{"xt":"urn:btih:912292bcf8e3c0e4846fc39243d094848ed602f7","amp;dn":"Creation.LiMiTED.PAL.DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912292bcf8e3c0e4846fc39243d094848ed602f7","infoHashBuffer":{"type":"Buffer","data":[145,34,146,188,248,227,192,228,132,111,195,146,67,208,148,132,142,214,2,247]},"announce":[],"urlList":[]}}