{"title":"Spider: Rite of Shrouded Moon v1.0.6","uid":12394901,"size":593471735,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:917b7a63da87aaa1ff910d5c284f9ba4ec69f93f&amp;dn=Spider%3A+Rite+of+Shrouded+Moon+v1.0.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":2,"time":1441938873,"description":"YOU ARE A SPIDER\nSpin webs of your own design to trap insects as you explore a mysterious abandoned mansion. Learn the truth about what happened there and leave the place covered in cobwebs.\n\nREAL TIME, REAL WEATHER\nOnce the sun sets outside your window, it becomes night in the game. When it rains in real life, the rain also falls on Blackbird Estate. Solve cryptic puzzles using the weather and the moon, and encounter rare and beautiful insects that only come out at night. Prepare to be immersed as never before by this unique connection between game and real world.\n\nA STORY OF SPIDER PROPORTIONS\nAn estate built by a secret society for a mysterious purpose. A mad inventor, a brave child, and an adventurer of the high seas. Discover hidden passages and decode secret messages. Slip under floorboards, through keyholes, and up to the rooftops for a spider's perspective on this dramatic tale told without words.\n\nHOURS &amp; MONTHS OF UNIQUE GAMEPLAY\nMaster your web crafting skills with a combination of action and planning. Learn the tricks of dozens of dynamic insects and trap them in your webs before you run out of silk. Explore Blackbird Estate's 30 levels, each of which can be played in day or night, rain or shine,\neach a new combination of gameplay, secrets and collectibles.\n\nCHALLENGE AND DEPTH\nCompete with your friends on Google Play to conquer 30 per-level leaderboards, each requiring a unique strategy. Explore every corner of the estate by rain and moonlight to discover the most rare insects and buried secrets. Unlock 48 achievements and solve 7 enigmatic puzzles with a combination of skill, reflexes, and dedication.\n\nATMOSPHERIC AUDIO &amp; SOUNDTRACK\nHours of music from fantastic indie musicians, with tracks remixed for your Day and Night exploration, and a breathtaking audio landscape from world class sound designers.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.tigerstylegames.spider2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.tigerstylegames.spider2&lt;/a&gt;\n\n\nInstructions:\n\n1.Copy 'com.tigerstylegames.spider2' folder to 'sdcard/Android/obb'\n2.Install APK\n3.Launch the game","torrent":{"xt":"urn:btih:917b7a63da87aaa1ff910d5c284f9ba4ec69f93f","amp;dn":"Spider%3A+Rite+of+Shrouded+Moon+v1.0.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"917b7a63da87aaa1ff910d5c284f9ba4ec69f93f","infoHashBuffer":{"type":"Buffer","data":[145,123,122,99,218,135,170,161,255,145,13,92,40,79,155,164,236,105,249,63]},"announce":[],"urlList":[]}}