{"title":"SandBoxie 5.04 x86 and x64 + working patch","uid":12479867,"size":11187310,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:921b76a814c52875feae68b446ad232100fc4ed6&amp;dn=SandBoxie+5.04+x86+and+x64+%2B+working+patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1443036061,"description":"SandBoxie 5.04 is released on 22 September 2015\n\n\nBrowsing the web, downloading and running applications that may pose security issues require lots of experience and a powerful protection layer to prevent malware from spreading onto a computer. There are, nonetheless, some alternatives that can be exploited even by less experienced useres, like running such potentially dangerous programs in a virtual environment.\n\nRun application in a controlled environment\nInitially developed especially for the Microsoft Internet Explorer, known for it's vulnerabilities, Sandboxie is a utility that is now just as effective for any other software. What it actually does is allow anyone to run apps inside a protected emvironment, that is completely isolatedfrom the actual hard drive space.\n\nPrevents any changes from affecting your system\nInside the 'Sandboxie Control' area will be able to view and manage the programs, start the web browser, email reader or any other application. Also, you have the possibility to run a utility from the 'Start Menu' and open 'Windows Explorer', but remember that while it is inside the sandbox, ni changes will occur to the real files and folders.\nA neat feature of Sandboxie is it's ability to integrate seamlessly with the operating system and it will become available from the righ-click (contect) menu, as well as from the 'Send To' desktop menu.\n\n\nChanges in 5.04:\n\nWindows 10 support up to build 10547\n\nNOTE: Metro applications are not supported at this time. This includes the MS Edge Browser. Ig you tell Sandboxie to start your default browser, and the default browser is Edge, Sandboxie will start IE instead.\n\nWin 10 KB3081455 and Win 8.1 KB3087039 on 9 augustus 2015 that broke Explorer, Skype, Quiktime, VLC Media Player, and possibly other apps has been fixed.\n\nThe print spooler (spoolsv.exe) is now permitted to write files to the system temp folder (windowstemp) and the user temp folder (UsersAppDataLocalTemp)\n\nA bug where some users in Win 8.1+ would not see any printers installed has been fixed.\n\nDeleteVolumeMountPoint security vulnerability has been blocked.\n\nCode was updated to use newer Microsoft SDK/DDK.\n\nFixed several issues with SandboxieRpcSs.exe that could lead to a crash or failure to start","torrent":{"xt":"urn:btih:921b76a814c52875feae68b446ad232100fc4ed6","amp;dn":"SandBoxie+5.04+x86+and+x64+%2B+working+patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"921b76a814c52875feae68b446ad232100fc4ed6","infoHashBuffer":{"type":"Buffer","data":[146,27,118,168,20,197,40,117,254,174,104,180,70,173,35,33,0,252,78,214]},"announce":[],"urlList":[]}}