{"title":"SexuallyBroken - Stunning starlet Aria Alexander blindfolded and","uid":12591682,"size":235809483,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:929fcb2b9d6b54054bdfcce08db6e3043f3e4e9e&amp;dn=SexuallyBroken+-+Stunning+starlet+Aria+Alexander+blindfolded+and&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"EndYou","files":1,"time":1445109446,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/N0 \nhttp://imgpremium.com/image/Nh \r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 2015\r\nCountry: USA\r\nGenre: BDSM, Bondage, Domination, Hardcore, All sex\r\nDuration: 00:20:46\r\n\r\nStarring: Aria Alexander, Matt Williams, Maestro\r\n\r\nToday we happily welcome back the elegant beauty that is Aria Alexander. This one time model drifted has into porn but lost none of her stunning fashion looks. These days what she models is dick. We must admit that she wears it well.\r\nOur blindfolded and shackled slut is marched out and introduced to the dick. She takes to it like a duck to water. Her super short skirt rides up, exposing her perfectly shaved pussy. We have her hike up that short skirt even higher and wiggle that flawless ass as she sucks. We are inspired by the view and add a second dick to the mix, passing her face back and forth like a bobblehead doll.\r\nEnough warm up. We haul her up to her feet, bend her over and stuff her from both ends, turning her into a sex sandwich. The rough fucking makes Aria cum hard, shuddering in her restraints. We can not help up push her even further, and stick her up on our handy fuckbox while binding her wrists to her ankles. The brutal back arch of the hogtie would make most tap out, but not Aria. She deeothroats as we crank up her limbs.\r\nA vibrator is added to the mix, just to be sure that this one is properly broken. The orgasms, relentless fucking and strict bondage does the trick, leaving Aria dazed and gasping. The huge grin dancing across her face shows just how much fun she had. Always a pleasure my dear, we can not wait to have you back!\r\nTags: Ankles tied to Wrists, Black Hair, Blindfold, Blow job, Deep Throat, Drool, Face Fucking, Flexible, Hitachi, Long Hair, Natural Breast, Pale Skin, Rough fucking, Rough Sex, Shaved, Vibrator\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo codec: H.264 / AVC\r\nAudio codec: AAC\r\nVideo: Advanced Video Coding, 960x540, 23.976 fps, 1400 Kbps\r\nAudio: AAC, 2 channels, 44.1 KHz, 124 Kbps","torrent":{"xt":"urn:btih:929fcb2b9d6b54054bdfcce08db6e3043f3e4e9e","amp;dn":"SexuallyBroken+-+Stunning+starlet+Aria+Alexander+blindfolded+and","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"929fcb2b9d6b54054bdfcce08db6e3043f3e4e9e","infoHashBuffer":{"type":"Buffer","data":[146,159,203,43,157,107,84,5,75,223,204,224,141,182,227,4,63,62,78,158]},"announce":[],"urlList":[]}}