{"title":"IQ and Immigration: A Conversation by Molyneux and Richwine","uid":12527605,"size":44739630,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:92b08a1537cd634da361bb78fbd60a26e62e6ffb&amp;dn=IQ+and+Immigration%3A+A+Conversation+by+Molyneux+and+Richwine&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freedomain_radio_torrent","files":1,"time":1444157961,"description":"When the subject of Intelligence (IQ) is discussed in the mainstream media - hysteria and slander from journalists often trumps the available science. Jason Richwine and Stefan Molyneux discuss media controversy in a politically correct culture, the latest science regarding human intelligence, the predictable capabilities of IQ and what this means for the success of immigrants in America and around the world. \r\n\r\nJason Richwine has a Ph.D. in Public Policy from Harvard University and is an analyst and contributor writer for National Review. Dr. Richwine's doctoral dissertation on &quot;IQ and Immigration Policy&quot; was the subject of media controversy in 2013, an can be read in it's entirety at:\n\r\nWith host Stefan Molyneux, topics range from politics to philosophy to science to economics to relationships - and how to achieve real freedom in your life today!\r\n\r\nPowerful ideas for all lovers of personal and political freedom - Freedomain Radio is the largest and most popular philosophy show on the web, and was a Top 10 Finalist in the 2007, 2008 and 2009 Podcast Awards. Topics range from politics to philosophy to science to economics to relationships to atheism - and how to achieve real freedom in your life today. Passionate, articulate, funny and irreverent, Freedomain Radio shines a bold light on old topics, and invents a few new ones to boot!\r\n\r\nFind more FDR Torrents here:      \nhttps://bitlove.org/freedomain_radio_torrent\r\n\r\nDownload podcasts from FDR servers: http://www.fdrpodcasts.com\r\n\r\nFind more information and free audio books: https://freedomainradio.com","torrent":{"xt":"urn:btih:92b08a1537cd634da361bb78fbd60a26e62e6ffb","amp;dn":"IQ+and+Immigration%3A+A+Conversation+by+Molyneux+and+Richwine","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b08a1537cd634da361bb78fbd60a26e62e6ffb","infoHashBuffer":{"type":"Buffer","data":[146,176,138,21,55,205,99,77,163,97,187,120,251,214,10,38,230,46,111,251]},"announce":[],"urlList":[]}}