{"title":"Myspace Playdom Mobsters Tools ~(MBDAPIMP)~","uid":5285897,"size":20695137,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:92d007c6e856b20e69637f466e611d634797ec94&amp;dn=Myspace+Playdom+Mobsters+Tools+%7E%28MBDAPIMP%29%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mbdapimp1985","files":5,"time":1263725175,"description":"This Includes Your Bounty Hunter 4.1 , Helper Bot 1088 , Friend Blaster Pro , 1,000,000,000 Myspace ID'S , AND A LIST OF ALL MY MOBBIES ON ALL MY ACCOUNTS SO GET SOME ADDS !!!! AND ADD ME LOL!!!!   Enjoy and Happy Mobbing!!!!\n\nHELPER BOT MYSPACE VERSION\n\nHelperBot does all the hard work so you don't have too!\n\n** OPTION TO RUN SOFTWARE FOR FREE **\n(terms apply see bottom of page )\n\nAuto returns energy,claims 200, finds top mob ,sends invites,and much more!\n\n* Cycle though all your accounts quickly one by one and do all selected functions\n( only keeps you logged in for a few moments so no risk of being killed while you are away from mobsters )\n\n* Automatically send energy to ALL of your accounts ( will do 20/20 if setup that way with another person!)\n\n* Auto claim 200 energy on ALL of your accounts\n\n* Keep your top 8 ACTIVE at all times while choosing the top 8 rich people for making cash claims on ALL your accounts.\n\n* Automatically send mobster invites on ALL of your accounts (great if you re using fastadds bot!)\n\n*Automatically obtains and installs updates for free!\n\n* Automatically post BC messages from all of your accounts.\n\n*Set cycle time in hours\n\n*Quickly search and delete people from your mob\n\n*patrol poster - automatically post patrol messages to the walls of your mob *upcomming feature in V2000*\n\n* Automatically accept myspace friend requests *upcomming feature in V2000*\n\nPublisher's description of Your Bounty Hunter\n\nYour source for the ultimate mobsters bounty hunter\nThis program was created to automate the process of getting bounties in Myspace Mobsters application. YourBountyHunter doesn't rob use of your mouse or your computer like the others you see available. Has plenty of options available with updates in the works. Currently you set the lowest and highest level you want to attack on the bounty list. Along with setting the minimum bounty your will to attack. YourBountyHunter automatically checks your health and keeps you at max health with out getting charged non emergency fees by the godfather.\n\nAll that's required for you to get started and making mobsters money is logging in with your Myspace email and password. You don't need a special account with good weapons or even a lot of mob members at that. A level one mobster with only 1 mobster with no weapons can expect to make 500 million a day along with between 25 to 50 bounties. If you get bored with it auto attacking you can manually attack in the program it will get the list for you, you can click their name to attack them.\n\nWant to know who you fought and how you did What bounties you got and for how much Well that's covered for you, it logs all fights won, lost and iced. Along with keeping your bounties separated and easy to get to. Tells you how many you've got and money you earned in that session as well. For fun you have the option to comment the people you've fought automatically. Use your own custom message to leave or let it use the fight info. Has equipment buyer built in, to make buying and selling your mob's equiptment painless!\n\nFriend Blaster Pro handles all of the work for you &amp; includes the following key features:\n\nTarget your market based on a members age, sex, geographic location, interests, &amp; more.\n\nGather friend(s) id's from browsing the groups, forums, friend lists, classifieds or any other area of MySpace.\n\nGather friend(s) id's directly from Google!\n\nAuto Messenger allows you to send out messages to all of your friends or to any specified target market.\n\nA new Friend Request feature that allows you to send both a message &amp; a Friend Request at the same time.\n\nAuto Commenter feature that allows you to mass comment all of your friends, quickly &amp; easily.\n\nOption to remove all pending friend request (A great feature when you start to getting a large list of pending friend requests!).\n\nCreate a &quot;Black List&quot; for friend ID's you don't want to send to.\n\nTimed Bulletins feature that gives you full control of &quot;how many&quot; &amp; &quot;when&quot; to send out bulletins.\n\nOur &quot;Accept Friends&quot; feature allows you to accept all pending friend requests &amp; send out a comment or message along with accepting your new friends requests.\n\nInvite all friends to Current Event Feature.\n\nInvite all friends to Current Group Feature.\n\nThe Friend Blaster Pro news bulletin to keep you updated with Friend Blaster news.\n\nFree lifetime product updates, support &amp; technical assistance.\n\nNEW! Multiple registered accounts can now be chained together!\n\nNEW! Set Friend Blaster Pro to auto start (with use of Multiple account Feature).\n\nNEW! Time-delay request feature!\n\nAnd still so much, much more. ","torrent":{"xt":"urn:btih:92d007c6e856b20e69637f466e611d634797ec94","amp;dn":"Myspace+Playdom+Mobsters+Tools+%7E%28MBDAPIMP%29%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d007c6e856b20e69637f466e611d634797ec94","infoHashBuffer":{"type":"Buffer","data":[146,208,7,198,232,86,178,14,105,99,127,70,110,97,29,99,71,151,236,148]},"announce":[],"urlList":[]}}