{"title":"Le Parfum De Manon - Manons Perfume (NEW 2015 Marc Dorcel) [Spli","uid":12523024,"size":1456176631,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:92d4ac21667ddd6f4bb98c3fdba182ad30c2e8de&amp;dn=Le+Parfum+De+Manon+-+Manons+Perfume+%28NEW+2015+Marc+Dorcel%29+%5BSpli&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"UniX","files":6,"time":1443944650,"description":"Le Parfum De Manon - Manons Perfume (NEW 2015 Marc Dorcel) [Split Scenes] WEB-DL\r\n\r\nSCREENS;\r\n \nhttp://imgurx.net/share-1329_5610BC22.html\r\n \nhttp://imgurx.net/share-32AE_5610BC22.html\r\n \nhttp://imgurx.net/share-1EB4_5610BC22.html\r\n \nhttp://imgurx.net/share-A9CB_5610BC22.html\r\n \nhttp://imgurx.net/share-2D55_5610BC22.html\r\n \nhttp://imgurx.net/share-5B39_5610BC22.html\r\n \nhttp://imgurx.net/share-CA60_5610BDA6.html - COVER\r\n\r\nReleased: 2015\r\nCountry: France\r\nDirected by: Pascal Lucas, Herve Bodilis\r\nStudio: Marc Dorcel\r\nGenre: Feature\r\nCast: Anissa Kate, Chloe Lacourt, Manon Martin, Anna Siline, Cecilia De Lys, Lea Guerlin, Mike Angelo, Pascal St. James, Rico Simmons, Josh, Max Casanova, Guillaume Valmer, Kristof Cale, Dean Van Damme\r\nDuration: 114 min.\r\n\r\nDescription in French: Karen et son mari Christophe avaient appris a laisser libre cours a leurs fantasmes. Entre les incroyables orgies mondaines dans lesquelles ils se rendaient regulierement et leurs &quot;jeux&quot; libertins, ils avaient explore ensemble leurs desirs les plus pervers en allant toujours plus loin. Peut-etre meme parfois trop loin ... Mais depuis la disparition de Karen, Christophe n'est plus le meme homme. Les images obsedantes de sublimes creatures s'offrant a plusieurs hommes semblent desormais appartenir a une autre vie. Il tente aujourd'hui de revivre ses frissons d'antan dans les bras de prostituees des quartiers chauds. Mais en vain ... La flamme qui l'animait autrefois n'est plus et il cherche desesperement a la retrouver. Un soir, lors d'une escapade nocturne, Christophe croise le chemin de Manon, une jeune et belle etudiante ressemblant tel une soeur jumelle a Karen. Bouleverse, il ne pense plus qu'a une chose: revivre avec elle ses lointains fantasmes. C'est ainsi que Christophe entraine l'innocente Manon dans un spectaculaire et tres excitant parcours initiatique: aux cotes de riches couples libidineux ou au beau milieu d'inconnus lubriques, des sex shops obscurs et mal fames aux plus luxueuses villas, Manon va vivre de nombreuses experiences au bout desquelles le luxe, la perversion et la jouissance n'attendent plus qu'elle ...\r\n\r\nDescription in English: Karen and her husband Christophe knew how to give free rein to their fantasies. Between the incredible high-society orgies in which they regularly participated and their naughty sex games, they had explored all their most perverse desires by always pushing themselves to the limit - perhaps at times even going too far ... But Christophe has not been the same man since Karen passed away. The haunting images of gorgeous creatures offering themselves to several men now seem to belong to another life. These days, he tries to recapture those old thrills in the arms of prostitutes in red light districts - but all in vain ... The flame that once burnt inside him has been snuffed out and he is desperately attempting to rekindle it. One evening, while out on one of his nocturnal jaunts, Christophe crosses the path of Manon, a beautiful young student so like Karen that she could have been her twin. Bowled over, he now has only one thing on his mind: to relive those distant fantasies with her. Christophe thus lures the innocent Manon on a spectacular and exciting journey of initiation - alongside lustful wealthy couples and amidst lecherous strangers, from dark, disreputable sex shops to the most luxurious villas, Manon will have many experiences after which only luxury, perversion and enjoyment await her","torrent":{"xt":"urn:btih:92d4ac21667ddd6f4bb98c3fdba182ad30c2e8de","amp;dn":"Le+Parfum+De+Manon+-+Manons+Perfume+%28NEW+2015+Marc+Dorcel%29+%5BSpli","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92d4ac21667ddd6f4bb98c3fdba182ad30c2e8de","infoHashBuffer":{"type":"Buffer","data":[146,212,172,33,102,125,221,111,75,185,140,63,219,161,130,173,48,194,232,222]},"announce":[],"urlList":[]}}