{"title":"Night Ranger - Sister Christian [promo].VOB","uid":12544820,"size":272439296,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:96fb46c1b3a5b62bdab636811bc7f9fac4330fa3&amp;dn=Night+Ranger+-+Sister+Christian+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":1,"time":1444455641,"description":"Night Ranger - Sister Christian [promo].VOB\r\n\r\n\r\nHQ rare music video from a promo DVD with 24 bit LPCM Audio. &quot;Sister Christian&quot; is a power ballad by the American hard rock band Night Ranger. It was released in June 1984 as the second single from their album Midnight Madness. It was ranked number 32 on VH1's 100 Greatest Songs of the 1980s. It was written and sung by the band's drummer, Kelly Keagy, for his sister. It was the band's biggest hit, peaking at number five on the Billboard Hot 100, and staying on the charts for 24 weeks. It also reached number one in Canada. The song was also featured in Friday the 13th, Grand Theft Auto: Vice City, Saints Row 2, Parks and Recreation, American Dad!, Boogie Nights, Rock Band 3 and Superstar.\r\n\r\nThe song is about Keagy's little sister, Christy. Keagy wrote the song at his apartment, near Divisadero and California streets in San Francisco, after he had just returned from a visit to his hometown of Eugene, Oregon. He had been struck at how fast his teenaged sister, 10 years younger than he was, was growing up.\r\n\r\n&quot;After we started playing it a lot, Jack turned to me and said, 'What exactly are you saying?'&quot; Keagy recalled. &quot;He thought the words were Sister Christian, instead of Sister Christy, so it just stuck.&quot;\r\n\r\nThe lyric, &quot;You're motoring. What's your price for flight? In finding Mr. Right?&quot; is the subject of much debate. The band stated in a VH-1 Behind the Music interview that the term &quot;motoring&quot; was synonymous with the term &quot;cruising.&quot;\r\n\r\nThe music video was filmed in San Rafael High School.\r\n\r\n\r\nNight Ranger is an American rock band from San Francisco that gained popularity during the 1980s with a series of albums and singles. The band's first five albums sold more than 10 million copies worldwide. The quintet is perhaps best known for the power ballad &quot;Sister Christian&quot;, which peaked at No. 5 in June 1984.\r\n\r\nThe group's origin can be traced to Rubicon, a pop/funk group led by Jerry Martini, who gained fame as a member of Sly and the Family Stone. After Rubicon's demise in 1979, bassist Jack Blades formed a hard rock trio with two other Rubicon members, drummer Kelly Keagy and guitarist Brad Gillis. Performing under the name Stereo, the threesome added keyboardist Alan Fitzgerald, a former member of Montrose, in 1980. Fitzgerald soon recommended enlisting a second virtuoso guitarist, so Jeff Watson, who led his own band in Northern California, was added to the group. The seeds were sown for a new melodic hard rock band, initially called simply Ranger.\r\n\r\nIn 1982, the band changed its name to Night Ranger after a country band, The Rangers, claimed a trademark infringement. By this point, they had recorded Dawn Patrol for Boardwalk Records and done opening stints for ZZ Top and Ozzy Osbourne; the latter had employed Brad Gillis as a stand-in guitarist for the recently deceased Randy Rhoads in the spring and summer of 1982. After Boardwalk folded, producer Bruce Bird secured Night Ranger a deal with MCA on their Camel subsidiary in 1983.\r\n\r\nAfter their success waned in the late 1980s, the band split up in 1989 and its members pursued other musical endeavours including group and solo efforts.Brad Gillis and Kelly Keagy teamed up with bassist Gary Moon and released an album without the other original band members in 1995, but the band soon re-united to release two new albums in the latter half of the decade. Despite the departure of original keyboardist Alan Fitzgerald and guitarist Jeff Watson, the band has continued to tour and remains very popular in Asian countries, particularly Japan.\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Sister_Christian \r\n      \nhttp://postimg.org/image/guak5nuwz/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\r\n   Audio: LPCM 48000Hz stereo 2304kbps [DVD, 24 bits]\r\n   Duration: 00:04:17\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee) \r\n\t\r\n*This is one of my first downloads when i got my first PC and got online soon after, downloaded through a site that allowed some free Usenet downloads at the time, and uploads of music videos. I have a few more from then i'm also posting today, they will also have this text. \r\n\r\n\r\n\r\nMy other uploads from this band:\r\n \nhttp://thepiratebay.vg/torrent/12171744/Night_Ranger_-_Don_t_Tell_Me_You_Love_Me_[promo].VOB\r\n \nhttp://thepiratebay.vg/torrent/12171743/Night_Ranger_-_(You_Can_Still)_Rock_in_America_[promo].VOB","torrent":{"xt":"urn:btih:96fb46c1b3a5b62bdab636811bc7f9fac4330fa3","amp;dn":"Night+Ranger+-+Sister+Christian+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96fb46c1b3a5b62bdab636811bc7f9fac4330fa3","infoHashBuffer":{"type":"Buffer","data":[150,251,70,193,179,165,182,43,218,182,54,129,27,199,249,250,196,51,15,163]},"announce":[],"urlList":[]}}