{"title":"CBC.DOC ZONE.Mounties Under Fire (2010).HDTV.XviD.Ekolb","uid":5301020,"size":365941532,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:97aff4e7e10f94cd1a1cc3a5e216b08a05225031&amp;dn=CBC.DOC+ZONE.Mounties+Under+Fire+%282010%29.HDTV.XviD.Ekolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Ekolb","files":3,"time":1264224134,"description":"Mounties Under Fire\nThursday January 21, 2010 at 9 pm on CBC-TV\n\nMounties Under Fire is a thought-provoking journey into the heart of the RCMP during its darkest days. Woven into the big picture - and sometimes colliding with it - the very human stories of young recruits, still willing to step into a force under heavy fire.\n\nIt's been a most difficult decade for Canada's national police force. Faith in the RCMP has been shaken - by Maher Arar's betrayal, the pension scandal, harassment cases, and too many deaths on duty; by the captured-on-video taser death at Vancouver International Airport, and the Braidwood Inquiry into Robert Dziekanski's death. Earlier this year, a Canadian Press Harris-Decima poll found over 60 percent of Canadians didn't buy the RCMP's version of events at YVR. That number jumps to 71% in BC, where it happened.\n\nAgainst this backdrop, the Mounties face the greatest recruitment challenge in their history. Experienced Mounties are flooding out the door with the baby boom, leaving unfilled vacancies and overworked policeman. By 2010, 34% of the force will have fewer than five years experience. But within this challenge, lies great opportunity - to build a better RCMP from the wave of idealistic new recruits, untainted by scandal.\n\nDuring this time of profound crisis, documentary filmmaker Helen Slinger was granted unprecedented access to Depot, the fabled RCMP training centre in Regina. Bountiful Films' cameras followed Troop 35 during their six months of training. Mounties Under Fire profiles: Alex Rouhani, from Gatineau, Quebec by way of Paris and Tehran; \n\nEmily Schmidt from Cranbrook, British Columbia; and Steffan Manuel from Grand Bank, Newfoundland.\nAnd the camera's access doesn't end at Depot. From top brass, to beat cop - Slinger captures a force in the throes of painful self-examination, struggling to get back to its core values.\n\nBrought to crisis, the RCMP is now responding, striving towards profound institutional change while managing a sizeable rear guard action, as mistakes from the past make headlines today. Notorious for closing ranks, in Mounties Under Fire the RCMP opens up - revealing a terribly flawed organization, fighting for its life.\n\nMounties Under Fire is written and directed by Helen Slinger for Bountiful Films in association with the Canadian Broadcasting Corporation.\n\n\nFormat            : AVI\nLength            : 349 MiB for 44mn 4s 778ms\n\nCodec             : XviD\nSource            : HDTV\nLanguage          : English CA\nSubtitles         : None\nGenre             : Documentary\n\nVideo #0          : MPEG-4 Visual at 960 Kbps\nAspect            : 624 x 336 (1.857) at 29.970 fps\n\nAudio #0          : MPEG Audio at 133 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:97aff4e7e10f94cd1a1cc3a5e216b08a05225031","amp;dn":"CBC.DOC+ZONE.Mounties+Under+Fire+%282010%29.HDTV.XviD.Ekolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97aff4e7e10f94cd1a1cc3a5e216b08a05225031","infoHashBuffer":{"type":"Buffer","data":[151,175,244,231,225,15,148,205,26,28,195,165,226,22,176,138,5,34,80,49]},"announce":[],"urlList":[]}}