{"title":"Otep - Smash The Control Machine  (2nafish)","uid":5283226,"size":138219524,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:98cc6948329c76219c8448263fa5d365dd38daf7&amp;dn=Otep+-+Smash+The+Control+Machine++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263624545,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nOtep (also written as OTEP or OT3P) is an American heavy metal band formed in 2000 in Los Angeles, California by Otep Shamaya.\n\nThe band Otep was signed after only four shows, without a demo, strictly on the power of their live performance. Their live performance proved to be so impressive that Sharon Osbourne offered the unsigned act a spot on the 2001 Ozzfest tour. Since then Otep has appeared at the festival three times. To date, the band has released four full lengths, one EP and toured in support of all four releases.\n\nOtep Shamaya has also published two books of poetry, spoken at the Democratic National Convention in 2008, and has been recognized as a painter. She openly supports Carbon Rally , PETA and the WSPA. In addition to lending her support to numerous groups, Shamaya has started the social networks &quot;All Shapes and Sizes&quot; and &quot;Girls Out Now&quot;. On December 21, 2008, Shamaya created a blog entitled &quot;I'm Not a Monster&quot;.\n\nOn April 6, 2009, it was announced that Otep is now signed to Victory Records. On April 7, 2009 Shamaya announced that the new album will also mark the band reuniting with former members Mark &quot;Moke&quot; Bistany on drums and Rob Patterson on guitar. Otep stated a song titled &quot;Rise, Rebel, Resist&quot; from the new album Smash the Control Machine is slated for release August 18th, 2009. However, &quot;Smash the Control Machine&quot; will be the first song to be heard off the new album, receiving air play in June 2009. Koichi Fukuda is playing piano on the new album, and Emilie Autumn will play violin.The band appeared with 2Cents, Five Finger Death Punch &amp; Shadows Fall on the 'Shock &amp; Raw Tour' of North America in the fall of 2009. An article in the spring 2009 issue of Broken Records Magazine states that Otep delves beyond music to focus on important issues.\n\nIn November 2009, It was announced that their single &quot;Smash the Control Machine&quot; would be used for TNA Wrestling's Final Resolution 2009 PPV on December 20th\n\nSmash the Control Machine is the fourth studio album from Otep. It was released on August 18, 2009. A deluxe edition was released with a bonus DVD as well. The pre-release package also contained a T-shirt featuring the album cover and a poster of the cover. The album sold 10,400 copies in its first week of release to debut at #47 on The Billboard 200 chart. It was produced by Ulrich Wild, who worked with bands such as White Zombie, Static-X, Bleeding Through, and Pantera.\n\nOtep Shamaya is an American singer/songwriter. She made her debut in 2000 with the band Otep, and released the full length albums Sevas Tra, House of Secrets, The Ascension, and Smash the Control Machine in June 2002, July 2004, October 2007, and August 2009 respectively. Little is known about Otep Shamaya's personal life and background. She grew up in a near ghetto area of Los Angeles. To interviewers, she has given her age as &quot;five lifetimes old.&quot; It is said her birthdate is November 7, 1979. Despite speculation to the contrary, she insists that the name on her birth certificate is Otep. She is openly lesbian and a vegetarian.\n\nShamaya has been featured on HBO's Def Poetry. The first printed collection of poetry and illustrations by Otep Shamaya was made available to the public in November 2006 exclusively on Lulu.com. In August 2007, the e-book Little Sins, her first electronic collection of printed poems and illustrations was placed in book form.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:98cc6948329c76219c8448263fa5d365dd38daf7","amp;dn":"Otep+-+Smash+The+Control+Machine++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98cc6948329c76219c8448263fa5d365dd38daf7","infoHashBuffer":{"type":"Buffer","data":[152,204,105,72,50,156,118,33,156,132,72,38,63,165,211,101,221,56,218,247]},"announce":[],"urlList":[]}}