{"title":"FantasyMassage - Maddy O'Reilly (Hungry, Horny Housewife) NEW 01","uid":12515606,"size":271774664,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:993830f35ad6c4973adb5bc15a39d1b515fad3cc&amp;dn=FantasyMassage+-+Maddy+O%27Reilly+%28Hungry%2C+Horny+Housewife%29+NEW+01&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1443692444,"description":"Eric Masterson is new to the neighborhood and desperate to get his massage business up and running, he goes door to door asking hot chicks who could be interested in a free massage. And he is actually willing to pay them to be his subject. Eric is desperate to find any lucky lady willing to take up his enticing offer. But it back fires on Eric, who doesn't see how creepy he's being, pushing the girls away, at his displeasing intrusions...until he finally meets Maddy O'Reilly...Eric shows Maddy into his studio asking the basic questions and where he will need to focus the massage today. Maddy removes her petite and innocent floral dress, bra and underwear, becoming completely nude, ready to take full advantage of Eric's free rub down. As Eric massages Maddy's back, thighs and boobs, he doesn't realize that his client is making every move possible to have her pussy touched. It is so obvious Maddy is a lonely, horny housewife who's been wanting to get fucked by anyone other than her lame husband. Eric wraps up the massage session, but Maddy isn't done with him just yet, begging until she gets her pussy eaten and fucked. The least he can do is finish the job!Maddy's enticing offer lures Eric face deep inside her pussy, making her moan with pleasure. She wraps her legs strenuously around Eric's neck, begging him to massage the insides of her pussy with his tongue. He glides his cock in between her legs, stretching her tight pussy, feeling her insides open up with every cock thrust. Maddy's wet juices flow over Eric's cock. Maddy isn't finished, and wants to taste and suck her juice off Eric's cock, begging for his warm cum over her sweet, innocent face! Let's hope that Maddy recommends Eric to all the horny housewives on the block!\r\nTags: Pussy Licking, Ass Rubbing, Body Massage, Blowjob, Facial, Hardcore, Natural Tits, Massage, Ass Massage, Bubble Butt, Cunilingus, Big Dick, Pilots\r\n \nhttp://imgdone.com/viewer.php?file=31608272140321120157.jpg\r\n \nhttp://imgdone.com/viewer.php?file=54361952135219185610.jpg","torrent":{"xt":"urn:btih:993830f35ad6c4973adb5bc15a39d1b515fad3cc","amp;dn":"FantasyMassage+-+Maddy+O%27Reilly+%28Hungry%2C+Horny+Housewife%29+NEW+01","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"993830f35ad6c4973adb5bc15a39d1b515fad3cc","infoHashBuffer":{"type":"Buffer","data":[153,56,48,243,90,214,196,151,58,219,91,193,90,57,209,181,21,250,211,204]},"announce":[],"urlList":[]}}