{"title":"Music For Misfits The Story of Indie s01e03 x264 WEBRIP [MPup]","uid":12588230,"size":1062024971,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:99ad8e446c04b156cde8d31c5787ac1400d6c4cf&amp;dn=Music+For+Misfits+The+Story+of+Indie+s01e03+x264+WEBRIP+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1445058225,"description":"Music For Misfits The Story of Indie s01e03 EN SUB x264 WEBRIP [MPup] Into the Mainstream\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]3 of 3[/b]\r\n\r\nThe final episode looks at the influence of dance music, the Britpop era and the emergence of new labels in the late 90s.\r\n\r\n[img]http://extraimago.com/images/2015/10/17/1ddba3d60a4aaaab63bc40ff0c0d08aa.jpg[/img]\r\n\r\nThe story of British indie over three musically diverse episodes. Much more than a genre of music, it is a spirit, an attitude and an ethos.\r\n\r\nIt's 1989 and a new grassroots music craze is sweeping across Britain. Despite the authorities railing against 'the zombification of a nation', acid house and its bed partner ecstasy are influencing a wave of indie bands. On the eve of a new decade while original independent labels struggle in the wake of acid, young indie labels Heavenly and Creation are thriving, signing both Manic Street Preachers and Primal Scream respectively.\r\n\r\nBy the mid-90s, in a bid to break the stranglehold of American grunge bands, the music press construct Britpop and push two bands, Oasis and Blur, to the top of the pile. The key thing that separates Britpop bands from the previous generation is the mindset. These bands, who grew up in the Thatcher era, want to sell (and make) a million. Bands with an old indie ethos, such as Suede, are still breaking through, but will switch from independent labels to majors, thus guaranteeing international recognition.\r\n\r\nIndie truly goes mainstream when Noel Gallagher shakes hands with Tony Blair and Oasis fill Knebworth. The spirit of the DIY boom had all but gone and indie becomes a genre rather than an alternative approach to making and releasing music. The late 90s are dark days for indie, but as Rough Trade rises from the ashes with two fresh signings- the Strokes and the Libertines - it feels like a new dawn. More new completely independent labels emerge. They've learnt from the mistakes of old and are excellent at artist development -labels such Domino, who manage the Arctic Monkeys and Franz Ferdinand. We hear why these two bands - who had the majors tripping over themselves to sign them - choose Domino instead.\r\n\r\nThese bands also heralded a new way in which music was being discovered. It's the fans at a grassroots level, sharing their favourite band via clips on social media, who would be the new A&amp;R - alerting the record labels to new talent.\r\n\r\nWe finally come full circle to discover just what constitutes indie music now, if there still a need for independent labels and, finally, whether the spirit of rebellion that inspired the DIY movement of the 1970s still exists today.\r\n\r\nThe series is presented by BBC Radio 6 Music's Mark Radcliffe and this episode features exclusive interviews with performers including Alex Kapranos of Franz Ferdinand, Shaun Ryder of Happy Mondays, the Libertines' Carl Barat, Stuart Murdoch from Belle &amp; Sebastian and Bob Stanley of Saint Etienne. It also includes interviews with a number of influential music industry figures such as James Endeacott, formerly of Rough Trade Records and founder of Sony BMG subsidiary record label 1965 Records, Heavenly Recordings' Jeff Barrett, Creation Records' Alan McGee and indie music author Richard King","torrent":{"xt":"urn:btih:99ad8e446c04b156cde8d31c5787ac1400d6c4cf","amp;dn":"Music+For+Misfits+The+Story+of+Indie+s01e03+x264+WEBRIP+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ad8e446c04b156cde8d31c5787ac1400d6c4cf","infoHashBuffer":{"type":"Buffer","data":[153,173,142,68,108,4,177,86,205,232,211,28,87,135,172,20,0,214,196,207]},"announce":[],"urlList":[]}}