{"title":"Mitsutoshi Inaba, Willie Dixon: Preacher of the Blues (PDF)","uid":12338579,"size":10745343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b60b9e067b58a3f4c9cafb9caf819b22cd2aecd&amp;dn=Mitsutoshi+Inaba%2C+Willie+Dixon%3A+Preacher+of+the+Blues+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1441276008,"description":"One of the greats of blues music, Willie Dixon was a recording artist whose abilities extended beyond that of bass player. A singer, songwriter, arranger, and producer, Dixon's work influenced countless artists across the music spectrum. In Willie Dixon: Preacher of the Blues, Mitsutoshi Inaba examines Dixon's career, from his earliest recordings with the Five Breezes through his major work with Chess Records and Cobra Records. Focusing on Dixon's work on the Chicago blues from the 1940s to the early 1970s, this book details the development of Dixon's songwriting techniques from his early professional career to his mature period and compares the compositions he provided for different artists. This volume also explores Dixon's philosophy of songwriting and its social, historical, and cultural background. This is the first study to discuss his compositions in an African American cultural context, drawing upon interviews with his family and former band members. This volume also includes a detailed list of Dixon's session work, in which his compositions are chronologically organized","torrent":{"xt":"urn:btih:9b60b9e067b58a3f4c9cafb9caf819b22cd2aecd","amp;dn":"Mitsutoshi+Inaba%2C+Willie+Dixon%3A+Preacher+of+the+Blues+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b60b9e067b58a3f4c9cafb9caf819b22cd2aecd","infoHashBuffer":{"type":"Buffer","data":[155,96,185,224,103,181,138,63,76,156,175,185,202,248,25,178,44,210,174,205]},"announce":[],"urlList":[]}}