{"title":"Freeze! 2 - Brothers v1.11","uid":12487372,"size":43063180,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9bd573223375b0f7aba4fdad92f95e42802b37ac&amp;dn=Freeze%21+2+-+Brothers+v1.11&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":1,"time":1443121061,"description":"Welcome to &quot;Freeze! 2&quot;, the highly anticipated sequel to the multi award winning puzzle hit &quot;Freeze!&quot; (More than 11 million downloads worldwide!).\r\n\r\nPLEASE NOTE:\r\n\r\n&quot;Freeze! 2&quot; is the premium full version with 100 levels, with no in-app purchases and without annoying ads! So, it isn’t free - but we can also guarantee that you pay only once for the entire game, and never again!\r\n\r\nTHE STORY:\r\n\r\nMany years ago, our old hero from „Freeze!“ was kidnapped from evil aliens and locked in a tiny cell on a planet far, far away. He never found his way back.\r\n\r\nNow his little brother heads to the stars in his self-built rocket to find his lost brother and to free him from the clutches of the aliens!\r\n\r\nTHE GAME MECHANICS:\r\n\r\nYou’ll solve twisted physics-based puzzles by rotating the cells around our heroes with your finger. And of course you’ll have to use the Freeze-buttons to arrest gravity for the brothers. Sounds simple? Well, yes, it is - at first.\r\n\r\nNEW IN &quot;FREEZE! 2&quot;:\r\n\r\nThe basic gameplay is the same as in „Freeze!“, but there are many exciting extensions: In the levels you’ll encounter liquids like water and deadly rocket fuel sloshing around. The brothers have to pass most levels together, fighting against lethal electric fields, smart batteries (what?!?) and slightly sadistic level design.\r\n\r\nHIGHLIGHTS OF &quot;FREEZE! 2&quot;\r\n\r\n• Premium game, no ads, no in-app purchases, developed by Andreas von Lepel\r\n• New look and unique graphics by art director Jonas Schenk (jonasschenk.com)\r\n• With surreal alien worlds by illustrator Jonas Littke (lufthoheit.com)\r\n• 4 alien worlds, 100 varied and exciting levels, designed by Hiro Yamada\r\n• New dark tracks from the Swiss Trance Master Karl Lukas\n• Simulation of fluids such as water and deadly rocket fuel\r\n• High Scores and Achievements - who’ll escape fastest from the prison worlds?\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.frozengun.freeze2.google","torrent":{"xt":"urn:btih:9bd573223375b0f7aba4fdad92f95e42802b37ac","amp;dn":"Freeze%21+2+-+Brothers+v1.11","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bd573223375b0f7aba4fdad92f95e42802b37ac","infoHashBuffer":{"type":"Buffer","data":[155,213,115,34,51,117,176,247,171,164,253,173,146,249,94,66,128,43,55,172]},"announce":[],"urlList":[]}}