{"title":"Ikonoklasta-Please Save Luaty Beirao and the Freedom of Speech","uid":12612380,"size":192181076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9c1211cd1dfc99684ac66b6228bf1ca803ff6c58&amp;dn=Ikonoklasta-Please+Save+Luaty+Beirao+and+the+Freedom+of+Speech&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"deepstatus","files":6,"time":1445478368,"description":"Please help Luaty and the Freedom of Speech-D33P57A7U5\r\n            -------------------------------------------------------\r\n\r\n     URL.......: http://peticaopublica.com/pview.aspx?pi=PT78772\r\n\r\n\r\n\r\n\r\n S_cr8sEveyE - youtube\r\n\r\n\r\n\r\n\r\n    #LiberdadeJA\r\n\r\n   Singer and political activist Henrique Luaty Beirão is Angolan,\r\n   but he is also a Portuguese citizen illegally arrested abroad.\r\n   We know he is willing to give his life for greater causes,\r\n   such as those of liberty and justice. We also know that his death,\r\n   after his long hunger strike, may come soon. It is the constitutional,\r\n   ethical and moral obligation of the Portuguese Government to not allow\r\n   that to happen. We are aware of the hardships and complexities of the\r\n   Angolan-Portuguese diplomatic relations. Yet, no value can rise higher\r\n   than that of the defense of Human Rights. And this is as matter of\r\n   Human Rights. It is imperative that the Portuguese Government takes a\r\n   stand and publicly demands the immediate liberation of Henrique Luaty\r\n   Beirão. It is also the obligation of the Portuguese Government to\r\n   communicate this stand to the all CPLP community as well as to the\r\n   entire world community committed to the defense of the principles\r\n   of liberty and equality. Portugal cannot persist as the silent and\r\n   passive witness of a slow political murder without becoming its\r\n   accomplice.\r\n\r\n  Post scriptum: since this text was first written, Henrique Luaty Beirão\r\n  has publicly renounced the support of Portuguese authorities.\r\n  Luaty Beirão is fighting for the Angolan people and desires to be treated\r\n  and judged as an Angolan citizen. This stand is understandable and\r\n  praiseworthy as evidence of his determination, courage and abnegation.\r\n  Even so, Portuguese authorities may not, under any pretext,\r\n  resign their obligations\r\n\r\n\r\n            Please help Luaty and the Freedom of Speech\r\n\r\n         \r\n\r\n                 thank you for your time","torrent":{"xt":"urn:btih:9c1211cd1dfc99684ac66b6228bf1ca803ff6c58","amp;dn":"Ikonoklasta-Please+Save+Luaty+Beirao+and+the+Freedom+of+Speech","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1211cd1dfc99684ac66b6228bf1ca803ff6c58","infoHashBuffer":{"type":"Buffer","data":[156,18,17,205,29,252,153,104,74,198,107,98,40,191,28,168,3,255,108,88]},"announce":[],"urlList":[]}}