{"title":"Secrets of Grindea v0.602a Cracked-3DM","uid":12573694,"size":255339914,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9eb1881352dbfaa41523a0e51f44133f83ab6b2e&amp;dn=Secrets+of+Grindea+v0.602a+Cracked-3DM&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pirata","files":1,"time":1444869786,"description":"Release Description:\n\nMedieval Engineers is a sandbox game about engineering, construction and the maintenance of architectural works and mechanical equipment using medieval technology. Players build cities, castles and fortifications; construct mechanical devices and engines; perform landscaping and underground mining.\nThe game is inspired by real medieval technology and the way people built architectural works and mechanical equipment using medieval technology. Medieval Engineers strives to follow the laws of physics and history and doesn’t use any technologies that were not available in the 5th to 15th centuries.\n\nFeatures:\n\n    Character customization. Advanced skill trees give you precise control over how your character develops. There are no caps or specific classes, so the possibilities are endless. On top of this, there’s a wide variety of haircuts, hats and head gears that will make your character look unique as well.\n    Co-op support for up to four players! Bring your friends on the adventure, challenge them to any of the mini games in the arena or why not have them help you out in a difficult dungeon?\n    Deep combat system inspired by Zelda and Secret of Mana, but supercharged with modern ideas.\n    A lengthy and dramatic storyline will take you through dungeons and fields of all shapes in the rich and varied world of Grindea. Countless of side quests and hidden content will keep you busy for hours after finishing the game.\n    Hundreds of items to hunt, craft, fish or dig up in order to improve your character, fill the codex and gain fame.\n    A pet system that makes sure you never have to be alone, even when playing by yourself. Catch any of the cute tameable animals and have them accompany you on your adventures while also boosting your skills!\n    High scores and achievements will soon make your friends turn green with envy.\n\nFor more info go to : http://store.steampowered.com/app/269770","torrent":{"xt":"urn:btih:9eb1881352dbfaa41523a0e51f44133f83ab6b2e","amp;dn":"Secrets+of+Grindea+v0.602a+Cracked-3DM","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eb1881352dbfaa41523a0e51f44133f83ab6b2e","infoHashBuffer":{"type":"Buffer","data":[158,177,136,19,82,219,250,164,21,35,160,229,31,68,19,63,131,171,107,46]},"announce":[],"urlList":[]}}