{"title":"Fullmetal Alchemist: Brotherhood 11/63  XviD ac3 ITA JAP sub ENG","uid":5293910,"size":349035721,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a01551697bca48751894ee5c2072a38531b24655&amp;dn=Fullmetal+Alchemist%3A+Brotherhood+11%2F63++XviD+ac3+ITA+JAP+sub+ENG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"salvoiorfida","files":3,"time":1263993129,"description":"Introduzione:\n\nFullmetal Alchemist ÃƒÂ¨ un manga fantasy ambientato agli inizi del 20Ã‚Â° secolo in un paese chiamato Amestris. In questo mondo immaginario l'alchimia ÃƒÂ¨ la scienza che permette di trasmutare una materia in una differente (secondo la legge dello scambio equivalente) attraverso l'uso di un cerchio alchemico. I migliori alchimisti hanno la possibilitÃƒÂ  di partecipare ad un esame per poi entrare nell'esercito, sotto il titolo di alchimisti di Stato.\n\nPur partendo da una base comune, la trama della prima serie dell'anime (2003), col proseguire della serie si allontana molto da quella del manga. La seconda serie animata (2009) ÃƒÂ¨ pensata per seguire piÃƒÂ¹ fedelmente il manga e presenta solo differenze marginali rispetto alla versione cartacea.\n\nTecnicamente ÃƒÂ¨ superlativa, ha animazioni superbe , un ottimo ritmo e regia, una colorazione piÃƒÂ¹ matura e realistica, per non parlare del chara design, molto bello, che ÃƒÂ¨ allo stesso tempo fedele e migliore del manga.\n\nDopo i 52 episodi della prima serie e il film, devo dire che vale la pena di darci un'occhiata, soprattutto se si ÃƒÂ¨ fan di FMA... :birra: \n\nTrama:\n\nEdward e Alphonse Elric erano dei bambini che vivevano in un villaggio di campagna chiamato Resembool. Il padre dei ragazzi Hohenheim (Hohenheim della Luce nell'anime e Van Hohenheim nel manga), un alchimista straordinario, se ne era andato di casa quando Edward era ancora molto piccolo e Alphonse era praticamente un neonato. Anni dopo, la madre dei ragazzi, Trisha Elric, morÃƒÂ¬ a causa di una grave malattia. Dopo la sua morte, Edward e Alphonse vissero insieme a Winry e sua nonna fino a quando non trovarono un'insegnante di alchimia. Dopo aver completato l'allenamento impostogli da quest'ultima, tornarono a casa con l'intenzione di riportare in vita la defunta madre attraverso il cerchio alchemico che avevano trovato fra gli appunti del padre. Il loro tentativo fallisce e al posto del redivivo corpo della madre compare un mucchio informe di carne e ossa, creato a costo della gamba sinistra di Edward e l'intero corpo di Alphonse. Nel disperato tentativo di salvare suo fratello, Edward sacrificÃƒÂ² il suo braccio destro per legare l'anima di Al ad un'armatura....\n\nDettagli: \n\nLingue: Italiano Japponese - Sottotitoli Inglesi\nFormato Video: Xvid 16:9 720 x 400 pixel\nFormato Audio: ac3 2 canali stereo 192 kbs \nDimensione : 320 mb circa ciascuno episodio\n\nmore info at :\n    &lt;a href=&quot;\nhttp://www.tntvillage.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tntvillage.tk&lt;/a&gt;\t","torrent":{"xt":"urn:btih:a01551697bca48751894ee5c2072a38531b24655","amp;dn":"Fullmetal+Alchemist%3A+Brotherhood+11%2F63++XviD+ac3+ITA+JAP+sub+ENG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a01551697bca48751894ee5c2072a38531b24655","infoHashBuffer":{"type":"Buffer","data":[160,21,81,105,123,202,72,117,24,148,238,92,32,114,163,133,49,178,70,85]},"announce":[],"urlList":[]}}