{"title":"Sisters Of Mercy - Dominion  (2nafish)","uid":5298676,"size":159959044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a07537112d1277dadf8702f4bd1d9f4806506e9b&amp;dn=Sisters+Of+Mercy+-+Dominion++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264148448,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Sisters of Mercy are an English gothic rock band that formed in 1980. After achieving early underground fame in UK, the band had their commercial breakthrough in mid-1980s and sustained it until the early 1990s, when they stopped releasing new recorded output as a strike against their record company. Currently, the band is a touring outfit only.\n\nThe band was formed in Leeds, England in 1980 by F-club regulars Gary Marx and Andrew Eldritch to satisfy their desire to hear themselves on the radio; during that time band t-shirts were made and a single, &quot;Damage Done/Watch/Home of the Hit-men&quot;, was recorded and released. The name was influenced by Robert Altman's film McCabe &amp; Mrs. Miller (1971), which featured the Leonard Cohen song of the same name (&quot;because The Captains of Industry wouldn't have been as funny&quot;).\n\nOn the single (claimed by the band to have been played twice by John Peel) Gary Marx played guitar through a practice amplifier and Andrew Eldritch was on drums. The partners each wrote and sang on a song.\n\nThe band regrouped with Craig Adams on bass, while Eldritch's drumming was replaced by a drum machine, leaving him to concentrate on vocals. The drum machine was christened &quot;Doktor Avalanche&quot;, and all of its numerous successors kept this name. Andrew Eldritch took over lyrics-writing, Doktor-programming, and record-producing duties, while sharing the music-writing with Marx and (occasionally) Adams.\n\nThis became what is generally recognised as the first real Sisters line-up. It began with the Doktor/Eldritch/Marx/Adams incarnation of the band playing a gig in the Riley Smith Hall of the University of Leeds [England]'s Union building in early 1981. Unsurprisingly, nobody can remember the exact date so, for historic purposes, the band and fans have often celebrated the anniversary of the February 16, 1981 concert, in Vanbrugh College, York, England - the band's second ever gig in the form. In 2001, it was the scene of the band's 20th anniversary concert, complete with iced cupcakes for the audience. Later in 1981, Ben Gunn established himself as the second guitarist after several others came and went. Eldritch's melancholic baritone, Craig Adams's pulsating bass, Doktor Avalanche's beat and Gary Marx's flowing guitar led the band to early underground success.\n\nFloodland is the second album by The Sisters of Mercy, released in 1987. Composed and produced by Andrew Eldritch, it marked a change of direction from guitar-oriented rock towards synthesizer-based productions. The record peaked at #9 in UK album charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a07537112d1277dadf8702f4bd1d9f4806506e9b","amp;dn":"Sisters+Of+Mercy+-+Dominion++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a07537112d1277dadf8702f4bd1d9f4806506e9b","infoHashBuffer":{"type":"Buffer","data":[160,117,55,17,45,18,119,218,223,135,2,244,189,29,159,72,6,80,110,155]},"announce":[],"urlList":[]}}