{"title":"Lees' Loss Prevention in the Process Industries 3rd ed","uid":12548681,"size":59440477,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a26b2ca62024a0f62890dfdd42db0a8c2f8993df&amp;dn=Lees%27+Loss+Prevention+in+the+Process+Industries+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1444507554,"description":"Lees' Loss Prevention in the Process Industries 3rd ed (Elsevier, 2005).PDF\r\n\r\nISBN 0750675551\r\n\r\nOver the last three decades the process industries have grown very rapidly, with corresponding increases in the quantities of hazardous materials in process, storage or transport. Plants have become larger and are often situated in or close to densely populated areas. Increased hazard of loss of life or property is continually highlighted with incidents such as Flixborough, Bhopal, Chernobyl, Three Mile Island, the Phillips 66 incident, and Piper Alpha to name but a few.\r\n\r\nThe field of Loss Prevention is, and continues to, be of supreme importance to countless companies, municipalities and governments around the world, because of the trend for processing plants to become larger and often be situated in or close to densely populated areas, thus increasing the hazard of loss of life or property. This book is a detailed guidebook to defending against these, and many other, hazards. It could without exaggeration be referred to as the &quot;bible&quot; for the process industries. This is THE standard reference work for chemical and process engineering safety professionals. For years, it has been the most complete collection of information on the theory, practice, design elements, equipment, regulations and laws covering the field of process safety. An entire library of alternative books (and cross-referencing systems) would be needed to replace or improve upon it, but everything of importance to safety professionals, engineers and managers can be found in this all-encompassing reference instead. \r\n\r\nFrank Lees' world renowned work has been fully revised and expanded by a team of leading chemical and process engineers working under the guidance of one of the world’s chief experts in this field. Sam Mannan is professor of chemical engineering at Texas A&amp;M University, and heads the Mary Kay O’Connor Process Safety Center at Texas A&amp;M. He received his MS and Ph.D. in chemical engineering from the University of Oklahoma, and joined the chemical engineering department at Texas A&amp;M University as a professor in 1997. He has over 20 years of experience as an engineer, working both in industry and academia\r\n\r\nNew detail is added to chapters on fire safety, engineering, explosion hazards, analysis and suppression, and new appendices feature more recent disasters. The many thousands of references have been updated along with standards and codes of practice issued by authorities in the US, UK/Europe and internationally. In addition to all this, more regulatory relevance and case studies have been included in this edition. Written in a clear and concise style, Loss Prevention in the Process Industries covers traditional areas of personal safety as well as the more technological aspects and thus provides balanced and in-depth coverage of the whole field of safety and loss prevention. \r\n\r\n* A must-have standard reference for chemical and process engineering safety professionals\r\n\r\n* The most complete collection of information on the theory, practice, design elements, equipment and laws that pertain to process safety\r\n\r\n* Only single work to provide everything; principles, practice, codes, standards, data and references needed by those practicing in the field","torrent":{"xt":"urn:btih:a26b2ca62024a0f62890dfdd42db0a8c2f8993df","amp;dn":"Lees%27+Loss+Prevention+in+the+Process+Industries+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a26b2ca62024a0f62890dfdd42db0a8c2f8993df","infoHashBuffer":{"type":"Buffer","data":[162,107,44,166,32,36,160,246,40,144,223,221,66,219,10,140,47,137,147,223]},"announce":[],"urlList":[]}}