{"title":"May I Quote You on That - A Guide to Grammar and Usage (2015)","uid":12594379,"size":1906309,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2f5fce821177bb3c91fb55c52eb38abdc1ac60e&amp;dn=May+I+Quote+You+on+That+-+A+Guide+to+Grammar+and+Usage+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445203873,"description":"Publisher: Oxford University Press; 1 edition (August 5, 2015)\r\nLanguage: English\r\nISBN-10: 0190215283\r\nISBN-13: 978-0190215286\r\n\r\nWe all use language in different ways, depending on the situations we find ourselves in. In formal contexts we are usually expected to use a formal level of Standard English-the English codified in grammars, usage guides, and dictionaries. \r\n\r\nIn May I Quote You on That? Stephen Spector offers a new approach to learning Standard English grammar and usage. The product of Spector's forty years of teaching courses on the English language, this book makes the conventions of formal writing and speech easier and more enjoyable to learn than traditional approaches usually do. Each lesson begins with humorous, interesting, or instructive illustrative quotations from writers, celebrities, and historical figures. Mark Twain appears alongside Winston Churchill, Yogi Berra, Woody Allen, Jerry Seinfeld, Stephen Colbert, Oprah, Lady Gaga, and many others. These quotations allow readers to infer the rules and word meanings from context. And if they stick in readers' memory, they can serve as models for the rules they exemplify. The lessons then offer short essays, written in a conversational style, on the history of the rules or the words being discussed. But because English is constantly changing, the essays offer not only the traditional rules of Standard English, but also the current opinions of usage panelists, stylists, and language specialists. When rules are controversial, Spector offers advice about stylistic choices. A companion website features a workbook with practice drills. \r\n\r\nThis book will appeal to anyone who wants to write well. It's aimed at those who are applying to college, taking the SAT, or writing a job application, an essay, or anything else that requires clear and effective communication","torrent":{"xt":"urn:btih:a2f5fce821177bb3c91fb55c52eb38abdc1ac60e","amp;dn":"May+I+Quote+You+on+That+-+A+Guide+to+Grammar+and+Usage+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2f5fce821177bb3c91fb55c52eb38abdc1ac60e","infoHashBuffer":{"type":"Buffer","data":[162,245,252,232,33,23,123,179,201,31,181,92,82,235,56,171,220,26,198,14]},"announce":[],"urlList":[]}}