{"title":"Washington's Farewell Address Sept. 17th 1796 - A","uid":5292184,"size":25986056,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a35ad272785ef5a0cf131870306f64c846eaf80e&amp;dn=Washington%5C%27s+Farewell+Address+Sept.+17th+1796+-+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":6,"time":1263931364,"description":"Audio Books : Misc. Educational : MP3/64Kbps : English\nWashington's Farewell Address to the Nation appears in its entirety in this issue of the Independent Chronicle. Although it is by all accounts the most famous and best-known of Washington's speeches, it was never actually delivered orally by Washington. By his own arrangement it first appeared in a newspaper at Philadelphia. It was published seven days later in The Independent Chronicle.\n\nThe Chronicle, published in Boston by Thomas Adams and Isaac Larkin, was the leading New England voice of the Republican party. Its pages contained a number of outspoken contributors who could be counted on to regularly issue vigorous assaults on the Federalists. In Boston since 1776 the newspaper carved out a distinguished journalistic career for one hundred years.\n\nWashington's Farewell Address was similar to one he had prepared at the end of his first term, when he had considered retiring from office. Toward the close of his first term in 1792 James Madison prepared notes to be used by Washington in formulating a valedictory speech. Madison submitted a draft but it was set aside when Washington abandoned his plans for retirement.\n\nIn May 1796 he took Madison's notes and wrote a first draft for the new address. Washington showed his manuscript to Alexander Hamilton and asked him to revise it. For the next four months various drafts were sent back and forth between Washington and Hamilton. Finally, Hamilton read his version of the address to John Jay for criticism, discussing the work paragraph by paragraph. The result, rewritten again by Washington in a final version, and admittedly a collaborative effort, nonetheless embodies the thoughts, ideas and principles of the retiring president.\n\nDescribing the farewell address in his book on the life of Washington, Henry Cabot Lodge wrote &quot;...no man ever left a nobler political testament.&quot;\n\nIn his Address Washington announces his planned withdrawal from politics &quot;after forty-five years of my life dedicated to its (America's) service.&quot; He then sets forth his reasons against running for a third term. As if to bolster his argument, he states: &quot;While choice and prudence invite me to quit the political scene, patriotism does not forbid it.&quot;\nIn his address Washington:\n\n* Extolls the benefits of the federal government. &quot;The unity of government...is a main pillar in the edifice of your real independence...of your tranquility at home, your peace abroad; of your safety; of your prosperity; of that very liberty which you so highly prize.&quot;\n* Warns against the party system. &quot;It serves to distract the Public Councils, and enfeeble the Public Administration....agitates the Community with ill-founded jealousies and false alarms; kindles the animosity of one....against another....it opens the door to foreign influence and corruption...thus the policy and the will of one country are subjected to the policy and will of another.&quot;\n* Stresses the importance of religion and morality. &quot;Where is the security for property, for reputation, for life, if the sense of religious obligation desert the oaths, which are the instruments of investigation in Courts of Justice?&quot;\n* On stable public credit. &quot;...cherish public credit. One method of preserving it is to use it as sparingly as possible...avoiding likewise the accumulation of debt....it is essential that you...bear in mind, that towards the payments of debts there must be Revenue, that to have Revenue there must be taxes; that no taxes can be devised, which are not...inconvenient and unpleasant...&quot;\n* Warns against permanent foreign alliances. &quot;It is our true policy to steer clear of permanent alliances with any portion of the foreign world...&quot;\n* On an over-powerful military establishment. &quot;...avoid the necessity of those overgrown military establishments, which, under any form of government, are inauspicious to liberty, and which are to be regarded as particularly hostile to Republican Liberty.&quot;\n\nIn saying farewell to the new nation he helped create Washington pointed out that &quot;.......the name of American, which belongs to you, in your national capacity, must always exalt the just pride of Patriotism...&quot;\n\nTo the great soldier, statesman and leader of his country...no tribute could be more fitting.","torrent":{"xt":"urn:btih:a35ad272785ef5a0cf131870306f64c846eaf80e","amp;dn":"Washington%5C%27s+Farewell+Address+Sept.+17th+1796+-+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a35ad272785ef5a0cf131870306f64c846eaf80e","infoHashBuffer":{"type":"Buffer","data":[163,90,210,114,120,94,245,160,207,19,24,112,48,111,100,200,70,234,248,14]},"announce":[],"urlList":[]}}