{"title":"Jasper Fforde - Thursday Next [Books 1 - 5]","uid":12340735,"size":3302641136,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a3b6251299e2e6db7470bca21c1f09e05fee647d&amp;dn=Jasper+Fforde+-+Thursday+Next+%5BBooks+1+-+5%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":257,"time":1441294832,"description":"\n\nBook 1 - The Eyre Affair\n\nMeet Thursday Next, literary detective without equal, fear or boyfriend. There is another 1985, where London's criminal gangs have moved into the lucrative literary market, and Thursday Next is on the trail of the new crime wave's MR Big. Acheron Hades has been kidnapping certain characters from works of fiction and holding them to ransom. Jane Eyre is gone. Missing. Thursday sets out to find a way into the book to repair the damage. But solving crimes against literature isn't easy when you also have to find time to halt the Crimean War, persuade the man you love to marry you, and figure out who really wrote Shakespeare's plays. Perhaps today just isn't going to be Thursday's day. Join her on a truly breathtaking adventure, and find out for yourself. Fiction will never be the same again ...\n\nBook 2 - Lost in a Good Book\n\nThursday Next, literary detective and newlywed is back to embark on an adventure that begins, quite literally on her own doorstep. It seems that Landen, her husband of four weeks, actually drowned in an accident when he was two years old. Someone, somewhere, sometime, is responsible. The sinister Goliath Corporation wants its operative Jack Schitt out of the poem in which Thursday trapped him, and it will do almost anything to achieve this - but bribing the ChronoGuard? Is that possible?\n\nHaving barely caught her breath after The Eyre Affair, Thursday must battle corrupt politicians, try to save the world from extinction, and help the Neanderthals to species self-determination. Mastadon migrations, journeys into Just William, a chance meeting with the Flopsy Bunnies, and violent life-and-death struggles in the summer sales are all part of a greater plan.\n\nBut whose? and why?\n\n\nBook 3 - Well of Lost Plots\n\nLeaving Swindon behind her to hide out in the Well of Lost Plots (the place where all fiction is created), Thursday Next, Literary Detective and soon-to-be one parent family, ponders her next move from within an unpublished book of dubious merit entitled 'Caversham Heights'. Landen, her husband, is still eradicated, Aornis Hades is meddling with Thursday's memory, and Miss Havisham - when not sewing up plot-holes in 'Mill on the Floss' - is trying to break the land-speed record on the A409. But something is rotten in the state of Jurisfiction. Perkins is 'accidentally' eaten by the minotaur, and Snell succumbs to the Mispeling Vyrus. As a shadow looms over popular fiction, Thursday must keep her wits about her and discover not only what is going on, but also who she can trust to tell about it ...With grammasites, holesmiths, trainee characters, pagerunners, baby dodos and an adopted home scheduled for demolition, 'The Well of Lost Plots' is at once an addictively exciting adventure and an insight into how books are made, who makes them - and why there is no singular for 'scampi'. In the words of one critic: 'Don't ask. Just read it.'\n\nBook 4 - Something Rotten\n\nThursday Next, Head of JurisFiction and ex-SpecOps agent, returns to her native Swindon accompanied by a child of two, a pair of dodos and Hamlet, who is on a fact-finding mission in the real world.\n\nThursday has been despatched to capture escaped Fictioneer Yorrick Kaine but even so, now seems as good a time as any to retrieve her husband Landen from his state of eradication at the hands of the Chronoguard.\n\nIt's not going to be easy. Thursday's former colleagues at the department of Literary Detectives want her to investigate a spate of cloned Shakespeares, the Goliath Corporation are planning to switch to a new Faith based corporate management system and the Neanderthals feel she might be the Chosen One who will lead them to genetic self-determination.\n\nWith help from Hamlet, her uncle and time-travelling father, Thursday faces the toughest adventure of her career. Where is the missing President-for-life George Formby? Why is it imperative for the Swindon Mallets to win the World Croquet League final? And why is it so difficult to find reliable childcare?\n\nBook 5 - First Among Sequels\n\nFourteen years after she pegged out at 1988 SuperHoop, Thursday Next is grappling with a recalcitrant new apprentice, the death of Sherlock Holmes and the inexplicable departure of comedy from the once-hilarious Thomas Hardy novels.\n\nHer idle sixteen-year-old would rather sleep all day than save the world from imminent destruction, the government has a dangerously high stupidity surplues, and the Stiltonista Cheese Mafia are causing trouble for Thursday in her hometown of Swindon.\n\nThen things begin to get bad. As Reality Book Shows look set to transplant Reality TV Shows and Goliath invent a trans-fictional tourist coach, Thursday must once again have her wits about her as she travels to the very limits of acceptable narrative possibilities to rescue the reading experience from almost certain destruction","torrent":{"xt":"urn:btih:a3b6251299e2e6db7470bca21c1f09e05fee647d","amp;dn":"Jasper+Fforde+-+Thursday+Next+%5BBooks+1+-+5%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3b6251299e2e6db7470bca21c1f09e05fee647d","infoHashBuffer":{"type":"Buffer","data":[163,182,37,18,153,226,230,219,116,112,188,162,28,31,9,224,95,238,100,125]},"announce":[],"urlList":[]}}