{"title":"Madness in Civilization (2015).pdf Gooner","uid":12570214,"size":89869003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a768f1f3590776c6d5e11e3171fe131228338cc1&amp;dn=Madness+in+Civilization+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1444841947,"description":"Publisher: Princeton University Press (April 6, 2015)\r\nLanguage: English\r\nISBN-10: 0691166153\r\nISBN-13: 978-0691166155\r\n\r\nThe loss of reason, a sense of alienation from the commonsense world we all like to imagine we inhabit, the shattering emotional turmoil that seizes hold and won't let go--these are some of the traits we associate with madness. Today, mental disturbance is most commonly viewed through a medical lens, but societies have also sought to make sense of it through religion or the supernatural, or by constructing psychological or social explanations in an effort to tame the demons of unreason. Madness in Civilization traces the long and complex history of this affliction and our attempts to treat it.\r\n\r\n\r\nBeautifully illustrated throughout, Madness in Civilization takes readers from antiquity to today, painting a vivid and often harrowing portrait of the different ways that cultures around the world have interpreted and responded to the seemingly irrational, psychotic, and insane. From the Bible to Sigmund Freud, from exorcism to mesmerism, from Bedlam to Victorian asylums, from the theory of humors to modern pharmacology, the book explores the manifestations and meanings of madness, its challenges and consequences, and our varied responses to it. It also looks at how insanity has haunted the imaginations of artists and writers and describes the profound influence it has had on the arts, from drama, opera, and the novel to drawing, painting, and sculpture.\r\n\r\n\r\nWritten by one of the world's preeminent historians of psychiatry, Madness in Civilization is a panoramic history of the human encounter with unreason","torrent":{"xt":"urn:btih:a768f1f3590776c6d5e11e3171fe131228338cc1","amp;dn":"Madness+in+Civilization+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a768f1f3590776c6d5e11e3171fe131228338cc1","infoHashBuffer":{"type":"Buffer","data":[167,104,241,243,89,7,118,198,213,225,30,49,113,254,19,18,40,51,140,193]},"announce":[],"urlList":[]}}