{"title":"David Kirby, Little Richard: The Birth of Rock 'n' Roll (PDF)","uid":12333722,"size":989724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a829dd12cf9fef848c7ae079abc23015bc385b44&amp;dn=David+Kirby%2C+Little+Richard%3A+The+Birth+of+Rock+%27n%27+Roll+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1441213919,"description":"A brilliant new biography of the extraordinary, outrageous performer who helped open the floodgates of Rock 'n' Roll. In June, 2007, Little Richard's 1955 Specialty Records single, &quot;&quot;Tutti Frutti,&quot;&quot; topped Mojo magazine's list of &quot;&quot;100 Records That Changed the World.&quot;&quot; But back in the early 1950s, nobody gave Little Richard a second glance. It was a time in America where the black and white worlds had co-existed separately for nearly two centuries. After &quot;&quot;Tutti Frutti,&quot;&quot; Little Richard began garnering fans from both sides of the civil rights divide. He brought black and white youngsters together on the dance floor and even helped to transform race relations. Little Richard: The Birth of Rock 'n' Roll begins by grounding the reader in the fertile soil from which Little Richard's music sprang. In Macon, Georgia, David Kirby interviews relatives and local characters, who knew Little Richard way back when, citing church and family as his true inspiration. His antics began as early as grade school, performing for his classmates every time the teacher would leave the room, connecting to an age-old American show biz tradition of charade and flummery. On the road, Little Richard faced competition from his peers, honing his stage show and making it, too, an act that could not be counterfeited. Kirby sees Little Richard as a foxy warrior, fighting with skill and cunning to take his place among the greats. In the words of Keith Richards (on hearing &quot;&quot;Tutti Frutti&quot;&quot; for the first time), &quot;&quot;it was as though the world changed suddenly from monochrome to Technicolor.&quot;&quot; Those sentiments have consistently been echoed by the music-listening world, and the time is ripe for a reassessment of Little Richard's genius and legacy","torrent":{"xt":"urn:btih:a829dd12cf9fef848c7ae079abc23015bc385b44","amp;dn":"David+Kirby%2C+Little+Richard%3A+The+Birth+of+Rock+%27n%27+Roll+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a829dd12cf9fef848c7ae079abc23015bc385b44","infoHashBuffer":{"type":"Buffer","data":[168,41,221,18,207,159,239,132,140,122,224,121,171,194,48,21,188,56,91,68]},"announce":[],"urlList":[]}}