{"title":"wowmimicii-3.0.0.82.264..","uid":5293330,"size":15044608,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a9105e72e5237069f19b6aa833407bf54084297a&amp;dn=wowmimicii-3.0.0.82.264..&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wullthebull","files":1,"time":1263971534,"description":"WoWMimic Elite\n\n    * Works with all Windows operating Systems (Xp, Vista, and Windows 7)\n    * Can load WoW by launching wow.exe from wowmimic, or by specifying by targeting the window.\n    * Supports many different languages of WoW Clients, English, French, German, Thaiwan, Chinese, Korean.\n    * Runs in the background automatically, play other games or run more bots at the same time.\n    * Can automatically reply to whispers with phrases and words you set\n    * Will not attack already tagged mobs, or even engage in tagged (by other players) mobs.\n    * Will not attempt to keep attacking bugged out mob, or bugged out loot\n    * Auto-Unstuck, so if your pathing happens to intercept with a rock, or obstacle: It will automatically move around in 4 different directions in attempt to get unstuck and back in the path.\n    * Can set level range of the mobs to attack, and filter out mobs by name.\n    * All classes supported, and spells can be anywhere on the action bars (Food &amp; Potions have unique slots)\n    * Patrols can be converted from other profiles, easy to create new ones also, just simply run your path on your character.\n    * Humanistic movement and turning.\n    * Auto login and logout feature. Bot users are able to set up the duration you want your bot to be on. (Pls note that the Time Unit is Minute)\n    * Will fight back when attacked by other players automatically.\n    * Fast and precise responses, fightings, and movement.\n    * Supports pet usage (feeding and healing also)\n    * Can fish and use bait (lure).\n    * Can skin, herb, mine and even open chests.\n    * Buys, sells, and repairs automatically to the specified vendor. Can sell based on item quality and name, can also use destroy based on item quality and name. Can also attack monsters on the way back or not.\n    * Will know when bags are full, and can return to town when they are full.\n    * Will know when durability is 0 (Fully Red) and can return to town when item piece is broken\n    * Can use ground mount and flying mount.\n    * Customizable Alarm system, warnings and more (Players nearby yard range specified, whispers, death, durability, bags full, out of food and water, etc. Can set sound file, or wowmimic to pop up and display the warning.\n    * Can use mail box to send mail to other characters\n    * Uses potions, health stones, soulstones, bandages, mana stones, etc\n    * Customizable spell options, talent specs, and can change out spells it uses through the SpellList file\n    * Can customize the percentage of when to drink, eat, pause and rest for health and mana. Leaving as default is fine.\n    * Can set the attack range in yards.\n    * Pathing is easy to make, just simply record it by running your character in game and watching each waypoint be recorded through the GUI (Graphic User Inteface)\n    * Sharable Pathing and configuration setups.\n\n","torrent":{"xt":"urn:btih:a9105e72e5237069f19b6aa833407bf54084297a","amp;dn":"wowmimicii-3.0.0.82.264..","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9105e72e5237069f19b6aa833407bf54084297a","infoHashBuffer":{"type":"Buffer","data":[169,16,94,114,229,35,112,105,241,155,106,168,51,64,123,245,64,132,41,122]},"announce":[],"urlList":[]}}