{"title":"Meg Wolitzer - De ontkoppeling. NL Ebook. DMT","uid":12540046,"size":1200418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa6e7e1113382eb87262bf0cfcf75783dedda4a8&amp;dn=Meg+Wolitzer+-+De+ontkoppeling.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mc3dom","files":4,"time":1444387565,"description":"Meg Wolitzer - De ontkoppeling. NL Ebook. DMT \r\n\r\nAfbeelding\r\n\r\nAuteur: Meg Wolitzer \r\nPagina's: 206\r\nTaal: Dutch/Nederlands\r\nUitgever: Xander B.V\r\nJaar van uitgifte: 2015\r\nGenre: Roman\r\n\r\nSamenvatting\r\n\r\nWat zou er gebeuren als alle vrouwen zich ineens zouden afkeren van intimiteit met hun mannen? Deze intrigerende vraag werd \r\nvoor het eerst gesteld in de Griekse tragedie Lysistrata en wordt door de bekroonde romanschrijfster Meg Wolitzer op meesterlijke \r\nwijze verplaatst naar het heden. Het kan geen toeval zijn dat juist op de school van het kleine stadje Stellar Plains de prikkelende \r\nGriekse komedie Lysistrata wordt ingestudeerd voor de jaarlijkse toneelopvoering. In dit eeuwenoude verhaal verenigden de vrouwen \r\nvan het strijdende Sparta en Athene zich onderling om hun mannen te dwingen de oorlog te beëindigen. De ontkoppeling speelt zich \r\naf in een moderne buitenwijk in New Jersey waar de vrouwen -een voor een- in een sprookjesachtige ban raken en zich afkeren van \r\nhun mannen. Robby en Dory Lang zijn een docentenechtpaar dat benijd wordt om hun goede, liefdevolle huwelijk. Toch is Dory een \r\nvan de eerste vrouwen die zich -als betoverd- van haar man afwendt, maar al snel volgt de rest van de vrouwelijke bevolking. Niemand\r\nbegrijpt de oorzaak en niemand weet hoe ze hun vertrouwde leven en gevoelens weer terug kan krijgen. De reactie onder de mannen \r\nover het verlies van intimiteit varieert van woede, verdriet en angst tot onverschilligheid voor de mannen die de verandering niet hebben \r\nopgemerkt. In welke levensfase je je ook bevindt, en wat je eigen ervaring ook is, iedereen zal zich kunnen identificeren \r\nmet iemand in deze even betoverende als enerverende roman.\r\n\r\nMet dank aan de originele poster !! \r\n\r\nDeze review wordt u aangeboden door\r\n\r\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:aa6e7e1113382eb87262bf0cfcf75783dedda4a8","amp;dn":"Meg+Wolitzer+-+De+ontkoppeling.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa6e7e1113382eb87262bf0cfcf75783dedda4a8","infoHashBuffer":{"type":"Buffer","data":[170,110,126,17,19,56,46,184,114,98,191,12,252,247,87,131,222,221,164,168]},"announce":[],"urlList":[]}}