{"title":"My Sisters Keeper (2009) PAL Retail DD5.1 2Lions-Team","uid":5294079,"size":4699428454,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:aac1d1a41ff5cd2332e39b505297eee4aa5e39a1&amp;dn=My+Sisters+Keeper+%282009%29+PAL+Retail+DD5.1+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1263998781,"description":"My Sisters Keeper (2009) PAL Retail DD5.1\n\nDrama / Romantiek\n\nDit is een freeleech torrent, het is niet verplicht deze torrent door te delen maar wel zo sociaal en goed voor je ratio en neem ook de regels in acht zoals onderop de torrent vermeld staat!\n\n\n\nVerenigde Staten\nDrama\n109 minuten\n\ngeregisseerd door Nick Cassavetes\nmet Cameron Diaz, Abigail Breslin en Alec Baldwin\n\nKate (Sofia Vassilieva) en Anna (Abigail Breslin) hebben een band die hechter is dan die van de meeste zusjes: hoewel Kate ouder is, is ze afhankelijk van haar kleine zusje. Haar leven ligt zelfs in de handen van Anna. Tijdens hun jonge leven ondergaan de zusjes verscheidene medische procedures en verblijven ze veel in het ziekenhuis. Het hoort allemaal bij het anders normale leven van deze hechte familie. Sara (Cameron Diaz) is een liefhebbende echtgenote en moeder die haar carriÃƒÂ¨re als advocaat heeft opgegeven om voor haar dochter te zorgen. Ze verliest zichzelf soms in haar rol als de toegewijde zorgverlener die ze is geworden in haar strijd om Kate te redden. Haar sterke, steunende echtgenoot Brian (Jason Patric), voelt zich vaak machteloos en passief in de schaduw van de kracht en de vastberadenheid van zijn vrouw. En hun enige zoon Jesse (Evan Ellingson) voelt zich onzichtbaar terwijl Kate en Anna alle aandacht krijgen.\n\nEnglish\n\nIn Los Angeles, the eleven year old Anna Fitzgerald seeks the successful lawyer Campbell Alexander trying to hire him to earn medical emancipation from her mother Sara that wants Anna to donate her kidney to her sister. She tells the lawyer the story of her family after the discovery that her older sister Kate has had leukemia; how she was conceived by in vitro fertilization to become a donor; and the medical procedures she has been submitted since she was five years old to donate to her sister. Campbell accepts to work pro bono and the obsessed Sara decides to go to court to force Anna to help her sister\n\n\n******************************************\n\n\nSource:....: Bright Star (2009) LIMITED DVDR-DEPRAViTY\nSource.....: R2 PAL DVD9\nVideo......: CCE 6 @ 5483 kbps\nAudio......: English, German, Italiaans DD 5.1 \nSubs.......: English, German, Potugees Dutch\n\nWeblink  : http://www.moviemeter.nl/film/54718\nWeblinkk : http://www.imdb.com/title/tt1078588\n\n***************************************** \n\nBrought to you by\n2Lions Team \n\n           &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de flim binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\t\n\n\n","torrent":{"xt":"urn:btih:aac1d1a41ff5cd2332e39b505297eee4aa5e39a1","amp;dn":"My+Sisters+Keeper+%282009%29+PAL+Retail+DD5.1+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac1d1a41ff5cd2332e39b505297eee4aa5e39a1","infoHashBuffer":{"type":"Buffer","data":[170,193,209,164,31,245,205,35,50,227,155,80,82,151,238,228,170,94,57,161]},"announce":[],"urlList":[]}}