{"title":"Deep Purple - Under the Gun [promo].VOB","uid":12544994,"size":256350208,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aae3355d90c4ed80ca3a6cb6136218e29268c2d3&amp;dn=Deep+Purple+-+Under+the+Gun+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":1,"time":1444458992,"description":"Deep Purple - Under the Gun [promo].VOB\r\n\r\n\r\nHQ rare music video from a promo DVD. &quot;Under the Gun&quot; is a song from  Perfect Strangers, the eleventh studio album by Deep Purple, released in October 1984. It represents the first album recorded by the reformed (as well as the most successful and popular), 'Mark II' line-up.\r\n\r\nIt was the first Deep Purple studio album in nine years, and the first with the Mk II line-up for eleven years, the last being Who Do We Think We Are in 1973. Ritchie Blackmore and Roger Glover arrived from Rainbow, Ian Gillan from Black Sabbath, Jon Lord from Whitesnake, and Ian Paice from Gary Moore's backing band.\r\n\r\nThe CD and cassette versions of the album contained the extra track &quot;Not Responsible&quot; (one of few Deep Purple songs with profane lyrics, as the word &quot;fucking&quot; can be heard in the song). The album was remastered and reissued on 22 June 1999 with the bonus instrumental track &quot;Son of Alerik&quot;. The latter had previously been available as a B-side on &quot;Perfect Strangers&quot; in 1984.\r\n\r\nThe tour was so successful that the band had to add many additional dates to the US arena tour, as tickets sold out very quickly. Their US tour in 1985 out-grossed every artist that year except Bruce Springsteen.\r\n\r\n\r\nDeep Purple are an English rock band formed in Hertford in 1968. They are considered to be among the pioneers of heavy metal and modern hard rock, although their musical approach changed over the years. Originally formed as a progressive rock band, the band shifted its sound to hard rock in 1970, and in 2013 began exploring progressive metal. Deep Purple, together with Led Zeppelin and Black Sabbath, have been referred to as the &quot;unholy trinity of British hard rock and heavy metal in the early to mid-Seventies&quot;. They were listed in the 1975 Guinness Book of World Records as &quot;the globe's loudest band&quot; for a 1972 concert at London's Rainbow Theatre, and have sold over 100 million albums worldwide.\r\n\r\nDeep Purple have had several line-up changes and an eight-year hiatus (1976–1984). The 1968–1976 line-ups are commonly labelled Mark I, II, III and IV. Their second and most commercially successful line-up featured Ian Gillan (vocals), Jon Lord (organ), Roger Glover (bass), Ian Paice (drums), and Ritchie Blackmore (guitar). This line-up was active from 1969 to 1973, and was revived from 1984 to 1989, and again from 1992 to 1993. The band achieved more modest success in the intervening periods between 1968 and 1969 with the line-up including Rod Evans (vocals) and Nick Simper (bass, backing vocals), between 1974 and 1976 (Tommy Bolin replacing Blackmore in 1975) with the line-up including David Coverdale (vocals) and Glenn Hughes (bass, vocals), and between 1989 and 1992 with the line-up including Joe Lynn Turner (vocals). The band's line-up (currently featuring Ian Gillan, and guitarist Steve Morse from 1994) has been much more stable in recent years, although organist Jon Lord's retirement from the band in 2002 (being succeeded by Don Airey) left Ian Paice as the only original Deep Purple member still in the band.\r\n\r\nDeep Purple were ranked number 22 on VH1's Greatest Artists of Hard Rock programme and a poll on British radio station Planet Rock ranked them 5th among the &quot;most influential bands ever&quot;. The band received the Legend Award at the 2008 World Music Awards. In October 2012, Deep Purple were nominated for induction into the Rock and Roll Hall of Fame, but were not voted in the following March. In October 2013, the band was announced as a Hall of Fame nominee for a second time, but again was not voted in.\r\n*(video has a studio time counter at the bottom center of the screen)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Perfect_Strangers_(album) \r\n      \nhttp://postimg.org/image/di0la2fox/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x576 (4:3) 25fps 5729kbps\r\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\r\n   Duration: 00:05:29\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:aae3355d90c4ed80ca3a6cb6136218e29268c2d3","amp;dn":"Deep+Purple+-+Under+the+Gun+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae3355d90c4ed80ca3a6cb6136218e29268c2d3","infoHashBuffer":{"type":"Buffer","data":[170,227,53,93,144,196,237,128,202,58,108,182,19,98,24,226,146,104,194,211]},"announce":[],"urlList":[]}}