{"title":"The Legacy of Lawrence of Arabia E01 H.264","uid":5286174,"size":677758014,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ab4438f311055ae2aeacccd89b8a7d2b47832621&amp;dn=The+Legacy+of+Lawrence+of+Arabia+E01+H.264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Topunit","files":-1,"time":1263733778,"description":"In the First World War, T.E Lawrence helped to unite feuding Arab tribes into a formidable guerrilla army which helped to topple the Ottoman Empire. But today Lawrence has an extraordinary new relevance. His experiences of defeating a foreign military occupation, and of leading an insurgency, have led to him being held up as the man who cracked fighting in the Middle East.\n\nHarvard Professor Rory Stewart is a former soldier, diplomat and governor of two Iraqi provinces. Rory has spent many years living and working in Iraq and Afghanistan, and has been fascinated with Lawrence since his childhood. In these two films, he examines the legacy of Britain's First World War campaign in the Middle East, and draws parallels with British and American interventions in Iraq and Afghanistan today.\n\nBut for Rory, Lawrence's story has a much darker message than is normally portrayed - Lawrence might have won his war in the desert and been hailed a warrior hero, but the politics that followed fatally undermined his success.\n\nLawrence had aimed, he said, 'to write his will across the skies' and build a new independent Arab nation, but in these two films Rory Stewart shows how Lawrence felt his dream ended in catastrophe and shame.\n\nDrawing a comparison between Lawrence's experience and today, Rory explains how Lawrence came to the conclusion that foreign military interventions in the Middle East are fundamentally unworkable. He concludes, 'Looking at Iraq and Afghanistan today, I believe very strongly that Lawrence's message would not have been do it better, do it more sensitively, but don't do it at all.'.\n\nVideo\nLength: 1 hour\nFrame width/height: 832x468\nData rate: 1402kbps\nTotal bitrate: 1527kbps\nFrame rate: 25 frames/second\n\nAudio\nBitrate: 125kbps\nChannels: 2 (stereo)\nAudio sample rate: 48 kHz","torrent":{"xt":"urn:btih:ab4438f311055ae2aeacccd89b8a7d2b47832621","amp;dn":"The+Legacy+of+Lawrence+of+Arabia+E01+H.264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab4438f311055ae2aeacccd89b8a7d2b47832621","infoHashBuffer":{"type":"Buffer","data":[171,68,56,243,17,5,90,226,174,172,204,216,155,138,125,43,71,131,38,33]},"announce":[],"urlList":[]}}