{"title":"Absolute.Evil.2009.DVDRip.XviD-MTRG.TRimneLL","uid":5301062,"size":748518389,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac9acb447ef90e046e48dc21b60ff242b45fbfe0&amp;dn=Absolute.Evil.2009.DVDRip.XviD-MTRG.TRimneLL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TRimneLL","files":4,"time":1264227206,"description":"IMDB Rating:  5.9/10   68 votes\nDirector: Ulli Lommel\nWriter: Ulli Lommel\nRelease Date: 8 February 2009\nGenre: Drama | Thriller\nCast: David Carradine, Carolyn Neff, Rusty Joiner, Ulli Lommel Christopher Kriesa, Elissa Dowling, Mark Irvingsen, Jamie Bernadette\n     \nPlot:\nSouthern Texas. Savannah and Cooper, a young couple in love, drive through the desert in a black 70s Cadillac convertible. Unaware that they are being followed, they check into a motel at the Mexican border. When Savannah leaves to buy food, a cop sneaks into the room,pulls his gun on Cooper, accuses him of murder and tries to arrest him. But Savannah, who had become suspicious, manages to turn the tables: She surprises the cop, ties him up and frees Cooper. But just as the\nyoung lovers jump into their car, a stranger steps out of the shadows and kills Cooper at point blank... Three weeks later. Hollywood, California. In a hotel suite overlooking the Sunset Strip, a man is being water boarded by a private detective. The information he needs is: &quot;Who killed Babyface?&quot; When the man refuses to cooperate and shows nothing but contempt for his captor, the torture continues. Layer by layer, the truth about Cooper alias Babyface is revealed. A complex web of murder, revenge, atonement and forgiveness unfolds, culminating in the ultimate question: What is the definition of absolute evil?","torrent":{"xt":"urn:btih:ac9acb447ef90e046e48dc21b60ff242b45fbfe0","amp;dn":"Absolute.Evil.2009.DVDRip.XviD-MTRG.TRimneLL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac9acb447ef90e046e48dc21b60ff242b45fbfe0","infoHashBuffer":{"type":"Buffer","data":[172,154,203,68,126,249,14,4,110,72,220,33,182,15,242,66,180,95,191,224]},"announce":[],"urlList":[]}}