{"title":"Deep Purple - King of Dreams [promo].VOB","uid":12544826,"size":328597504,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ad71e156965a6117f859f2945244ea7d7981b703&amp;dn=Deep+Purple+-+King+of+Dreams+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":1,"time":1444455801,"description":"Deep Purple - King of Dreams [promo].VOB\r\n\r\n\r\nHQ rare music video from a promo DVD.  &quot;King of Dreams&quot; is a song from  Slaves and Masters, the thirteenth studio album by Deep Purple, and was released on 5 October 1990. This is the only Deep Purple album to feature former Rainbow lead vocalist Joe Lynn Turner, who joined the previous year.\r\n\r\nBefore hiring Turner, the band had considered singer Jimi Jamison of Survivor, but other obligations made him unavailable. Following its release, Slaves and Masters peaked at No. 87 on the Billboard 200. The album dramatically sold below expectations, as compared to Deep Purple's previous album, The House of Blue Light with vocalist Ian Gillan, which charted at No. 34. Fans of Deep Purple's earlier efforts thought the vocal parts ended up being too melodic.\r\n\r\nDespite underwhelming album sales, Deep Purple had a relatively successful tour in support of Slaves and Masters in 1991, especially for the band's European leg. Turner was still a member of the group when they began recording their next album in 1992, but under duress from management, Deep Purple ultimately decided to bring back Ian Gillan to the line-up for their 1993 studio album The Battle Rages On... A handful of working tracks originally intended for the follow-up to Slaves and Masters would turn up on subsequent solo releases by Turner.\r\n\r\nThe album was promoted on television with professional music videos to the songs &quot;King of Dreams&quot; and &quot;Love Conquers All&quot;. Both featured members of the band. The video for &quot;King of Dreams&quot; was shot at Santa Cruz Beach Boardwalk.\r\n\r\n\r\nDeep Purple are an English rock band formed in Hertford in 1968. They are considered to be among the pioneers of heavy metal and modern hard rock, although their musical approach changed over the years. Originally formed as a progressive rock band, the band shifted its sound to hard rock in 1970, and in 2013 began exploring progressive metal. Deep Purple, together with Led Zeppelin and Black Sabbath, have been referred to as the &quot;unholy trinity of British hard rock and heavy metal in the early to mid-Seventies&quot;. They were listed in the 1975 Guinness Book of World Records as &quot;the globe's loudest band&quot; for a 1972 concert at London's Rainbow Theatre, and have sold over 100 million albums worldwide.\r\n\r\nDeep Purple have had several line-up changes and an eight-year hiatus (1976–1984). The 1968–1976 line-ups are commonly labelled Mark I, II, III and IV. Their second and most commercially successful line-up featured Ian Gillan (vocals), Jon Lord (organ), Roger Glover (bass), Ian Paice (drums), and Ritchie Blackmore (guitar). This line-up was active from 1969 to 1973, and was revived from 1984 to 1989, and again from 1992 to 1993. The band achieved more modest success in the intervening periods between 1968 and 1969 with the line-up including Rod Evans (vocals) and Nick Simper (bass, backing vocals), between 1974 and 1976 (Tommy Bolin replacing Blackmore in 1975) with the line-up including David Coverdale (vocals) and Glenn Hughes (bass, vocals), and between 1989 and 1992 with the line-up including Joe Lynn Turner (vocals). The band's line-up (currently featuring Ian Gillan, and guitarist Steve Morse from 1994) has been much more stable in recent years, although organist Jon Lord's retirement from the band in 2002 (being succeeded by Don Airey) left Ian Paice as the only original Deep Purple member still in the band.\r\n\r\nDeep Purple were ranked number 22 on VH1's Greatest Artists of Hard Rock programme and a poll on British radio station Planet Rock ranked them 5th among the &quot;most influential bands ever&quot;. The band received the Legend Award at the 2008 World Music Awards. In October 2012, Deep Purple were nominated for induction into the Rock and Roll Hall of Fame, but were not voted in the following March. In October 2013, the band was announced as a Hall of Fame nominee for a second time, but again was not voted in.\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Slaves_and_Masters \r\n      \nhttp://postimg.org/image/86h6grz51/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8264kbps\r\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\r\n   Duration: 00:04:45\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee) \r\n\t\r\n\r\n\r\nMy other uploads from this band:\r\n \nhttp://thepiratebay.vg/torrent/11267998/Deep_Purple_-_Smoke_on_the_Water_[original_promo].VOB\r\n \nhttps://thepiratebay.vg/torrent/12171748/Deep_Purple_-_Strange_Kind_of_Woman_[promo].VOB\r\n \nhttp://thepiratebay.vg/torrent/11775321/Deep_Purple_-_Wasted_Sunsets_[promo].VOB\r\n \nhttp://thepiratebay.se/torrent/6183050/Deep_Purple_-_Woman_from_Tokyo_[promo].VOB","torrent":{"xt":"urn:btih:ad71e156965a6117f859f2945244ea7d7981b703","amp;dn":"Deep+Purple+-+King+of+Dreams+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad71e156965a6117f859f2945244ea7d7981b703","infoHashBuffer":{"type":"Buffer","data":[173,113,225,86,150,90,97,23,248,89,242,148,82,68,234,125,121,129,183,3]},"announce":[],"urlList":[]}}