{"title":"Eyes Wide Fucked Part 1&amp;Part 2-KinkTestShoot 13827&amp;13828","uid":12621629,"size":1541344313,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b097c99ca62687b1184c3bc7d3373b9f0a92cb3d&amp;dn=Eyes+Wide+Fucked+Part+1%26amp%3BPart+2-KinkTestShoot+13827%26amp%3B13828&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chunnuan","files":35,"time":1445602791,"description":"kink.com shootid: 13827 &amp; 13828 from Kink.com \r\n\r\nJul 29, 2011 - Mark Davis , James Deen , Lexi Belle , Phoenix Marie , Gia DiMarco , Iona Grace and Marco Banderas\r\n\r\nScreens:part1: http://www.kink.com/shoot/13827 or  \nhttp://www.kinkondemand.com/kod/shoot/13827-Kink-Swing-Presents-Eyes-Wide-Fucked-Part-One.html\r\n\r\nScreens:part2: http://www.kink.com/shoot/13828 or \nhttp://www.kinkondemand.com/kod/shoot/13828-Eyes-Wide-Fucked-pt-2-the-Porn-Star-Orgy.html\r\n\r\nJoin Kink Swing as we open our doors to one of the sexiest and wildest parties the castle has ever seen. Set on the lavish Upper Floor, the lounge is packed from wall to wall with Kink favorites like Lexi Belle and Phoenix Marie intermingling with real, authentic swingers in a glorious sweaty fuck festival.\r\n\r\nThe night starts out with a floor show to set the mood, featuring Iona Grace, Gia DiMarco, Mark Davis, and Marco Banderas. The foursome suck, fuck, and swap partners as onlookers begin to unzip their clothes and get down to business. The party explodes into full swing as Sloane and Wolf Hudson begin to fuck while another party goer has a [REDACTED] orgasm; by the time the girl is done cumming, Phoenix Marie and Lexi Belle are getting a workout in the middle of an orgy that results in a broken couch and cum covered girls.\r\n\r\nThis is only the beginning of one of the raunchiest swinger parties you'll ever witness. \r\n\r\nThe Second half starts out with a Phoenix Marie doing a Fire Play scene while sucking Cock and fucking. The crowd starts getting heated up and a party goer emabarks on a fisting train run by James Deen, Princess Donna, and Mickey Mod. Matt Williams jumps into the action and does some G spot stimulation with Rain Degray on Iona Grace, leaving her coated in her own juices. Eden Alexander is also fisted by multiple party goers as the party gets even wilder leading up to a hot orgy climax with Lexi Belle, Phoenix Marie, Princess Donna and Gia Di Marco all switching partners, double BJs, fisting, and cumming on each other. Lexi Belle Fists Phoenix and James Deen closes the party out with an acrobatic pop shot that sprays 3 girls in the face with one pop shot. Make sure to cum into one of the hottest swinger parties ever filmed","torrent":{"xt":"urn:btih:b097c99ca62687b1184c3bc7d3373b9f0a92cb3d","amp;dn":"Eyes+Wide+Fucked+Part+1%26amp%3BPart+2-KinkTestShoot+13827%26amp%3B13828","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b097c99ca62687b1184c3bc7d3373b9f0a92cb3d","infoHashBuffer":{"type":"Buffer","data":[176,151,201,156,166,38,135,177,24,76,59,199,211,55,59,159,10,146,203,61]},"announce":[],"urlList":[]}}