{"title":"Call of Duty Modern Warfare 2  [Pateform]","uid":5283744,"size":25744646,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b38dba918058ee386144c04abfe06916fc750d10&amp;dn=Call+of+Duty+Modern+Warfare+2++%5BPateform%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dangirdas","files":42,"time":1263600468,"description":"***********************************************\n\nCall of Duty - Modern Warfare 2 Online v1.0.174\n\n***********************************************\nPlatforms: PC\nRelease Date: November 10, 2009\n\nCall of Duty: Modern Warfare 2 is a first-person shooter video game developed by Infinity Ward and published by Activision for Microsoft Windows, PlayStation 3, and Xbox 360. Officially announced on February 11, 2009, the game was released worldwide on November 10, 2009. It is the sixth installment of the Call of Duty series and the direct sequel to Call of Duty 4: Modern Warfare, continuing along the same storyline. It was released in conjunction with two other Call of Duty games: Call of Duty: Modern Warfare: Mobilized for the Nintendo DS, and Call of Duty: Modern Warfare: Reflex, a port of Call of Duty 4 adapted by Treyarch for the Wii console. In addition, a comic book series based on one of the game's characters will also be produced, entitled Modern Warfare 2: Ghost.\n\nThe game takes place five years after the previous installment. The campaign mode is divided between the multinational counter-terrorist group, Task Force 141, which is tasked with eliminating ultranationist Vladimir Makarov, and the U.S. Army Rangers, who are tasked with defending the United States from an audacious Russian invasion. Settings for the game include Afghanistan, Rio de Janeiro, Siberia, and Washington D.C.\n\nModern Warfare 2 has received highly positive reviews from various gaming websites, attaining a 94% aggregate score on Metacritic, with praise stemming primarily from its in-depth multiplayer component. Upon its release, the game sold approximately 4.7 million copies worldwide in 24 hours.\n\nOn November 10, 2009, Infinity Ward's Modern Warfare 2 will strike worldwide. The most-anticipated game of the year and the sequel to the best-selling first-person action game of all time, Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse.\n\nGame Features:\n\n    * Epic single-player campaign picks up immediately following the thrilling events from Call of Duty 4: Modern Warfare.\n    * The definitive multiplayer experience returns, with a host of new perks and enhancements.\n    * New cooperative SpecOps mode, the perfect combination of Modern Warfare's single-player intensity and the addictive replayability of its multiplayer.","torrent":{"xt":"urn:btih:b38dba918058ee386144c04abfe06916fc750d10","amp;dn":"Call+of+Duty+Modern+Warfare+2++%5BPateform%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b38dba918058ee386144c04abfe06916fc750d10","infoHashBuffer":{"type":"Buffer","data":[179,141,186,145,128,88,238,56,97,68,192,74,191,224,105,22,252,117,13,16]},"announce":[],"urlList":[]}}