{"title":"Bee Gees - You Should Be Dancing [Top Pop, 1976].VOB","uid":12544811,"size":142454784,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b3cc12c82faa634de36b4c2dfc56fef864948088&amp;dn=Bee+Gees+-+You+Should+Be+Dancing+%5BTop+Pop%2C+1976%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SgtRlee","files":1,"time":1444455399,"description":"Bee Gees - You Should Be Dancing [Top Pop, 1976].VOB\r\n\r\n\r\nHQ rare music video from a promo DVD. &quot;You Should Be Dancing&quot; is a single by the Bee Gees, from the album Children of the World, released in 1976. It hit #1 for one week on the American Billboard Hot 100, #1 for seven weeks on the US Hot Dance Club Play chart, and in July the same year, reached #5 on the UK Singles Chart. The song also peaked at #4 on the Billboard R&amp;B chart. It was this song that first launched the Bee Gees into disco. It was also the only track from the group to top the dance chart.\r\n\r\n&quot;You Should Be Dancing&quot; was recorded January 19, February 1 and 8, and May 6, 1976 with Barry Gibb providing lead vocals in falsetto. Barry had developed his falsetto to an incredible degree in the ten months since the release of &quot;Baby As You Turn Away&quot; from the Main Course album on which he sang a full song in falsetto for the first time (except for its chorus). Keyboardist Blue Weaver recalls that Maurice Gibb wrote the bass line and sang the horn parts to the brass players, while Barry sang parts for Weaver to play, while guitarist Alan Kendall got in a short guitar solo for its instrumental break.\r\n\r\nStephen Stills was also at Criteria Studios recording the album Long May You Run with his band and Neil Young. Stills added percussion on the song's February sessions. Members of Stills's backing band, George Perry (bass) and Joe Lala (percussion), also worked with the Bee Gees on some songs.\r\n\r\nThe song was their third Billboard Hot 100 #1 and their sixth #1 in Canada. It ended as the #31 song of the year. In the '70s some of the Bee Gees' songs were deemed too uptempo for AC/Easy Listening Radio which led to &quot;You Should Be Dancing&quot; only reaching #25 on that chart. It also hit #4 in Ireland. In Australia, where the brothers spent a number of years in their youth, it managed only to nick the top 20.\r\n\r\n\r\nThe Bee Gees were a pop music group formed in 1958. The group's line-up consisted of brothers Barry, Robin, and Maurice Gibb. The trio were successful for most of their decades of recording music, but they had two distinct periods of exceptional success: as a popular music act in the late 1960s and early 1970s, and as prominent performers of the disco music era in the late 1970s. The group sang recognisable three-part tight harmonies; Robin's clear vibrato lead vocals were a hallmark of their earlier hits, while Barry's R&amp;B falsetto became their signature sound during the late 1970s and 1980s. They wrote all of their own hits, as well as writing and producing several major hits for other artists.\r\n\r\nBorn on the Isle of Man to English parents, the Gibb brothers lived in Chorlton, Manchester, England, until the late 1950s, and formed the Rattlesnakes. The family then moved to Redcliffe, in Queensland, Australia, and then to Cribb Island. After achieving their first chart success in Australia as the Bee Gees with &quot;Spicks and Specks&quot; (their 12th single), they returned to the UK in January 1967 where producer Robert Stigwood began promoting them to a worldwide audience.\r\n\r\nFollowing Maurice's sudden death in January 2003 at the age of 53, Barry and Robin retired the group's name after 45 years of activity. In 2009 Robin announced that he and Barry had agreed that the Bee Gees would re-form and perform again. Robin died in May 2012 at the age of 62, after a prolonged struggle with cancer and other health problems, leaving Barry as the lone surviving member of the group.\r\n\r\nAt one point in 1978, the Gibb brothers were responsible for writing and/or performing nine of the songs in the Billboard Hot 100. In all, the Gibbs placed 13 singles onto the Hot 100 in 1978, with 12 making the Top 40. The Gibb brothers are fellows of the British Academy of Songwriters, Composers and Authors (BASCA). At least 2,500 artists have recorded their songs. Their most popular composition is &quot;How Deep Is Your Love&quot;, with 400 versions by other artists in existence.\r\n\r\nThe Bee Gees have sold more than 220 million records worldwide, making them one of the world's best-selling music artists of all time. \r\nThey were inducted into the Rock and Roll Hall of Fame in 1997; the presenter of the award to &quot;Britain's first family of harmony&quot; was Brian Wilson, historical leader of the Beach Boys, a &quot;family act&quot; also featuring three harmonising brothers. The Bee Gees' Hall of Fame citation says &quot;Only Elvis Presley, the Beatles, Michael Jackson, Garth Brooks and Paul McCartney have outsold the Bee Gees.&quot;\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/You_Should_Be_Dancing \r\n      \nhttp://postimg.org/image/7q48p1z69/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x576 (4:3) 25fps 5866kbps\r\n   Audio: Dolby Digital AC3 48000Hz stereo 256kbps\r\n   Duration: 00:03:02\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee) \r\n\t\r\n\r\n\r\nMy other uploads from this band:\r\n \nhttp://thepiratebay.vg/torrent/6173171/Bee_Gees_-_Night_Fever_[promo].VOB\r\n \nhttp://thepiratebay.vg/torrent/5943961/Bee_Gees_-_Stayin__Alive_[promo].VOB","torrent":{"xt":"urn:btih:b3cc12c82faa634de36b4c2dfc56fef864948088","amp;dn":"Bee+Gees+-+You+Should+Be+Dancing+%5BTop+Pop%2C+1976%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3cc12c82faa634de36b4c2dfc56fef864948088","infoHashBuffer":{"type":"Buffer","data":[179,204,18,200,47,170,99,77,227,107,76,45,252,86,254,248,100,148,128,136]},"announce":[],"urlList":[]}}