{"title":"Grand Theft Auto: Chinatown Wars -v1.0 - iPhone IPA","uid":5292840,"size":192546477,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:b40e0f12326314d7ffe5dfc88962d8e7cb24dd02&amp;dn=Grand+Theft+Auto%3A+Chinatown+Wars+-v1.0+-+iPhone+IPA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"killps2","files":11,"time":1263951000,"description":"[quote]\n[img]http://i.i.com.com/cnwk.1d/i/bto/20100119/Grand_Theft_Auto_Chinatown_Wars_iPhone.png[/img]\n\nChinatown Wars ranks among the top-rated and most popular titles ever for both Nintendo DS and Sony PlayStation Portable, and its iPhone counterpart is sure to enjoy similar success.\nFor those unfamiliar with GTA games, Chinatown Wars plays like an interactive John Woo movie. As the son of a murdered gang boss, you must complete various missions on the sprawling, ultra-violent streets of Liberty City.\nMost of these involve driving from one place to another, often while evading police pursuit. But there's also on-foot gunplay, fistfights, and other mayhem.\n\nA profanity-laden plot weaves its way through the game, as does a rap-heavy soundtrack. In short, Chinatown Wars is pure Grand Theft Auto.\nThat's a good thing--a very good thing--if you're a fan of the series. And even if you're new to GTA, it's easy to get hooked on the game's &quot;open&quot; nature: You can roam the streets of Liberty City as you please, mowing down pedestrians in car-jacked cars, dealing drugs, getting into fights, and so on.\n \nChinatown Wars' controls are about as good as can be expected: an onscreen joystick and punch/jump/kick buttons for pants-on-the-ground action, and left/right steering and accelerate/brake buttons for driving. The game's clever steering-assist option keeps your car going straight until you make a turn, though I found myself over-steering wildly until I got the hang of it--which took about 10 seconds.\nAs it happens, I'm just now making my way through Grand Theft Auto IV on the PC. Consequently, Chinatown Wars seems small and claustrophobic--perhaps owing to the top-down view and perhaps because my iPhone's screen is tiny compared with my 22-inch LCD.\nI also miss the rich voice acting and ground-level perspective of the PC/console games. Still, I like Chinatown Wars, and I bet that other GTA fans will like it too.\n[/quote]\n--------------===================---------------------=================\nrequires 3.1.2, tested and confirmed working. If you cant  get it working, it's your own fault. Sync with itunes or ssh to var/mobile/downloads and install with xipa or installous","torrent":{"xt":"urn:btih:b40e0f12326314d7ffe5dfc88962d8e7cb24dd02","amp;dn":"Grand+Theft+Auto%3A+Chinatown+Wars+-v1.0+-+iPhone+IPA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b40e0f12326314d7ffe5dfc88962d8e7cb24dd02","infoHashBuffer":{"type":"Buffer","data":[180,14,15,18,50,99,20,215,255,229,223,200,137,98,216,231,203,36,221,2]},"announce":[],"urlList":[]}}