{"title":"Madness - Shut Up [promo].VOB","uid":12544822,"size":253450240,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b49d6bcbe3b91abdb0714fc226a3871c74a5df94&amp;dn=Madness+-+Shut+Up+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SgtRlee","files":1,"time":1444455672,"description":"Madness - Shut Up [promo].VOB\r\n\r\n\r\nHQ rare music video from a promo DVD. &quot;Shut Up&quot; is a pop song written by Suggs and Chris Foreman. It was recorded by British pop/ska band Madness, and was featured on the band's third album 7. It was released as a single on September 11, 1981, spending 10 weeks in the UK Singles Chart. It reached a high position of number 7.\r\n\r\nThe song tells a story of a criminal who, despite obvious evidence, tries to convince people he is not guilty. Even though the song is called &quot;Shut Up&quot;, the two words do not appear in the lyrics at all. However, they were the final words of an additional verse which was part of an early version of the song.\r\n\r\nThe promotional video for the single released featured the band dressed as a group of criminals, then later as police officers, while lead singer Suggs remained dressed as a villain. In one sequence, the costumed band gather round as Chris Foreman (in police uniform) plays the song's guitar solo on the &quot;Super Yob&quot; guitar, previously owned by Dave Hill of Slade.\r\n\r\nIn addition to its single release and appearance on the album 7, &quot;Shut Up&quot; also appears on the Madness collections Complete Madness, It's... Madness Too, The Business, Divine Madness (a.k.a. The Heavy Heavy Hits) and Our House. It also features on two US Madness compilations, Madness and Total Madness.\r\n\r\n\r\nMadness are an English ska band from Camden Town, London, that formed in 1976. One of the most prominent bands of the late 1970s and early 1980s 2 Tone ska revival, they continue to perform with their most recognised line-up of seven members.\r\n\r\nMadness achieved most of their success in the early to mid-1980s. Both Madness and UB40 spent 214 weeks on the UK singles charts over the course of the decade, holding the record for most weeks spent by a group in the 1980s UK singles charts. However, Madness achieved this in a shorter time period (1980–1986).\r\n\r\nMadness have had 15 singles reach the UK top ten, one UK number one single (&quot;House of Fun&quot;) and two number ones in Ireland, &quot;House of Fun&quot; and &quot;Wings of a Dove&quot;.\r\n\r\nThe band's first notable musical award came in 1983 when Chris Foreman and Cathal Smyth won an Ivor Novello Award for Best Song for the international hit &quot;Our House&quot;. Madness received another Ivor Novello Award 17 years later for an &quot;Outstanding Song Collection&quot;. In 2005, they were awarded the MOJO &quot;Hall of Fame&quot; Award, notably for being &quot;an artist's artist&quot;. In 2007, a campaign took place by fans of Madness for the band to be awarded a Brit Award. Many fans and critics feel they have been overlooked over their past 30 years in the music industry. In July 2009, Madness were awarded the 'Silver Clef' Icon Award. In September 2010, Madness were awarded the 'Idol Award' at the 2010 Q Awards in London.\r\n*(video does not have any logos)*\r\n\r\n\r\n    \nhttp://en.wikipedia.org/wiki/Shut_Up_(Madness_song) \r\n      \nhttp://postimg.org/image/ew59nvfg1/ \r\n   \r\n\r\n\r\nFile properties info using Media Player Classic:     \r\n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\r\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\r\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps (commentary)\r\n   Duration: 00:03:42\r\n\r\n\r\n\r\n\r\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \r\nor for better visual and audio quality playback of all your videos. \r\nIt's 100% free to download and use. Latest stable build is v1.7.9\r\n\r\n*Media Player Classic Home Cinema*         \nhttp://mpc-hc.org/ \r\n\r\nSgtRlee (Sgt.R.Lee) \r\n\t\r\n\r\n\r\nMy other uploads from this band:\r\n \nhttp://thepiratebay.vg/torrent/6719261/Madness_-_Uncle_Sam_[promo].VOB\r\n \nhttp://thepiratebay.vg/torrent/8908158/Madness_-_Sweetest_Girl_[promo].VOB\r\n \nhttp://thepiratebay.vg/torrent/6105666/Madness_-_Driving_in_My_Car_[promo].VOB\r\n \nhttp://thepiratebay.vg/torrent/7800186/Madness_-_Drip_Fed_Fred_[promo].VOB","torrent":{"xt":"urn:btih:b49d6bcbe3b91abdb0714fc226a3871c74a5df94","amp;dn":"Madness+-+Shut+Up+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b49d6bcbe3b91abdb0714fc226a3871c74a5df94","infoHashBuffer":{"type":"Buffer","data":[180,157,107,203,227,185,26,189,176,113,79,194,38,163,135,28,116,165,223,148]},"announce":[],"urlList":[]}}