{"title":"Sugar Series 13 - The Chemistry and Technology of Furfural and I","uid":12574292,"size":10940919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8058fdbea431b6507c82e14e30c6d1995adcc5f&amp;dn=Sugar+Series+13+-+The+Chemistry+and+Technology+of+Furfural+and+I&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1444876548,"description":"Sugar Series 13 - The Chemistry and Technology of Furfural and Its Many By-Products  (Elsevier, 2000).pdf\r\n\r\nISBN: 044450351X\r\n\r\nThis book is a &quot;world first&quot;, since the furfural industry has been traditionally secretive to the point of appearing shrouded in clouds of mystery. Even renowned encyclopedic works have published but scant and often erroneous information on the subject. \r\nStriking a healthy balance between theory and practice, the book leads the reader from reaction mechanisms and kinetics to the technology of making furfural by various old and new processes, using conventional raw materials or sulfite waste liquor. Detailed discussions of means of increasing the yield are of great chemical and technological interest as well as of immense economic importance.\r\nFrom furfural proper, the treatise shifts to the fascinating field of wanted and unwanted by-products ranging from largely unutilized carboxylic acids to troublesome impurities such as 5-methyl furfural and 2-furyl methyl ketone, and then to extremely valuable serendipitous flavor compounds such as diacetyl and 2,3-pentanedione. A wide variety of derivatives are discussed; considerable space is devoted to polytetrahydrofuran, an important building block of stretchable synthetic fibers, while furan resins from both furfural and furfuryl alcohol are given the attention commensurate with their industrial importance. \r\nNotable supplementary chapters cover the in-line measurement of furfural, the treatment of furfural waste water, and various aspects of corrosion. A chapter on the applications of furfural elaborates not only traditional uses in extracting petroleum and vegetable oils but also the sensational discovery that furfural is a highly effective &quot;indirect nematocide&quot;. Without becoming toxic, it changes the microflora of the soil by stimulating bacteria antagonistic to nematodes, thereby reducing the nematode population to zero, at an unprecedented low price. It is believed that this application will be the principal outlet for furfural in the future.\r\nA comprehensive list of physical properties, some never published before, make the book an indispensable companion for producers, users and researchers alike","torrent":{"xt":"urn:btih:b8058fdbea431b6507c82e14e30c6d1995adcc5f","amp;dn":"Sugar+Series+13+-+The+Chemistry+and+Technology+of+Furfural+and+I","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8058fdbea431b6507c82e14e30c6d1995adcc5f","infoHashBuffer":{"type":"Buffer","data":[184,5,143,219,234,67,27,101,7,200,46,20,227,12,109,25,149,173,204,95]},"announce":[],"urlList":[]}}