{"title":"G-Force.2009.DVDrip.iNTERNAL.XviD-BPDcarrier","uid":5298511,"size":1849374443,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b94949552a6d429875160d2d69ee5f8fc96366b5&amp;dn=G-Force.2009.DVDrip.iNTERNAL.XviD-BPDcarrier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eestiasi","files":-1,"time":1264140673,"description":"G-Force.2009.DVDrip.iNTERNAL.inc.Xtras.XviD-BPDcarrier\n\n\nVideo: 2CDs, XviD, ultra-wide video, 720x304, 1540kbps, 25fps\n\nAudio: 2 audiotracks: English surround sound + Estonian dubbed surround sound\n\nSubtitles: English, Estonian, Horvatian, Slovenian and Spanish subtitles\n\nExtras: English, English commentary, Estonian and Spanish audios as external stereo MP3s\n\n\nTwo time Oscar-winning visual effects artist Hoyt Yeatman makes his feature directorial debut with this Jerry Bruckheimer-produced family film following a group of highly trained guinea pigs on their mission to prevent an evil billionaire from taking over the world. Beginning in the Civil War -- when carrier pigeons delivered messages from the front lines -- the American government has been covertly training animals to work in espionage. The latest government program is a clandestine espionage team known as &quot;G-Force,&quot; which includes a team of ultra-intelligent guinea pigs who share 98.7 percent of their DNA with humans. Comprised of unpredictable weapons expert Blaster (voice of Tracy Morgan), alluring martial arts expert Juarez (voice of PenÃƒÂ©lope Cruz), stealthy reconnaissance expert Mooch, and a star-nosed mole named Speckles (voice of Nicolas Cage), who specializes in computers, this crack team of agents is fronted by heroic squad leader Darwin (voice of Sam Rockwell). When a deranged billionaire hatches a plan to control the entire planet through common household appliances, the G-Force leaps into action on a mission to ensure that he does not succeed.\n\nDisney koomilise seiklusfilmi peategelasteks on erivÃƒÂ¤ljaÃƒÂµppega merisead eksperimentaalsest eriÃƒÂ¼ksusest M-KOMANDO. Just siis, kui neljajalgsed luurajad on avastanud ohtliku salaplaani, tuleb kÃƒÂ¤sk nende osakond sulgeda. Kuid tiimi juht Darwin, lÃƒÂµhkeaineekspert Karmauh, vÃƒÂµitluskunstide meister Juarez ja mutist arvutispetsialist Prillu otsustavad oma tegevust jÃƒÂ¤tkata. Kannul FBI agendid, sÃƒÂ¶ÃƒÂ¶stavad ÃƒÂ¼limoodsa tehnikaga varustatud loomakesed pÃƒÂ¶ÃƒÂ¶rastesse seiklustesse, et nurjata kogu maailma ohustav vandenÃƒÂµu. PÃƒÂµnevat mÃƒÂ¤rulit, jahmatavaid eriefekte ning vaimukaid nalju pakkuva M-KOMANDO produtsent on Jerry Bruckheimer (KARIIBI MERE PIRAADID, RAHVUSLIK AARE). \nEestikeelse versiooni helindasid TÃƒÂµnn Lamp, Marika Korolev, Ivo Eensalu, Sergo Vares, Tiit Sukk, Elisabet Tamm, Hans Kaldoja, Tamur Tohver, Erki Aule, Tarmo Hints, Anne Reemann, TÃƒÂµnu Mikiver ja teised. \n\n\nVisitit my account: &lt;a href=&quot; http://thepiratebay.se/user/eestiasi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/eestiasi&lt;/a&gt;      \n\nEstonian music, movies &amp; audiobooks download: &lt;a href=&quot; http://kuldkalake2.co.cc/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://kuldkalake2.co.cc/&lt;/a&gt;\n\nNo credit for me...credit to EVERYONE for sharing!","torrent":{"xt":"urn:btih:b94949552a6d429875160d2d69ee5f8fc96366b5","amp;dn":"G-Force.2009.DVDrip.iNTERNAL.XviD-BPDcarrier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b94949552a6d429875160d2d69ee5f8fc96366b5","infoHashBuffer":{"type":"Buffer","data":[185,73,73,85,42,109,66,152,117,22,13,45,105,238,95,143,201,99,102,181]},"announce":[],"urlList":[]}}