{"title":"Crohn's Disease_Basic Principles.pdf","uid":12530106,"size":16987847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bacd6e4008d42357f08f3864e31e0bf7260b0c14&amp;dn=Crohn%27s+Disease_Basic+Principles.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"interuniversal","files":1,"time":1444236600,"description":"Crohn's Disease - Basic Principles\r\n\r\nEditors: Alessandro Fichera,Mukta K. Krane\r\n\r\nISBN: 978-3-319-14181-7\r\n\r\nPublisher:Springer\r\n\r\nCrohn’s Disease: Basic Principles provides a comprehensive and state-of-the-art overview of the current diagnosis and treatment strategies for Crohn’s disease. Care of these patients and clinical conditions can be quite complex and often require a multidisciplinary approach. Sections of the book are based on the most current, evidenced-based resources and have been structured to review the etiology and diagnosis of Crohn’s disease, discuss advances in medical and surgical treatment, illustrate emerging technologies impacting the care of patients with Crohn’s disease, and examine functional and quality of life outcomes in this patient population. The text reviews our understanding of the influence of molecular and genetic factors in the development and pattern of Crohn’s disease. Current methods of diagnosis and strategies in the medical management of patients with Crohn’s disease are evaluated including the use of biologic agents. Resection and bowel sparing techniques for primary and recurrent disease as well as advances in endoscopy and laparoscopy are discussed in detail. In addition, factors influencing the quality of life of patients with Crohn’s disease are examined including nutrition, enterostomal care, fertility, and sexual function. Written by recognized experts in their field, Crohn’s Disease: Basic Principles highlights the integrated multidimensional aspect of caring for patients with Crohn’s disease and will be of great value to colon and rectal surgeons, general surgeons, gastroenterologists, internists, as well as fellows and upper level residents in training training","torrent":{"xt":"urn:btih:bacd6e4008d42357f08f3864e31e0bf7260b0c14","amp;dn":"Crohn%27s+Disease_Basic+Principles.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bacd6e4008d42357f08f3864e31e0bf7260b0c14","infoHashBuffer":{"type":"Buffer","data":[186,205,110,64,8,212,35,87,240,143,56,100,227,30,11,247,38,11,12,20]},"announce":[],"urlList":[]}}