{"title":"Three.Men.Go.to.Scotland--w.subs--468p","uid":12560240,"size":1318629224,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:badc2f8c352190bf204ead7591b64eadfc37973b&amp;dn=Three.Men.Go.to.Scotland--w.subs--468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":4,"time":1444694345,"description":"Comedy documentary series starring Dara Ó Briain, Rory McGrath and Griff Rhys Jones.\r\n\r\nFirst shown 2010.\r\n\r\nCurrently repeated on the BBC iPlayer, 468p is the best the Beeb offers for them.\r\n\r\nWith subtitles - enjoy !\r\n_____________________________________________\r\n\r\n\r\nEpisode 1\r\nThree Men, Three Men Go to Scotland Episode 1 of 2\r\n\r\nGriff Rhys Jones, Rory McGrath and Dara O Briain head to the Hebrides for another adventure on the high seas, sailing around some of the prettiest and most remote seascapes in the British Isles. Since none of the three men in a boat have any particular connection to Scotland, they decide to use the 16th-century travels of dictionary writer Dr Johnson and his biographer James Boswell as inspiration.\r\n\r\nIn particular Rory is inspired by Boswell's record of everything he drank, and decides to try and visit as many distilleries as possible. Their journey takes them across the Western Isles, to the isles of Jura, Mull, Skye and finally Harris, where they hope to catch the last week of the wild salmon fly fishing season.\r\n\r\nTheir first boat turns out to have wings, as they catch the Seaplane from Glasgow to the end of the Crinan Canal. It's here that Vic 32 awaits, one of the last surviving coal-fired steam puffers. Their first task is to light the boiler and wait for it to get to temperature. In the meantime they decide to have a go at the Kilmore Highland Games, which means getting kitted out in full Highland attire. Dara takes on the ladies' hammer-throwing champion and Griff takes part in a rowing race.\r\n\r\nThe Puffer then takes them to the start of a West Highland Week race, one of Scotland's biggest yachting events. The boys take control of a William Fife yacht built in 1910, competing alongside 100 other yachts. But after a near pile-up at the first buoy, the race result is protested by several yachts.\r\n_______________________________________________________________\r\n\r\n\r\nEpisode 2\r\nThree Men, Three Men Go to Scotland Episode 2 of 2\r\n\r\nGriff Rhys-Jones, Rory McGrath and Dara O'Briain head to the Hebrides for another adventure on the high seas, sailing around some of the prettiest and most remote seascapes in the British Isles. Since none of the three men in a boat have any particular connection to Scotland, they decide to use the 16th-century travels of dictionary writer Dr Johnson and his biographer James Boswell as inspiration.\r\n\r\nIn particular Rory is inspired by Boswell's record of everything he drank, and decides to try and visit as many distilleries as possible. Their journey takes them across the Western Isles, to the isles of Jura, Mull, Skye and finally Harris, where they hope to catch the last week of the wild salmon fly fishing season.\r\n\r\nThey start by catching the ferry from Oban to Mull, where they visit Fingal's Cave, inspiration to so many writers, artists and musicians like Felix Mendelssohn. They leave Mull onboard Mascot, a 1904 Bristol Pilot Cutter, but immediately run into trouble as they get tangled in a lobster pot. They then sail along the coast to the Knoydart Peninsular, where they are shown how to survive, before finding Britain's most remote pub.\r\n\r\nDara offers to give his friend, comedian and mountaineer Ed Byrne, a lift to the Cullins on Skye. He is trying to climb as many Scottish mountains as he can. They sail north, but realise they're running out of time. So they catch a lift with the Scottish Fisheries Protectorate Ship Norna, finally making the last week of the fishing season at Amhuinnsuidhe Castle on Harris, a place that has been described as 'heaven on earth'","torrent":{"xt":"urn:btih:badc2f8c352190bf204ead7591b64eadfc37973b","amp;dn":"Three.Men.Go.to.Scotland--w.subs--468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"badc2f8c352190bf204ead7591b64eadfc37973b","infoHashBuffer":{"type":"Buffer","data":[186,220,47,140,53,33,144,191,32,78,173,117,145,182,78,173,252,55,151,59]},"announce":[],"urlList":[]}}