{"title":"Barry Lee Pearson, Robert Johnson: Lost and Found [PDF]","uid":12346946,"size":9838470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd2680a45ea08936c4ba8b3c0d8372473af7a642&amp;dn=Barry+Lee+Pearson%2C+Robert+Johnson%3A+Lost+and+Found+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1441327822,"description":" Barry Lee Pearson, Bill McCulloch, Robert Johnson: Lost and Found [PDF]\n\n\n\nWith just forty-one recordings to his credit, Robert Johnson (1911-38) is a giant in the history of blues music. Johnson's vast influence on twentieth-century American music, combined with his mysterious death at the age of twenty-seven, has allowed speculation and myths to obscure the facts of his life. The most famous of these legends depicts a young Johnson meeting the Devil at a dusty Mississippi crossroads at midnight and selling his soul in exchange for prodigious guitar skills.In this volume, Barry Lee Pearson and Bill McCulloch examine the full range of writings about Johnson and sift fact from fiction. They compare conflicting accounts of Johnson's life, weighing them against interviews with blues musicians and others who knew the man. Through their extensive research Pearson and McCulloch uncover a life every bit as compelling as the fabrications and exaggerations that have sprung up around it. In examining Johnson's life and music, and the ways in which both have been reinvented and interpreted by other artists, critics, and fans, &quot;Robert Johnson: Lost and Found&quot; charts the broader cultural forces that have mediated the expression of African American artistic traditions","torrent":{"xt":"urn:btih:bd2680a45ea08936c4ba8b3c0d8372473af7a642","amp;dn":"Barry+Lee+Pearson%2C+Robert+Johnson%3A+Lost+and+Found+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd2680a45ea08936c4ba8b3c0d8372473af7a642","infoHashBuffer":{"type":"Buffer","data":[189,38,128,164,94,160,137,54,196,186,139,60,13,131,114,71,58,247,166,66]},"announce":[],"urlList":[]}}