{"title":"L.A. Guns - The Ballad Of Jayne  (2nafish)","uid":5293700,"size":146481156,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:becaef72d04070ab54da8facb2fe9ac39da75994&amp;dn=L.A.+Guns+-+The+Ballad+Of+Jayne++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1263986965,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nL.A. Guns is a name used by two American glam metal bands whose music is frequently associated with the L.A. glam metal scene which grew up around the Sunset Strip in the 1980s, in particular the sleaze rock subgenre. Guns N' Roses, which once featured three of the original L.A. Guns members, was the most prominent exponent of this subgenre, generally preferring an anti-social image to elaborate make-up and costumes. The two bands share and tour using the L.A. Guns name: One is headed by Tracii Guns, the founder of the original band, and the other is headed by Phil Lewis and Steve Riley, the singer and drummer of the other incarnation of the band.\n\nCocked &amp; Loaded is the second full-length album from the band L.A. Guns, and their first to reach gold certification. The album features guest appearances by Cheap Trick members Robin Zander and Rick Nielsen.\n\nThis was the first L.A. Guns album that Steve Riley actually played drums on. Although he was in the band photo and listed as a band member in the liner notes of the band's first album, L.A. Guns (because by then he was an official member of the band), Nickey &quot;Beat&quot; Alexander played drums on that album.\n\nOn the first album's supporting tour, Nickey was replaced by former W.A.S.P. drummer Steve Riley, leaving only two original members. This lineup remained until 1992. In 1989, they released their second album Cocked &amp; Loaded. It contained the smash radio and video hits, &quot;Never Enough&quot; and &quot;The Ballad of Jayne&quot;, which helped the album reach gold, and eventually platinum status. This was the commercial peak of their career, a point that they would not reach again, presently. The album's song &quot;Rip &amp; Tear&quot; was also a hit. The band also released two home videos coinciding with these two albums, One More Reason (1989) and Love, Peace, &amp; Geese (1990) and participated in worldwide touring as headliners and as support for such acts as AC/DC, Cheap Trick, Def Leppard, and Ted Nugent.\n\nDuring 1991, the band released their third album Hollywood Vampires on Polydor Records. The album did re-achieve the gold status of Cocked &amp; Loaded and their debut album and did spawn a few hits such as &quot;Kiss My Love Goodbye&quot; and &quot;It's Over Now&quot; although it still wasn't as well noticed as the first two albums. In 1993, their first album finally reached gold status as well. Tracii Guns participated in the supergroup Contraband the same year. The L.A. Guns released a five song EP titled Cuts in 1992 and then in 1995 their fourth album Vicious Circle, drummer Michael &quot;Bones&quot; Gershima played on parts of these recording as this was around the time Phil Lewis fired drummer Steve Riley in January 1992. Riley later returned to the band for the successful Vicious Circle club tour. After this, the L.A. Guns were dropped from Polygram (Vertigo/Polydor) Records. Phil Lewis and Mick Cripps then left the band.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:becaef72d04070ab54da8facb2fe9ac39da75994","amp;dn":"L.A.+Guns+-+The+Ballad+Of+Jayne++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"becaef72d04070ab54da8facb2fe9ac39da75994","infoHashBuffer":{"type":"Buffer","data":[190,202,239,114,208,64,112,171,84,218,143,172,178,254,154,195,157,167,89,148]},"announce":[],"urlList":[]}}