{"title":"|-|GTA San Andreas|-|By [HacKR]Anonymous","uid":12374990,"size":616760736,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bfeb609cd22dae41c7757b4e5fda16871b7a771b&amp;dn=%7C-%7CGTA+San+Andreas%7C-%7CBy+%5BHacKR%5DAnonymous&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SkrillexRO","files":1,"time":1441690676,"description":"Grand Theft Auto: San Andreas is an open world action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released on 26 October 2004 for the PlayStation 2 console, and on 7 June 2005 for Microsoft Windows and Xbox. It is the seventh title in the Grand Theft Auto series, and the first main entry since 2002's Grand Theft Auto: Vice City. It was released on the same day as the handheld game Grand Theft Auto Advance.\n\nGrand Theft Auto: San Andreas is played from a third-person perspective in an open world environment, allowing the player to interact with the game world at their leisure. The game is set within the fictional US state of San Andreas, which is heavily based on California and Nevada.[c] The state of San Andreas consists of three metropolitan cities: Los Santos, based on Los Angeles; San Fierro, based on San Francisco; and Las Venturas, based on Las Vegas. The single-player story follows Carl &quot;CJ&quot; Johnson, who returns home to Los Santos after learning of his mother's murder. CJ finds his old friends and family in disarray, and over the course of the game he attempts to re-establish his old gang, clashes with corrupt cops, and gradually unravels the truth behind his mother's murder. The plot is based on multiple real-life events in Los Angeles, including the rivalry between the Bloods and Crips street gangs, the 1980s crack epidemic, the LAPD Rampart scandal, and the 1992 Los Angeles riots.\n\nUpon its release, the game was acclaimed by many reviewers who praised the music, story and gameplay. It became the best-selling video game of 2004, and has sold over 27 million copies; it remains the best-selling PlayStation 2 game of all time. The game, like its predecessors, is cited as a landmark in video games for its far-reaching influence within the industry. However, the violence and sexual content of San Andreas has been the source of much public concern and controversy. In particular, a player-made software patch, dubbed the &quot;Hot Coffee mod&quot;, unlocked a previously hidden sexual mini-game.\n\nThe next main entry in the series, Grand Theft Auto IV, was released on 29 April 2008, also to critical acclaim. San Andreas has been ported to various other platforms and services, such as OS X, Xbox Live, PlayStation Network and mobile devices (iOS, Android, Windows Phone and Fire OS). In October 2014, the game was taken off the Xbox Live Marketplace &amp; PlayStation Store. It was later announced that the game would be re-released and enhanced for Xbox 360 to celebrate the 10th anniversary","torrent":{"xt":"urn:btih:bfeb609cd22dae41c7757b4e5fda16871b7a771b","amp;dn":"%7C-%7CGTA+San+Andreas%7C-%7CBy+%5BHacKR%5DAnonymous","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfeb609cd22dae41c7757b4e5fda16871b7a771b","infoHashBuffer":{"type":"Buffer","data":[191,235,96,156,210,45,174,65,199,117,123,78,95,218,22,135,27,122,119,27]},"announce":[],"urlList":[]}}