{"title":"Imagining the Parish in Late Medieval England (2015).pdf Gooner","uid":12513975,"size":21711728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c07d4c96055b00fe8f6c86e4eaea61e424520f2b&amp;dn=Imagining+the+Parish+in+Late+Medieval+England+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1443619833,"description":"Publisher: Ohio State University Press; 1 edition (April 28, 2015)\r\nLanguage: English\r\nISBN-10: 0814212751\r\nISBN-13: 978-0814212752\r\n\r\nCollective worship and the ritual life of the local parish mattered deeply to late medieval laypeople, and both loom large in contemporary visual and vernacular culture. The parish offered an important framework for Christians as they negotiated the relationship between individual, community, and God. And as a place where past, present, and future came together, the parish promised an ongoing relationship between the living and the dead, positioning the here and now of the local parish in the long trajectory of eschatological time. \r\n \r\nImagining the Parish in Late Medieval England explores the ways in which Middle English literature engages the idea of lay spiritual community and the ideal of parochial worship. Ellen K. Rentz pairs nuanced readings of works such as Piers Plowman, Handlyng Synne, and the Prick of Conscience with careful analysis of contemporary sermons, spiritual handbooks, and liturgical texts as well as a wide range of visual sources, including wall paintings and stained glass. This new study examines how these texts and images locate the process of achieving salvation in the parish and in the work that parishioners undertook there together","torrent":{"xt":"urn:btih:c07d4c96055b00fe8f6c86e4eaea61e424520f2b","amp;dn":"Imagining+the+Parish+in+Late+Medieval+England+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c07d4c96055b00fe8f6c86e4eaea61e424520f2b","infoHashBuffer":{"type":"Buffer","data":[192,125,76,150,5,91,0,254,143,108,134,228,234,234,97,228,36,82,15,43]},"announce":[],"urlList":[]}}