{"title":"Danko Jones - Code of the Road  (2nafish)","uid":5295917,"size":115892228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c15ced3703899c01d6e26deaab3d27eaac25b10f&amp;dn=Danko+Jones+-+Code+of+the+Road++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264057999,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDanko Jones is a three-piece hard rock band from Toronto, Ontario, Canada.\n\nThe band consists of Danko Jones (vocals/guitar), JC (also known as John Calabrese) (bass guitar), and Dan Cornelius (drums).\n\nNever Too Loud was recorded at Studio 606 in Los Angeles with Grammy Award-winning producer Nick Raskulinecz (Foo Fighters, Rush, Stone Sour, Velvet Revolver).\n\n&quot;Nick's worked on some of my favourite records of the last five years&quot;, the band's leader and namesake previously said, &quot;and we're very excited to step into the studio with a producer who has such a great track record and incredible instincts.&quot;\n\nOn February 21, 2008, Danko Jones uploaded their new album on their MySpace page where it remained until the album was released.\n\nTheir fourth album, Never Too Loud was released in February 2008 and produced by Nick Raskulinecz. The album yielded three singles, &quot;Code Of The Road&quot; followed by &quot;Take Me Home&quot; and &quot;King Of Magazines&quot;. A major city tour of Europe in April 2008 was followed by a Canadian tour in May and a three month stint in Europe playing almost 30 dates on the festival circuit that included Rock Am Ring, Rock Im Park and With Full Force in Germany; Bospop and Lowlands in Holland; Sziget Festival in Hungary; Rabarock in Estonia; Provinssi Rock in Finland; and Eurockeennes and Hellfest in France, where Jones got to sing on stage with one of his favorite bands, Death Angel for the song, &quot;Bored&quot;. and a dozen and a half more. In the fall/winter of 2008 Danko Jones toured England, Germany, France and Benelux opening for MotÃƒÂ¶rhead.\n\nFormed in 1996, they played consistently for two years in and around the north-eastern United States and Canada, opening for The New Bomb Turks, Nashville Pussy, Blonde Redhead, The Make-Up, The Dirtbombs, The Chrome Cranks and The Demolition Doll Rods. Originally they didn't even want to release an album opting to have the band's live reputation spread via word of mouth. Eventually, the trio relented and put out a self-titled six song e.p. on Sonic Unyon records in 1998.\n\nIn 1999 they released the self-produced My Love Is Bold E.P. and achieved national exposure with the single &quot;Bounce&quot;. They were nominated for a Juno in 2000 for Best Alternative Album.\n\nIn 2001 Bad Taste Records (Lund, Sweden) released a compilation of the band's early recordings, demos, and b-sides entitled, I'm Alive and On Fire. A 5 week European tour followed to promote the release including shows at the Roskilde festival in Denmark and Hultsfred festival in Sweden. By the end of the year they had returned 2 more times, most notably as main support for the Backyard Babies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c15ced3703899c01d6e26deaab3d27eaac25b10f","amp;dn":"Danko+Jones+-+Code+of+the+Road++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c15ced3703899c01d6e26deaab3d27eaac25b10f","infoHashBuffer":{"type":"Buffer","data":[193,92,237,55,3,137,156,1,214,226,109,234,171,61,39,234,172,37,177,15]},"announce":[],"urlList":[]}}