{"title":"Dame.Fanny.Waterman.A.Lifetime.in.Music.EN.SUB.x265.[MPup]","uid":12595558,"size":102476872,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c3611519426cbc012a7ad40d6e2a4672abd6bf2c&amp;dn=Dame.Fanny.Waterman.A.Lifetime.in.Music.EN.SUB.x265.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":3,"time":1445224238,"description":"BBC.Documentaries.2012.10.26.Dame.Fanny.Waterman.A.Lifetime.in.Music.EN.SUB.x265.WEBRIP.[MPup]\r\n\r\n[b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nFormat: HEVC\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nDame Fanny Waterman talks to Petroc Trelawney about her life as a concert pianist, renowned piano teacher and founder and chair of the Leeds International Piano Competition.\r\n\r\n[img]http://extraimago.com/images/2015/10/18/29e6bb6a2163b09036670f34c8f9e17f.jpg[/img]\r\n\r\nAs a renowned teacher and founder and chair of the Leeds International Piano Competition, Dame Fanny Waterman is one of the most influential figures in British music. At the tender age of 92, she remains as energetic as ever, teaching children as young as six and in demand all over the world as a mentor and jury member.\r\n\r\nIn this candid conversation with Petroc Trelawney, Waterman sheds light on her humble beginnings in Leeds as the daughter of a Russian emigre jeweller. Her life was transformed when she heard Rachmaninov perform at Leeds Town Hall in the 1920s - and her love affair with the piano has lasted eight decades. As a concert pianist, highlights included a Proms performance during the Second World War with Sir Henry Wood at the Royal Albert Hall, before returning to her home city of Leeds with husband Geoffrey de Kaiser to become a piano teacher. However, being known as the 'local piano teacher' was never enough and with the help of her lifelong friend, local aristocrat Marion Harewood, they set up the first Leeds International Piano Competition in 1963.\r\n\r\nFifty years on Dame Fanny remains the mastermind behind 'The Leeds', a competition regarded as the most coveted prize in the piano world and having first showcased such talents as Radu Lupu, Murray Perahia, Andras Schiff and Noriko Ogawa. Outspoken, passionate and still full of vitality, Waterman shares her views on teaching, the great pianists of the past and present, music and love. When asked if she would ever retire from her hectic schedule this remarkable nonagenarian simply replies 'No, never!'","torrent":{"xt":"urn:btih:c3611519426cbc012a7ad40d6e2a4672abd6bf2c","amp;dn":"Dame.Fanny.Waterman.A.Lifetime.in.Music.EN.SUB.x265.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3611519426cbc012a7ad40d6e2a4672abd6bf2c","infoHashBuffer":{"type":"Buffer","data":[195,97,21,25,66,108,188,1,42,122,212,13,110,42,70,114,171,214,191,44]},"announce":[],"urlList":[]}}