{"title":"Nickey Huntsman - Daddy's Young Glory Hole 720p","uid":12337915,"size":290494741,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c3aed8fbc6cf46d14cae001a9121668210a0927c&amp;dn=Nickey+Huntsman+-+Daddy%27s+Young+Glory+Hole+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TKTh3K1ng","files":1,"time":1441265184,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/8yG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8yG&lt;/a&gt;\n\nDaddys Young Glory Hole\n\nNickey is hanging out in the kitchen by herself ready a dirty novel and it starts to turn her on. Shes getting really wet and she just has to touch herself. She starts rubbing her pussy and grinding her hips against her fingers as she moans. Shes really getting hot and wet when her dad walks in and catches her. Hes upset because the kitchen is a mess and shes reading dirty novels and she just got suspended from school. They start to fight because he doesnt approve of her behavior but shes not taking him seriously. So he bends her over and starts spanking her. He wants to teach her a lesson. But she just isnt learning it. So he turns to another method of teaching her a lesson and pulls out his cock for her to suck. He sits in the chair she was touching herself in earlier and she gets on her knees. She starts sucking his dick, using her hands as he holds her hair back. She feels so good with her pretty mouth wrapped around his dick so he wants more. He pulls off her shirt and bends her over the table, pulling her panties down to her ankles. Then he slips his cock inside. He starts fucking his baby girl hard, flips her over with her legs up in the air and fucks her some more. But he wants to cum in her mouth, so he gets back on the chair and she keeps sucking his dick, licking the head and gripping the shaft until he cums in her mouth and she swallows","torrent":{"xt":"urn:btih:c3aed8fbc6cf46d14cae001a9121668210a0927c","amp;dn":"Nickey+Huntsman+-+Daddy%27s+Young+Glory+Hole+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3aed8fbc6cf46d14cae001a9121668210a0927c","infoHashBuffer":{"type":"Buffer","data":[195,174,216,251,198,207,70,209,76,174,0,26,145,33,102,130,16,160,146,124]},"announce":[],"urlList":[]}}