{"title":"Lillix - Tomorrow  (2nafish)","uid":5293122,"size":134305796,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3aef825a1833ca41a6c11e77cee0341727ccce7&amp;dn=Lillix+-+Tomorrow++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1263961005,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Tomorrow&quot; is the final single from the girl rock band Lillix from their debut album Falling Uphill. The song was written by three members of the band and Linda Perry, now famous for Christina Aguilera's &quot;Beautiful&quot;; it was also featured on the Confessions of a Teenage Drama Queen soundtrack.\n\nThe ending of the song on the Confessions of a Teenage Drama Queen soundtrack was different from the one featured on the Falling Uphill album. The video was a hit on TRL chart staying for 10 days.\n\nThis single is quite rare as it was only released in a few countries, including Japan. The single may now be considered a collector's item.\n\nFalling Uphill is the debut album from the Canadian all-girl pop rock band Lillix.\n\nTheir debut album was released by Maverick Records on May 27, 2003. Most of the tracks were written by members between the ages of thirteen to fifteen.\n\nThe debut album includes a cover of The Romantics' song &quot;What I Like About You&quot;. This song was also featured on the Freaky Friday soundtrack as well as the comedy series of the same name. The single releases are &quot;It's About Time&quot;, &quot;What I Like About You&quot;, and &quot;Tomorrow&quot;. The only single to hit the charts is &quot;It's About Time&quot;, which peaked at #17 on the Japan Top 20 chart.\n\nLillix (pronounced /Ã‹Ë†lÃ‰ÂªlÃ‰Âªks/) is a pop/rock band from Cranbrook, British Columbia, Canada, formed under the name Tigerlily in 1997 when the early members were in high school. The band was originally composed of guitarist Tasha-Ray Evin, keyboardist Lacey-Lee Evin, bassist Louise Burns, and drummer Sierra Hills. In 2001 the band was signed by Maverick Records and changed their name to Lillix as there was another band called Tigerlily. Hills left in 2002 and was replaced by Kim Urhahn, and later by Alicia Warrington. The Evin sisters announced that as of late 2006 the band was considered on hiatus due to the loss of Burns and Warrington, but with the addition of two new members in early 2007, the band was in the process of rebuilding. The band announced its return in 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c3aef825a1833ca41a6c11e77cee0341727ccce7","amp;dn":"Lillix+-+Tomorrow++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3aef825a1833ca41a6c11e77cee0341727ccce7","infoHashBuffer":{"type":"Buffer","data":[195,174,248,37,161,131,60,164,26,108,17,231,124,238,3,65,114,124,204,231]},"announce":[],"urlList":[]}}