{"title":"Hiking Tennessee - 1st Edition (2015).pdf Gooner","uid":12480503,"size":33396289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4df2a6f111495aaf10f9f2ecce570834396a1f3&amp;dn=Hiking+Tennessee+-+1st+Edition+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1443043769,"description":"Publisher: Human Kinetics; 1 edition (April 20, 2015)\nLanguage: English\nISBN-10: 1450492061\nISBN-13: 978-1450492065\n\n&quot;Hiking Tennessee&quot; is your complete guide to 85 of the most scenic day hikes in the Volunteer State. From the Pioneer Trail in Meeman-Shelby Forest State Park to the Hidden Passage Trail in Pickett State Park to the Great Smoky Mountains National Park, this handy guide will lead you to the best trails throughout the state. In this one-of-a-kind resource, you'll find the following features:\n\n- Detailed descriptions complete with GPS coordinates for every hike in all three regions of Tennessee\n\n- Special points of interest, including Civil War-era and Native American historical sites; descriptions of the topography, flora, fauna, and climate; estimated hiking time and distance; and difficulty ratings for each trail\n\n- Phone numbers and websites, park hours and rules, and available facilities for the state's most scenic hiking areas\n\n- Easy-to-read maps for every park and trail to help you navigate your hike and locate landmarks and other points of interest\n\n- A convenient trail finder that provides a summary of each trail's features and available facilities\n\n&quot;Hiking Tennessee &quot;brings to life the history, terrain, wildlife, and natural features of each area. The vivid descriptions of the foliage, animals, and well-known and local historical accounts of each area provide an invitation to explore and experience the trails for yourself.&quot; Hiking Tennessee&quot; is your guide to enjoying the great outdoors!","torrent":{"xt":"urn:btih:c4df2a6f111495aaf10f9f2ecce570834396a1f3","amp;dn":"Hiking+Tennessee+-+1st+Edition+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4df2a6f111495aaf10f9f2ecce570834396a1f3","infoHashBuffer":{"type":"Buffer","data":[196,223,42,111,17,20,149,170,241,15,159,46,204,229,112,131,67,150,161,243]},"announce":[],"urlList":[]}}