{"title":"OCTAVE Discography","uid":5282443,"size":160416182,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c54b2404c6dcb717e81f6ff7c56cf8218caed50b&amp;dn=OCTAVE+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"isus666","files":85,"time":1263595772,"description":"OCTAVE Biography (Translated with Google Translate)\n\nReal name: Octavian Teodorescu \nAlias artistic Octave \nHe was born on January 29, 1963, in Bucharest. Since childhood he liked all types of \ninstruments and music in general. Although his parents observasera this, have not targeted \nin this respect. \nAt the age of 16 years saw the first rock concert life: Suzi Quatro Live in Bucharest in 1979. The impact was very \nstrong. This sort of artistic expression, Rock, will mark since becoming artistic ulteriora teenager. \nThe effect is much amplified by the age of 17 years watching the movie &quot;The Last Waltz&quot; Martin Scorsese's (March, \nvideo image processor as the events at Woodstock). The film was the subject of the band's farewell concert \nThe Band, is actually a tribute dedicated an entire generation that led Keyword Rock at its peak in '70. In the film \nappear as guests Eric Clapton, Ringo Starr, Bob Dylan, Muddy Watters, Van Morrison, Neil \nYoung, Joni Mitchell, Ronnie Wood of the Rolling Stones. The words of Robbie Robertson \n(guitarist of The Band) had a strong resonance in the consciousness of the future Octave, \ngaining for him the value of a sacred message: &quot;Our concert is more than one \nFarewell concert, represents the end of an era and the beginning of another in the rock. We let \nyou, those of today, our work, which I created in November before. Be careful what you do with \nit &quot;understands the moment that rock is more than music is a way to \nbe, to think, to get this in society, is an existential optics, a philosophy which \nfar corresponded with what he learns at school then. Since then, all \nenergies begin to concentrate in a single tel: TO ROCK! \nfile: / / / E | / Text / EN / BIO.HTM (1 von 4) 21.08.2004 13:14:13 \nOctave Biography \nIn 1982 he was taken to army. He took with him a guitar. Patterns imposed by the military regime \nand lack of freedom they provoke even more, to the despair of his superiors, preferring \nguitar instead of Kalashnikov rifles. Unfortunately, he could sing only in the laundry \ncompany, Dreaming of &quot;Sweet Freedom&quot; when they return home and will start a \nband. The day came in June '83. After it was student of \nInstallations for the building, but this kind of school was not for him. After two years it has \ndecided to leave school and become a professional musician. \nIn November 1985 he founded his first group called Dream. Soft Rock with style approach was influenced from bands \nand Eagles and Dire Straits. With this group he performed only in small clubs. \nIn May 1988 the band disbanded and became the name of Octave, forbidding censorship Originally Vis. Home \nRegistration took place in February (same year) on Radio Bucharest. \nAfter the Revolution, on March 90 saw the first appearance in TVR, which was a great surprise to lovers rock \nin Romania. In February 1991 he decided to play only instrumental rock. So was born the idea of \nRock opera &quot;Trilogy Octave. In June '92 was signed first contract with Electrecord discs for \nalbum Secret Pyramids. The '92 was held August 27 release of The Secret Pyramid &quot;which was the most \nsuccessful rock after the Revolution, Rock the House bestseller section Electrecord record and second place in rankings \nGeneral. This album has promoted a new style, new sound, new music, forming a \ngreat and pleasant surprise to the public and the media. \nOctavian Teodorescu Octave is his own manager and has demonstrated excellent \nin this work. On all radio and can listen to the music of televziune, \nnumerous magazines and newspapers wrote about it. \nSeptember 16, 1993 meant the appearance of his first single, &quot;Is it climbed one step, \nextracted from the future album &quot;The gates of love&quot;, the second part of the trilogy. The single \nwas a promotional success. \nOn December 3, 1993 has been \nlaunch of the second \nalbum, &quot;The gates of love&quot; \nbestseller in the category rock \nElectrecord house record in 1993. There appeared new videos and \na lot of interviews about Octave, in all types of \nnewspapers and magazines, radio and television. On September 15, 1994 to \nwas launched the third part of the trilogy, the album &quot;Sweet \nLiberty, also best in sales to Elecrecord \nthat year between rock groups. \nOctave is now a very popular name. Excerpts from his plays are used as generic to many radio \nand TV: Church, 25 Transit Time TV, Time Europe, etc.. \nfile: / / / E | / Text / EN / BIO.HTM (2 von 4) 21.08.2004 13:14:13 \nOctave Biography \nOn March 24 came a double CD (the first of its kind in Romania) with the entire trilogy: &quot;The secret of the Pyramids&quot;, &quot;The \nGates of Love &quot;,&quot; Sweet Freedom &quot;. It was the biggest musical events in Romania: a lot of fans, media, \nartistic and political personalities, representatives of embassies and sponsors the world famous: Optinova-Ray Ban, \nHonda. A great music store in Tokyo was interested in this CD. Through his music came on the market \nin Japan. \nOctave launched in November 20, 1996 new album &quot;I told dreamer&quot;, the \nfourth to record Electrecord. A very special album, an album without guitars, \nno voices, no classical instruments, computers and synthesizers only one album and a \none man with bold ideas, a computer keys album reaching but also more \ninspiration, a new musical realm where the author he reads Electronic Symphonic \nRock Music, a common denominator for all styles of music, a music that tries to \nsatisfy any taste, irrespective of age and however the general ideas of a \nsingle philosophy: ROCK \nA daring thought sharpens album, an album for those who like to dream feasible, an album that emphasizes \nmain ideas, important creative role in the relationship man-machine computer. A product bearing the inscription &quot;Made in \nEngland, 10 pieces signed Octavian Teodorescu, ideal for a sound superdigitalizat \naudition CD. \nThe release took place at the Music store, an atmosphere of 100% in western \nare forming a real show. Octave came after some waiting, \naccompanied by a bodyguard more unusual. Left and right of Agnes were \nMagda (Agnes Nagy Third place at Miss Universe 1998 Top Model of the World), some \nof the most beautiful models in Hungary, which, \nin turn, were flanked by what he called Octave \n&quot;... bodyguardelor bodyguards. An agency all over \nmodels from Romania, Sequoia, divided among \naudience - made up of fans, school kids and school \ngeneral, their parents and even grandparents - materials \nOctave promotional posters, stickers, badges, \nadvertising flyers and smiles. After the autographs of \nrigor, followed a press conference three hours, with prizes and a style superpetrecere \n&quot;Rock me baby all night long&quot; at Maxx Club of Director, where there headquarters \nOctave fans. Sponsors of the launches were AGFA Film, Optinova-Ray Ban, \nHonda Hit Power Torah Motors, Diesel Jeans, National Centurion Protection, Club Maxx, \nPython Systems Computers, Fx Design, Tele 7abc, Radio 2M + and newspaper Cotidianul. \nGroups of fans, journalists, radio and television people, VIPs, sponsors, so a \nword, friends of Octave, a total of about 700 people, were all together at \nwhom it was said, and they say and will say dreamer. ","torrent":{"xt":"urn:btih:c54b2404c6dcb717e81f6ff7c56cf8218caed50b","amp;dn":"OCTAVE+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c54b2404c6dcb717e81f6ff7c56cf8218caed50b","infoHashBuffer":{"type":"Buffer","data":[197,75,36,4,198,220,183,23,232,31,111,247,197,108,248,33,140,174,213,11]},"announce":[],"urlList":[]}}