{"title":"Sisters Of Mercy - This Corrosion  (2nafish)","uid":5298311,"size":158693380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c74f9a269bd81eb13dde4fd55ccc4e3d014e0b00&amp;dn=Sisters+Of+Mercy+-+This+Corrosion++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264133289,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;This Corrosion&quot; is a song from the album Floodland by The Sisters of Mercy. It was released as a single in 1987, with their previous bandmember Landres Evans reaching number 7 in the UK Charts.\n\nThe song was written by Andrew Eldritch, and produced by Jim Steinman. It is generally recognised as one of the band's most impressive songs, using a 40-piece orchestra, and lasting for over 10 minutes. Eldritch's lyrics concern his previous band members leaving The Sisters of Mercy to form The Mission.\n\nThere is also a 1999 cover version by the German band In Extremo, a 2002 cover by US-American band Lambchop, a 2003 cover by the German band Unheilig and a 2007 cover by the Swedish band Maryslim, featuring vocals from Jyrki 69 of The 69 Eyes.\n\nFloodland is the second album by The Sisters of Mercy, released in 1987. Composed and produced by Andrew Eldritch, it marked a change of direction from guitar-oriented rock towards synthesizer-based productions. The record peaked at #9 in UK album charts.\n\nThe Sisters of Mercy are an English gothic rock band that formed in 1980. After achieving early underground fame in UK, the band had their commercial breakthrough in mid-1980s and sustained it until the early 1990s, when they stopped releasing new recorded output as a strike against their record company. Currently, the band is a touring outfit only.\n\nThe group has released three original studio albums, of which the last was released in 1990. Each album was recorded by a different line-up; singer and songwriter Andrew Eldritch and the drum machines called Doktor Avalanche are the only points of continuity among the line-ups. Eldritch and Avalanche were also involved in The Sisterhood, a side-project connected with Eldritch's dispute with former members.\n\nThe group ceased recording activity in 1994, when they went on strike against their record company Time Warner, which they accused of withholding royalties and being incompetent. Although Time Warner eventually let the band go in 1997, they have not signed to another label, and have chosen not to go the independent label route, despite showcasing numerous new songs in their live sets.\n\nSince 1985, when the other original members left, The Sisters of Mercy has become the artistic vehicle of Andrew Eldritch. Ex-members of the group established the bands Ghost Dance and The Mission.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c74f9a269bd81eb13dde4fd55ccc4e3d014e0b00","amp;dn":"Sisters+Of+Mercy+-+This+Corrosion++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c74f9a269bd81eb13dde4fd55ccc4e3d014e0b00","infoHashBuffer":{"type":"Buffer","data":[199,79,154,38,155,216,30,177,61,222,79,213,92,204,78,61,1,78,11,0]},"announce":[],"urlList":[]}}