{"title":"Evil Angel - All Things Anal XXX DVDRip [.mp4]","uid":12491263,"size":1235567809,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c8c2221bc11bb4804c46e3d62aab82e3455d5241&amp;dn=Evil+Angel+-+All+Things+Anal+XXX+DVDRip+%5B.mp4%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":5,"time":1443181151,"description":"Screens &amp; Info :\r\n\r\n----------------------------------\r\n  \nhttp://imgkiss.com/image/Mhwo \nhttp://imgkiss.com/image/MvO0 \nhttp://imgkiss.com/image/Mwjp \nhttp://imgkiss.com/image/MX13 \nhttp://imgkiss.com/image/MsKI \nhttp://imgkiss.com/image/MxqN\r\n\r\n----------------------------------\r\n\r\nPerformers: Mike Adriano, Asphyxia Noir , Crystal Lopez, Danielle Delaunay, Natasha Starr, Rebecca Long, Sadie Santana, Skin Diamond, Tinslee Reagan\r\n\r\nWhat makes ass-crazed Evil Angel director Mike Adriano stand up and take notice? Fans know he focuses on the female butt, the anus in particular. Mike''s newest marathon production, &quot;All Things Anal,&quot; covers his mighty obsession in five all-new scenes. His special formula of POV-style auditions reveals gorgeous girls eagerly submitting to his throbbing cock - giving wet, slobbery blow jobs and opening their backdoors wide for fingers, tongues, and even Mike''s signature speculum! These starlets aren''t shy, showing off massive anal gapes, nasty ass-to-mouth antics, titty fucking, rim jobs and gooey oral cum shots.\r\n\r\nFirst, sexy Polish swinger Natasha Starr and sultry, mixed-race cutie Sadie Santana treat the director''s dick to a double-blow job spiced by ball slurping and ass licking. The girls get royally reamed. Tanned, adorable Tinslee Reagan receives some well-deserved anal discipline, and curvaceous blonde Danielle Delaunay offers her thick, meaty ass and perfect, succulent boobies for an intimate butt-pounding initiation. Pale Goth beauty Asphyxia Noir and sultry black punkette Skin Diamond team up for a three-way ATM slurpfest and Asphyxia''s second-ever on-camera ass reaming! Lastly, petite Mexican doll Crystal Lopez obediently services the director, who leaves her rectum wrecked and gaping. There''s also a bonus titty fuck/messy BJ from plush, naturally buxom redhead Rebecca Lane. For fans of unrestrained sodomy, Mike''s &quot;All Things Anal&quot; displays the many splendors of butt sex in one package. \r\n\r\nSail to another one:\r\n  \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:c8c2221bc11bb4804c46e3d62aab82e3455d5241","amp;dn":"Evil+Angel+-+All+Things+Anal+XXX+DVDRip+%5B.mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c2221bc11bb4804c46e3d62aab82e3455d5241","infoHashBuffer":{"type":"Buffer","data":[200,194,34,27,193,27,180,128,76,70,227,214,42,171,130,227,69,93,82,65]},"announce":[],"urlList":[]}}