{"title":"Gerald Nachman, Right Here on Our Stage Tonight!: Ed Sullivan's ","uid":12352864,"size":1928847,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c93af3283134f4456665de45bae18b79a5f92a62&amp;dn=Gerald+Nachman%2C+Right+Here+on+Our+Stage+Tonight%21%3A+Ed+Sullivan%27s+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1441449079,"description":" Gerald Nachman, Right Here on Our Stage Tonight!: Ed Sullivan's America (PDF)\n\n\nBefore the advent of cable and its hundreds of channels, before iPods and the Internet, three television networks ruled America's evenings. And for twenty-three years, Ed Sullivan, the Broadway gossip columnist turned awkward emcee, ruled Sunday nights. It was Sullivan's genius to take a worn-out stage genre-vaudeville-and transform it into the TV variety show, a format that was to dominate for decades. Right Here on Our Stage Tonight! tells the complete saga of The Ed Sullivan Show and, through the voices of some 60 stars interviewed for the book, brings to life the most beloved, diverse, multi-cultural, and influential variety hour ever to air. Gerald Nachman takes us through those years, from the earliest dog acts and jugglers to Elvis Presley, the Beatles, and beyond. Sullivan was the first TV impresario to feature black performers on a regular basis-including Nat King Cole, Pearl Bailey, James Brown, and Richard Pryor-challenging his conservative audience and his own traditional tastes, and changing the face of American popular culture along the way. No other TV show ever cut such a broad swath through our national life or cast such a long shadow, nor has there ever been another show like it. Nachman's compulsively readable history, illustrated with classic photographs and chocked with colorful anecdotes, reanimates The Ed Sullivan Show for a new generation","torrent":{"xt":"urn:btih:c93af3283134f4456665de45bae18b79a5f92a62","amp;dn":"Gerald+Nachman%2C+Right+Here+on+Our+Stage+Tonight%21%3A+Ed+Sullivan%27s+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c93af3283134f4456665de45bae18b79a5f92a62","infoHashBuffer":{"type":"Buffer","data":[201,58,243,40,49,52,244,69,102,101,222,69,186,225,139,121,165,249,42,98]},"announce":[],"urlList":[]}}