{"title":"odi Taylor - Sister's Slut Training ","uid":12345020,"size":1644299328,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c97720f6d25df55b1f14c864c4ca39ab3a92c2aa&amp;dn=odi+Taylor+-+Sister%27s+Slut+Training+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TKTh3K1ng","files":2,"time":1441340424,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/8aU&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8aU&lt;/a&gt;\n\nJodi Taylor - Sister's Slut Training - Phase One: I have this plan, I just NEED to fuck my sister. But I know once won't be enough. I need to train her to be my slut. Get her to just give it up willingly all the time. I watch her, walking around the house in tight skimpy clothes. I follow her up when shed goes to take a nap. Now is my chance... I touch her and make her wet and horny, she thinks it is a dream. I really take my time getting her turned on, and once I get her really warmed up It isn't hard to make her horny pussy cum. She is having the best wet dream ever. Once she is ready I fuck her soaked little hole and cum all over her. Let her figure out what happened.\n\nJodi Taylor - Sister's Slut Training Phase Two: So my sister, the &quot;college girl&quot; is totally failing her classes. I watch her for a while, savoring what I am going to do. I confront her and she tries to deny things, tries being bossy, but I tell her what I want, she acts like it is crazy, but I can tell some part of her really is getting turned on. She plays it off but soon she is moaning and cumming on my dick, looking up at me as the best fuck of her life.\n\nJodi Taylor - Sister's Slut Training Phase Three: Now I know my sister has been thinking about my cock. She has been playing with herself so Much more since the the last time I fucked her. I watch and record her in the shower, she is such a horny slut now! I let her cum once before busting her. She is not nearly embarrassed enough, sure she gives in so much easier than last time. Now her pussy is desperate for a hard fuck, she is now totally my slut","torrent":{"xt":"urn:btih:c97720f6d25df55b1f14c864c4ca39ab3a92c2aa","amp;dn":"odi+Taylor+-+Sister%27s+Slut+Training+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c97720f6d25df55b1f14c864c4ca39ab3a92c2aa","infoHashBuffer":{"type":"Buffer","data":[201,119,32,246,210,93,245,91,31,20,200,100,196,202,57,171,58,146,194,170]},"announce":[],"urlList":[]}}