{"title":"BangCasting - Selena Santana (Sexy Selina!) 05 September 2015","uid":12350886,"size":343592155,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cc75ee50419ce81c0110c6606931507b27952c4e&amp;dn=BangCasting+-+Selena+Santana+%28Sexy+Selina%21%29+05+September+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VorTeK-ET","files":1,"time":1441422802,"description":"Selina Santana! wWhat can be said about this Latin hottie? Let me tell you guys as soon as I saw Selina walk in to the office I knew it was going to be a great day. Her bubbly personality filled the room and I couldn't help but think to myself, &quot;damn this chick is so fucking hot! she reminds me of Megan Fox in some ways.&quot; Selina has the most luscious lips you'll find in Miami, they give DSL a whole new meaning! When she talks all I could think of is those juice lips wrapped around my cock as she speaks some sort of Spanish naughty talk towards me. As the interview progressed she told me about her real job, Apparently she's a personal assistant to some old lawyer dude, pretty much this old scumbag hired her for her good looks and I don't fucking blame him! She told me that from time to time she would fool around with her boss and her Hubby was totally okay with it. This somewhat blew my mind! because, sitting here is this smoking hot Latina that doesn't need to do porn, yet she wants to because she has a sexual appetite that cant be fulfilled. Selina told me how he loves to be touched and fucked by multiple guys and that the thought of her husband finding one of her videos online got her pussy moist. Selina is that rare breed that knows what she wants and knows how to get it. which is perfectly fine because Im going to give her a fucking of a life time. We got into it and she wanted me to smack her delicious plump ass as i fucked her, she wanted the dick to be given hard and rough, she wouldn't have it any other way. This chick was a real fucking turn on man!\n\n\n &lt;a href=&quot;\nhttp://imgclash.com/img-55ea426b8116e.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclash.com/img-55ea426b8116e.html&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://imgclash.com/img-55ea4265ca7a3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclash.com/img-55ea4265ca7a3.html&lt;/a&gt;","torrent":{"xt":"urn:btih:cc75ee50419ce81c0110c6606931507b27952c4e","amp;dn":"BangCasting+-+Selena+Santana+%28Sexy+Selina%21%29+05+September+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc75ee50419ce81c0110c6606931507b27952c4e","infoHashBuffer":{"type":"Buffer","data":[204,117,238,80,65,156,232,28,1,16,198,96,105,49,80,123,39,149,44,78]},"announce":[],"urlList":[]}}