{"title":"RuinsOfWar_v2000.exe","uid":5299363,"size":626400869,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cce1eb90441a80af19e28297d36e067f72348001&amp;dn=RuinsOfWar_v2000.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1264170372,"description":"[img]http://www.ruinsofwar.com/Banners/RuinsCarpeDiem.jpg[/img]\n\n[b]ROW Europe: Ruins of War starting 22nd January 2010.[/b]\n\nRuins of War is an official hybrid of Risk your life 1, 2 and Return of Warrior. It takes the best elements of the RYL Trilogy and puts them together as the ultimate server.  Is this RYL3 or is this the most epic evolution in the most exciting saga?  We'll let you decide.\n\nRuins of War provides you with the latest features:\n\n- 8 maps including the newest map Kartehena Viceroyalty\n- Numerous Mounts and Costumes to ride on and use\n- New items never seen before, HolySymbol,Wands, VoodoDoll\n- Lucky Drops, Awaken Core and numerous Rare items\n- Stat Based item system that is scaled to cater for every players taste\n- Upgrade Armor, Weapons, Helmets, Shields, Boots, Gloves and Jewellery\n- New Character Growth System so you can truly build your own unique character\n- Over 20 NEW skills never seen before and lots more to come\n- Daily Statue Wars for both high and low levels\n- Weekly Guild Wars with the added ability to war any guild at any given time\n- Over 3000 unique and upgradeable jewellery items\n- over 400 quests included at server launch with 100's more to come\n\nAnd if this isn't enough, Ruins of War is hosting the first ever TRUE skill based PvP Tournament with a [b]***$10,000 USD Cash Prize***[/b]. Yes you read it correctly and it is very real.\n\nEVERY single player will have a chance to qualify and take part in the Tournament.  More information is available at the Ruins of War forums.\nWhen your qualified for the tournament you sign up as a single player or as a team and a tournament character will be created with fixed level and gear that is equal for all players taking part.  There is no difference if you play 10 hours or 100 hours, it all comes down to if you got the PvP skill to win. Nothing more nothing less!\n\nAre you ready to take on the challenge?  Are you ready for the next step in Risk Your Life's evolution?  Are you ready for more events than you can take part in?  Then join us at Ruins of War. See for yourself what the community has to say.\n\nRuins of War webpage: http://www.ruinsofwar.com\n\nRuins of War forum: http://www.ruinsofwar.com/forum\n\nRuins of War blog: http://blog.ruinsofwar.com\n\nWhat you read here is a tip of the iceberg and we think it's fair to say that Ruins of War is the NEW ROW (Return of Warrior)\n\n[img]http://i203.photobucket.com/albums/aa207/galadronx/ROW/img1.jpg[/img]\n\n[img]http://i203.photobucket.com/albums/aa207/galadronx/ROW/img5.jpg[/img]\n\n[img]http://i203.photobucket.com/albums/aa207/galadronx/ROW/img6.jpg[/img]\n\n[img]http://img.photobucket.com/albums/v637/scaletta/FA.jpg[/img]","torrent":{"xt":"urn:btih:cce1eb90441a80af19e28297d36e067f72348001","amp;dn":"RuinsOfWar_v2000.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cce1eb90441a80af19e28297d36e067f72348001","infoHashBuffer":{"type":"Buffer","data":[204,225,235,144,68,26,128,175,25,226,130,151,211,110,6,127,114,52,128,1]},"announce":[],"urlList":[]}}