{"title":"Is God Back (2015).pdf Gooner","uid":12531014,"size":1230380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd0cdba5eb33ccea9afecba92bbd66506d86abf7&amp;dn=Is+God+Back+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1444258377,"description":"Publisher: Bloomsbury Academic (July 2, 2015)\r\nLanguage: English\r\nISBN-10: 1472529030\r\nISBN-13: 978-1472529039\r\n\r\nIs God Back? Reconsidering the New Visibility of Religion examines the shifting boundary between religion and the public sphere in Europe and the Middle East. Asking what the 'new visibility of religion' means and challenging simplistic notions of living in a 'post-secular' age, the chapters explore how religion is contested and renegotiated in the public sphere - or rather, in different publics - and the effects of these struggles on society, state and religion itself.\r\n\r\nWhereas religion arguably never went away in the USA, the re-emergence of public religion is a European phenomenon. Is God Back? provides timely case studies from Europe, as well as extending to the Middle East, where fledgling democracies are struggling to create models of governance that stem from the European secular model, but which need to be able to accommodate a much more public form of religiosity. Discussions include the new visibility of neo-Pagan and Native Faith groups in Europe, Evangelical Christians and Church teaching on sexuality in the UK, and Islamic social Movements in the Arab world.\r\n\r\nDrawing from empirical and theoretical research on religion and national identity, religion and media, church-state relationships, and religion and welfare, Is God Back? is a rich source for students and scholars interested in the changing face of public religion in the modern world, including those studying the sociology of religion, social policy, and theology","torrent":{"xt":"urn:btih:cd0cdba5eb33ccea9afecba92bbd66506d86abf7","amp;dn":"Is+God+Back+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd0cdba5eb33ccea9afecba92bbd66506d86abf7","infoHashBuffer":{"type":"Buffer","data":[205,12,219,165,235,51,204,234,154,254,203,169,43,189,102,80,109,134,171,247]},"announce":[],"urlList":[]}}