{"title":"Spore (PC)","uid":12413091,"size":4155482112,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd758b34fd17ead322a5de281c221e9979eec5a8&amp;dn=Spore+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pcgames.R.us","files":1,"time":1442177559,"description":"\nSpore (PC-Game)\n\nElectronic Arts\nRELEASE DATE- 08/2008\nPROTECTION- Securom\n\n\nThe next evolution in gaming is upon us. From the mind of Will Wright, the\ncreator of The Sims, comes SPORE, an epic journey that takes you from the\norigin and evolution of life through the development of civilisation and\ntechnology and eventually all the way into the deepest reaches of outer\nspace.\n\nBegin your odyssey at the dawn of life as a simple microbe just trying to\nsurvive, then use the fun, intuitive Editors to evolve the creature from\nits microscopic origins into an intelligent, tool-using race. Guide your\nspecies as it builds (and the player designs) villages, buildings, cities,\nand vehicles. Along the way to becoming a global civilisation you can\nchoose whether to hunt or forage, attack or trade, be nice or play rough!\n\nAll the action takes place in a huge, lush world populated with creatures\nevolved by other players and shared over SPOREs central servers. When its\nready, your one-time pond scum launches into space in its UFO on a grand\nvoyage of discovery, planet forming, or destruct-ion! As you explore and\nplay in this limitless universe of unique worlds, your personal Sporepedia\ntracks all the creatures youve met and places youve visited.\n\n\nNOTE: Dont install the download manager, dont start without copying over crack\nfirst, dont register the game with an EA account, and dont go online.\n\nMount or unpack\nInstall as normal\nSerial keys can be generated with &quot;serial KEYS.exe&quot;\n\nAfter installlation\nRun Crack.exe as administrator and it will ask to replace sporeapp.exe in default installation folder:\nC:Program Files (x86)Electronic ArtsSPORESporebin\nIf installed into a different directory, simply browse to that directory and choose &quot;Install&quot; then &quot;yes to all&quot; to replace files with cracked content.\n\nPlay\n\nEnjoy!","torrent":{"xt":"urn:btih:cd758b34fd17ead322a5de281c221e9979eec5a8","amp;dn":"Spore+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd758b34fd17ead322a5de281c221e9979eec5a8","infoHashBuffer":{"type":"Buffer","data":[205,117,139,52,253,23,234,211,34,165,222,40,28,34,30,153,121,238,197,168]},"announce":[],"urlList":[]}}