{"title":"PhotoLine.v15.54.Multilingual.Incl.Keymaker-CORE","uid":5282828,"size":18751214,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cde5eda515107cac63cde40cc560e039addf1811&amp;dn=PhotoLine.v15.54.Multilingual.Incl.Keymaker-CORE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yantrankis","files":4,"time":1263609849,"description":" Professional Image Processing\nIn spite of its low price PhotoLine offers every function needed for professional image processing:\n\n    * 16 bit per color channel\n    * CMYK and Lab color space\n    * Color management with ICC profiles\n\nLossless Image Processing\nLossless image processing is made possible by adding functions to an image without changing the original data. This way you loose no information and have access to the unmodified image data every time you want to.\n\n    * Layer Masks\n      Layer masks hide parts of the accompanying image.\n    * Working Layers\n      Working Layers operate on the image data beneath them. Their field of operation can be restricted by a mask. There are the following Working Layers available: Curves, False Color, Histogram Correction, Hue/Saturation, Color Balance, Unsharp Masking, Gaussian Blur, Median, Perturbation and much more.\n    * Scaling/Rotating\n      If an image is rotated or scaled in a document, the image data won't be modified but only the corresponding information will be added to the image.\n\nDigital Photo Imaging\nPhotoLine offers every function for working with digital photos:\n\n    * Digital Camera Raw Data\n      PhotoLine can import the raw image data - the so-called raw-files - of nearly every digital camera. You can find a detailed list of the supported cameras here.\n    * EXIF Data\n      EXIF data are saved by digital cameras together with the image data. They contain useful informations like the camera model, the focal length, the time of exposure and so on (see also EXIF Data in PhotoLine).\n    * IPTC Data\n      IPTC data are used to add additional informations to an image. Some of these are the author, a description and keywords, that allow categorizing images and this way easier retrieval (see also IPTC Data in PhotoLine).\n    * Corrections\n      PhotoLine offers many functions for enhancing photos:\n          o Light/Shadow adjusts brightness errors.\n          o Connect Images can be used to combine two differently exposed photos to a single better one.\n          o White Point corrects the white point of an image automatically or manually.\n          o The Color Temperature can be set or adjusted.\n          o Chromatic Aberration corrects color distortions at edges.\n          o Image Noise reduces the color and brightness noise in an image.\n          o Red Eyes removes red pupils caused by the flash of the camera.\n          o Lense Correction corrects the distortions caused by the curvature of the lense.\n          o Perspective distortions can easily be fixed by using the layer tool or the rectangular lasso.\n\nAdditional Functions\nIn addition to the functions above PhotoLine offers many more:\n\n    * Standard Filters\n      There is every standard filter available like Unsharp Masking (USM), Sharpen, Soften, Gaussian Blur, Adaptive Soften, Motion Blur, ...\n    * Retouch Filters\n      Optimize Contrast, Remove Dust/Scratches, Descreen, Remove Waste, Deinterlace, ...\n    * Correction Tools\n      Histogram Correction and Online Histogram, curves with contrast, brightness and gamma correction, Hue/Saturation, ...\n","torrent":{"xt":"urn:btih:cde5eda515107cac63cde40cc560e039addf1811","amp;dn":"PhotoLine.v15.54.Multilingual.Incl.Keymaker-CORE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cde5eda515107cac63cde40cc560e039addf1811","infoHashBuffer":{"type":"Buffer","data":[205,229,237,165,21,16,124,172,99,205,228,12,197,96,224,57,173,223,24,17]},"announce":[],"urlList":[]}}