{"title":"Serious Incident Prevention 2nd ed","uid":12551349,"size":6262153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce34d05451ef7633bc0d80116d7051497bdcbed7&amp;dn=Serious+Incident+Prevention+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1444552385,"description":"Serious Incident Prevention - How to Sustain Accident-Free Operations in Your Plant or Company 2nd ed - Thomas E. Burns (Elsevier, 2002).pdf\r\n\r\nISBN 0750675217\r\n\r\nThis is your guide to creating a proactive, effective prevention process. This book presents a model showing you how to systematically identify and execute the steps needed to make your operations incident-free. Its team-based approach draws every level of the organization into the effort. \r\n\r\n\r\n\r\nSerious incidents affect a company's most important and most visible measures of performance, including profitability and company image. Use the author's ground-breaking method for preventing serious incidents, from a team perspective. Whether applied in real-life situations or in the classroom, this method will help you create a safer, more profitable plant.\r\nUp to date information and expanded topic coverage is provided in this new edition. There are two new chapters. One covers leveraging the power of behavior-based techniques and the other covers the benefits of developing teamwork skills. New material features case studies of corporations that have achieved a high degree of success from the implementation of Burns' techniques. Additionally, the author has included safety performance scorecards, a practical and effective tool for preventing serious incidents. \r\n\r\n* Updated with all new material on teamwork skills and behavior-based techniques\r\n\r\n* This unique method shows the user how to prevent serious incidents before they occur\r\n\r\n* Includes cases of real-life examples and safety performance scorecards","torrent":{"xt":"urn:btih:ce34d05451ef7633bc0d80116d7051497bdcbed7","amp;dn":"Serious+Incident+Prevention+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce34d05451ef7633bc0d80116d7051497bdcbed7","infoHashBuffer":{"type":"Buffer","data":[206,52,208,84,81,239,118,51,188,13,128,17,109,112,81,73,123,220,190,215]},"announce":[],"urlList":[]}}