{"title":"Chemistry and Technology of Emulsion Polymerisation","uid":12404068,"size":3132642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ceb6bf6429d0b09a56e0482ce7cad13cb182025e&amp;dn=Chemistry+and+Technology+of+Emulsion+Polymerisation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1442067025,"description":"Chemistry and Technology of Emulsion Polymerisation - A. van Herk (Blackwell, 2005).pdf\n\nISBN: 978-1-4051-2113-2\n\nAn emulsion polymer is prepared by polymerisation of a dispersion of monomer in a liquid, resulting in a colloidal dispersion of solid polymer in that liquid, and they are used extensively in the paints, paper &amp; paperboard, textiles, packaging and adhesives &amp; sealants industries. Emulsion polymerisation is a technologically and commercially important reaction, producing high value polymers in a low cost, environmentally friendly process, but the reaction is complex and governed by the interplay of many chemical and physical processes. The successful industrial application of emulsion polymerisation relies on the understanding and control of a range of chemical and physical processes, including polymerisation kinetics and dispersion stability. By carefully explaining the theoretical underpinning of the subject, based on well-designed experimental observations, this book will provide a practical and intuitive explanation of emulsion polymerisation processes. understanding with the everyday practice can be an additional difficult step, so this book will put great emphasis on a clear, comprehensible and straightforward presentation to illustrate how theory relates to practical application","torrent":{"xt":"urn:btih:ceb6bf6429d0b09a56e0482ce7cad13cb182025e","amp;dn":"Chemistry+and+Technology+of+Emulsion+Polymerisation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb6bf6429d0b09a56e0482ce7cad13cb182025e","infoHashBuffer":{"type":"Buffer","data":[206,182,191,100,41,208,176,154,86,224,72,44,231,202,209,60,177,130,2,94]},"announce":[],"urlList":[]}}