{"title":"Dr. A.P.J. Abdul Kalam Books 2 (Happy B day Sir )","uid":12579372,"size":1319192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1000d9fec090a2090b995c94c2409de4db060e7&amp;dn=Dr.+A.P.J.+Abdul+Kalam+Books+2+%28Happy+B+day+Sir+%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mdusanjay","files":4,"time":1444936423,"description":"1) Governance for Growth in India by A.P.J. Abdul Kalam\r\n\r\nOverview: As India chooses its 16th Lok Sabha in 2014, and voters across the country are debating and discussing matters related to governance and elections, this book, from someone who has observed our national life at close quarters, is a visionary statement for every citizen to read and understand.\r\nDr A.P.J. Abdul Kalam, who was India’s eleventh President, and has been a scientist, a technocrat, a teacher and thinker, brings his vast experience and keen eye for detail to bear in discussing various aspects of governance. He articulates a vision for India and what each citizen must do to make it a reality—it is only by being honest, morally upright, and by working hard that we can achieve the mission of a developed India. Dr Kalam also proposes realistic, step-by-step solutions to issues of corruption, governance and accountability. Optimistic, progressive and positive, he dreams of an India that can achieve wholesome development for every citizen.\r\n\r\n\r\n2) The Guiding Light: A Selection of Quotations from My Favourite Books by A.P.J. Abdul Kalam\r\n\r\nOverview: From his schooldays to this day, when he is over eight decades old, Dr Kalam has been a lover of the written word. In The Guiding Light, he chooses the finest examples of writings from the numerous books, religious texts, philosophical tracts and poetry that he has read over the years. These words have impacted and shaped his thinking, helped him in times of need and made him the person he is. He has quoted from these works in his writings and lectures that have inspired millions of people he has met all over the world. \r\n\r\n3) The Righteous Life: The Very Best of A. P. J. Abdul Kalam by A. P. J. Abdul Kalam\r\n\r\nOverview: Dr Kalam, who was India’s eleventh President and has been a scientist and a teacher, has written more than twenty books. Ranging from inspirational and spiritual thoughts, to autobiographical reflections to his vision statements for a developed India, these works bear the imprint of a mind that is deeply reflective.\r\nFor the first time, some of the most thoughtful, inspiring and educative of these writings have been compiled in one place in The Righteous Life. Some of the essays in this volume describe his early life, family and teachers and his entry into the world of scientific development and research. Also included are his thoughts on education, governance, probity in public life, and his analysis and solutions to some of India’s problems such as corruption, energy independence and the overall development of the country. \r\n\r\n4) The Scientific Indian : A Twenty-First Century Guide To The World Around Us by A.P.J. Abdul Kalam\r\n\r\nOverview: Nuclear capability; self-sufficiency in food production; an array of indigenous satellites and missiles; an unmanned Moon mission—India’s achievements in the scientific domain in recent years have been spectacular. But; according to the country’s best-known scientist A.P.J. Abdul Kalam and his close associate Y.S. Rajan; we’ve only just begun. In a century that many experts predict may belong to India; the realization of the vision of a better future for everyone will require a keen understanding of our needs and this can only be achieved by tailoring our research and innovations to the goal of national development. \r\n\r\nDont miss the first part:\r\n \nhttps://thepiratebay.la/torrent/12165652/Dr._A.P.J._Abdul_Kalam_Books__%28RIP%29","torrent":{"xt":"urn:btih:d1000d9fec090a2090b995c94c2409de4db060e7","amp;dn":"Dr.+A.P.J.+Abdul+Kalam+Books+2+%28Happy+B+day+Sir+%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1000d9fec090a2090b995c94c2409de4db060e7","infoHashBuffer":{"type":"Buffer","data":[209,0,13,159,236,9,10,32,144,185,149,201,76,36,9,222,77,176,96,231]},"announce":[],"urlList":[]}}