{"title":"Flesh for the Beast (2003)","uid":12406235,"size":1169010688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1074433d5a60d12f754361aa161edf42655aed9&amp;dn=Flesh+for+the+Beast+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"galex-713","files":1,"time":1442096056,"description":"Bad quality BRRip\nDuration: 1:29:35\nVideo: MPEG-4 (XVID), 688x384, 23.976fps, Planar 4:2:0 YUV\nAudio: English, MPEG Audio layer 3 (mp3), Stereo, 48 000Hz, 128kb/s\n\nYear: 2003\nDirected by: Terry West\nActors:  Jane Scarlett, Sergio Jones and Clark Beasley Jr.\nLanguage: English\nCountry: USA\n\nDescription:\nOne hundred years ago the occultist finds a magical amulet and creates three flesh eating succubus for his brothel. Every day, they demanded from him a fresh flesh, which he could not provide them in sufficient quantities. And one day they killed and ate him.. In our days a group researchers in the field of parapsychology decided to visit an abandoned brothel, there they face with the evil.\n\n\nSynopsis (from Wikipedia):\nA group of parapsychologists are called in to investigate a mansion with a reputation for being haunted, as it was previously a brothel where many men would go missing. One of the investigators, Erin Cooper (Jane Scarlett) finds herself particularly drawn to the place. As the night progresses the group discovers that they are not alone and that three succubi inhabit the house, imprisoned by a warlock's amulet. The amulet would give its user the ability to control the succubi, giving them extreme amounts of power. The succubi kill the group members one by one as the group tries desperately to discover the amulet's whereabouts and perform a ritual that would stop the succubi. However the survivors are eventually pared down to two people, one of which is killed while trying to begin the ritual after finding the amulet. The survivor, Erin, is then revealed to have been a succubus all along. She had been the warlock's favorite and somehow had lost her memories and gained the ability to leave the mansion. Erin then rejoins the other succubi in the mansion.\n\nSource: &lt;a href=&quot;\nhttp://wipfilms.net/vampire-witches-werewolves/flesh-for-the-beast/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wipfilms.net/vampire-witches-werewolves/flesh-for-the-beast/&lt;/a&gt;\nfirst hit on Google (use a proxy, DuckDuckGo, StartPage or Ixquick instead of Google itself please) for &quot;Flesh for the Beast download&quot; and the only one working (after a lot of search), and gives this link: &lt;a href=&quot;\nhttp://wipfiles.net/supykcf9bb1g.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wipfiles.net/supykcf9bb1g.html&lt;/a&gt;\nwhich fails after some time each time on beginning, downloading at 100kb/s max","torrent":{"xt":"urn:btih:d1074433d5a60d12f754361aa161edf42655aed9","amp;dn":"Flesh+for+the+Beast+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1074433d5a60d12f754361aa161edf42655aed9","infoHashBuffer":{"type":"Buffer","data":[209,7,68,51,213,166,13,18,247,84,54,26,161,97,237,244,38,85,174,217]},"announce":[],"urlList":[]}}