{"title":"Fantastic Four World's Greatest Heroes (720p)","uid":12330737,"size":7499778470,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d20b3add5bce41d6cf9718b677ab9a5908bd7a8e&amp;dn=Fantastic+Four+World%27s+Greatest+Heroes+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":26,"time":1441187470,"description":"Fantastic Four: World's Greatest Heroes is an animated television series based on the Marvel Comics' Fantastic Four comic book series. The series is the team's fourth foray into animation, and combines two-dimensional anime-style art as well as three-dimensional computer animation produced by the France-based animation company MoonScoop Group. The series is produced by MoonScoop division Taffy Entertainment in collaboration with M6 and Cartoon Network Europe.\n\nWorld's Greatest Heroes is not directly connected to any of the previous iterations of the Fantastic Four, telling its own version of the team's origin and their encounters with their rogues gallery. Unlike its 1990's predecessor, which consisted almost entirely of straight or modified reinterpretations of classic FF comic book stories, World's Greatest Heroes features mostly original stories. Nonetheless, elements from various iterations of the Fantastic Four, such as the Stan Lee/Jack Kirby, John Byrne and Mark Waid runs in the original FF comic book, the Ultimate Fantastic Four comic, and the 2005 live action film, were used as the basis for the series' look and feel. The series ended with an appearance from Terminus, who was used instead of the FF's more notable globe-threatener, Galactus","torrent":{"xt":"urn:btih:d20b3add5bce41d6cf9718b677ab9a5908bd7a8e","amp;dn":"Fantastic+Four+World%27s+Greatest+Heroes+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d20b3add5bce41d6cf9718b677ab9a5908bd7a8e","infoHashBuffer":{"type":"Buffer","data":[210,11,58,221,91,206,65,214,207,151,24,182,119,171,154,89,8,189,122,142]},"announce":[],"urlList":[]}}