{"title":"Private Xtreme 1 - Bacchanal 2002 DVDRip","uid":12594403,"size":1962834539,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d377accfc26fe0a2c588ba332cdade280d706deb&amp;dn=Private+Xtreme+1+-+Bacchanal+2002+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"EndYou","files":1,"time":1445204084,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/iN \nhttp://imgpremium.com/image/iQ\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 2002\r\nRussian language\r\nTransfer 1: Professional voiceover dvuhgolosyj\r\nTranslation 2: odnogolosyj SP Company\r\nExtras. Languages: English\r\nCountry: Europe\r\nGenre: Feature, European, Anal, DP, A2M\r\nDuration: 1:42:28\r\nDirected by: Jean-Yves Le Castel\r\nStudio: Private\r\n\r\nJane Darling as Jana, Daniella Schiffer as Daniella, Alissa, Sarah O'Neal as Slavka, Julia Crow as Katerina, Myli, Steve Holmes, David Perry, Csoky as Csaki\r\n\r\nX-treme is definitely the key word here with the frantic fucking filling the movie with barely time to catch your breath. This is pussy pounding, ass gaping, cum splashing Lecastel at his best. Two DPs, Six scenes, and well over 100 minutes of pure Private pleasure.\r\n\r\nA fruity fuckfest and no mistake, six slavering sluts spend their sun drenched days picking plump juicy grapes and having their plump juicy pussies pumped full of the finest vintage cum. The rolling vineyards and cool cellars of Hungarys wine country are the backdrop to this tantalizing tipple of a most potent variety and Alissa, Daniela, Myli, Slavka, Jana and Katerina are the winsome wenches all ripe for a good rodgering as they take it up the ass, in the pussy, between their luscious lips and deliver the most devastatingly hot DP in 6 sizzling scenes and over an hour and three quarters of horny hardcore action.\r\n\r\nExtreme - key word in this film, which you breathless. It's filled with the best pussy, gaping assholes, splashes of semen in the best traditions Lekastelya. Two double penetration, six scenes and more than 100 minutes of pure pleasure from Private.\r\n\r\nFruit sex festival - not the fault of six sluts who spend sunny days for picking ripe juicy grapes and get their plump juicy pussy cum excellent. Beautiful vineyards and old wine cellars cool Hungary are a great backdrop for this tantalizing drinks from the beautiful and diverse girls like Alyssa, Daniel Schiffer, Miley, Sarah O'Neill, Jane Darling and Julie Crowe, as they take it in the ass, in pussy, between their luscious lips and deliver maximum fun in a hot double penetration in 6 scorching hot scenes and 100 minutes of exciting sexual action.\r\n\r\nThe scene featuring Jane Darling and David Perry was nominated as the best sex scenes in the Foreign Language Film in 2003 - AVN Awards Nominee: Best Sex Scene in a Foreign-Shot Production.\r\n\r\nQuality: DVDRip 544p\r\nFormat: MKV\r\nVideo codec: H.264 / AVC\r\nAudio codec: AC-3\r\nVideo: MPEG4 Video (H264) 720x544 25 fps 2000 kb / s\r\nAudio: Dolby AC3 48000Hz stereo 192 kb / s\r\n\r\nIf you like this torrent, pleasehere![/url][/size] for more exclusive torrents!","torrent":{"xt":"urn:btih:d377accfc26fe0a2c588ba332cdade280d706deb","amp;dn":"Private+Xtreme+1+-+Bacchanal+2002+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d377accfc26fe0a2c588ba332cdade280d706deb","infoHashBuffer":{"type":"Buffer","data":[211,119,172,207,194,111,224,162,197,136,186,51,44,218,222,40,13,112,109,235]},"announce":[],"urlList":[]}}