{"title":"care bears care-a-lot-jamboree","uid":12537231,"size":93118401,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d47d01e4132f9f5e7f11f35374aa8afd1a27c848&amp;dn=care+bears+care-a-lot-jamboree&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wearehidden","files":1,"time":1444337534,"description":"Join 10 of your favorite Care Bears on a rainbow-filled Jamboree!Product InformationPlay eight exciting games and learn about caring and sharing from these adorablefurry friends. Learn to match solve puzzles and have fun in the Care Bear'sstar-speckled cloud wonderland!  Care Bears include: Share Bear Good Luck Bear Bedtime Bear Funshine Bear Friend Bear Cheer Bear Grumpy Bear Love-a-lot Bear Wish Bear Tenderheart BearFun Activities IncludeCare-a-lot WishesWish Bear wants to send good wishes to all of her friends at Care-a-lot Castlebut she needs your help! Guide her and her Star Buddy to send happy feelingsdown the Good Wish path to win the game.Lucky Treasure ChestGood Luck Bear and found a treasure trove of good fortune! Help him line up 3happy feeling icons that touch to collect them in his treasure chest. Fill thechest to win the game.Gift TossEveryone loves to receive presents and Share Bear is in the mood for giving!Collect the presents for the big birthday party and toss gifts to each friendand make their day!Find a FriendHelp Friend Bear find her friends in pairs! Open the castle windows to revealthe character. Get rewarded with happy hearts when you match a Care Bear pair.Cheer up Grumpy BearGrumpy Bear needs cheering up! Help Cheer Bear slide the puzzle pieces into theempty spaces to reach Grumpy Bear and give him some cheer.Bubble TroubleFunshine Bear needs your help!  Multicolored bubbles are floating in thesky and they need to be popped. Clear all of the bubbles to win the game and endFunshine Bear's troubles.Catch a Little LoveHearts are dropping from the clouds!  You get to help Love-a-lot Bear andTenderheart Bear catch a little love in their basket. When you get the basketfull of hearts you win the game.Star Swing ChallengeBedtime Bear is sending sweet dreams to everyone! Help him fill the sky withlots of happy thoughts by swinging his Star Buddies through the night air. Aimcarefully and hit the cloud targets to win.\r\nSystem:Windows\r\nSize:88.8MB\r\n•\tRelease Date: August 2, 2004","torrent":{"xt":"urn:btih:d47d01e4132f9f5e7f11f35374aa8afd1a27c848","amp;dn":"care+bears+care-a-lot-jamboree","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d47d01e4132f9f5e7f11f35374aa8afd1a27c848","infoHashBuffer":{"type":"Buffer","data":[212,125,1,228,19,47,159,94,127,17,243,83,116,170,138,253,26,39,200,72]},"announce":[],"urlList":[]}}