{"title":"iBackupBot 5.3.2 (Mac OSX)","uid":12473850,"size":12683806,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:d8567b2d866ed64cb00871014facf7f5a4d05429&amp;dn=iBackupBot+5.3.2+%28Mac+OSX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MacTake","files":2,"time":1442951557,"description":"From MacTake.com\n\niBackupBot gives you the ability to browse, view, export, and modify iTunes backup files. With its built-in plist editor, hex editor, text editor, database viewer, image viewer, SMS message viewer, notes viewer, address book viewer, and media browser, you can view and edit any file that iTunes backed up from iPad/iPhone/iPod Touch to your computer.\n\nWhen you connect your iPad, iPhone or iPod touch to your computer, or right click iPad, iPhone or iPod Touch in iTunes and select Back Up, certain files and settings on your iPhone or iPod touch are automatically backed up to your computer. You can restore this information if you need to (if you get a new iPhone, for example, and want to transfer your previous settings to it).\n\nThe backed-up information includes text messages, notes, call history, contact favorites, sound settings, widget settings, and more. In addition, photos in Camera Roll on your iPhone or in Saved Photos on your iPod touch are also backed up.\n\niBackupBot can export SMS messages, notes, and address book to a text file or an Excel file. It also gives you the ability to edit backup files and restore them to your iPhone/iPod Touch, so you can do many things that you could not do before, e.g., customize carrier name, modify game data files, and more--and no jailbreak required!\n\nWhy would I use iBackupBot?\n\n- If you to want view and export SMS messages, Contacts, Notes for sharing with friends or for archiving.\n- If you lost your iPhone, you need iTunes Backup Manager to view and export your SMS messages, Contacts, Notes, and so on.\n- If you want to maintain multiple backups of different times for one iPhone or iPod Touch, and freely select which one to restore.\n- If you want browse and export media contents include Camera Roll, Voice Memo, Voicemail and others","torrent":{"xt":"urn:btih:d8567b2d866ed64cb00871014facf7f5a4d05429","amp;dn":"iBackupBot+5.3.2+%28Mac+OSX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8567b2d866ed64cb00871014facf7f5a4d05429","infoHashBuffer":{"type":"Buffer","data":[216,86,123,45,134,110,214,76,176,8,113,1,79,172,247,245,164,208,84,41]},"announce":[],"urlList":[]}}