{"title":"High Efficiency Video Coding (2015).pdf Gooner","uid":12479661,"size":9330056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d90d4e8781459613fd8a7092c576e166125613cf&amp;dn=High+Efficiency+Video+Coding+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1443032183,"description":"Publisher: Springer; 2015 edition (September 30, 2014)\nLanguage: English\nISBN-10: 3662442752\nISBN-13: 978-3662442753\n\nThe video coding standard High Efficiency Video Coding (HEVC) targets at improved compression performance for video resolutions of HD and beyond, providing Ultra HD video at similar compressed bit rates as for HD video encoded with the well-established video coding standard H.264/AVC. Based on known concepts, new coding structures and improved coding tools have been developed and specified in HEVC. The standard is expected to be taken up easily by established industry as well as new endeavors, answering the needs of todays connected and ever-evolving online world.\n\nThis book presents the High Efficiency Video Coding standard and explains it in a clear and coherent language. It provides a comprehensive and consistently written description, all of a piece. The book targets at both, newbies to video coding as well as experts in the field. While providing sections with introductory text for the beginner, it suits as a well-arranged reference book for the expert. The book provides a comprehensive reference for the technical details of the employed coding tools; it further outlines the algorithmic advances compared to H.264/AVC. In addition to the technical aspects, the book provides insight to the general concepts of standardization, how specification text is written, and how these concepts apply to the HEVC specification","torrent":{"xt":"urn:btih:d90d4e8781459613fd8a7092c576e166125613cf","amp;dn":"High+Efficiency+Video+Coding+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d90d4e8781459613fd8a7092c576e166125613cf","infoHashBuffer":{"type":"Buffer","data":[217,13,78,135,129,69,150,19,253,138,112,146,197,118,225,102,18,86,19,207]},"announce":[],"urlList":[]}}