{"title":"Forsthoffer's Rotating Equipment Handbook","uid":12614678,"size":117316846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9fcaede47f323e0335c9ba6a35011da4a7d3c6e&amp;dn=Forsthoffer%27s+Rotating+Equipment+Handbook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1445501740,"description":"Forsthoffer's Rotating Equipment Handbook (Elsevier, 2005).pdf\r\n\r\nOver recent years there have been substantial changes in those industries which are concerned with the design, purchase and use of special purpose (ie critical, high-revenue) rotating equipment. Key personnel have been the victims of early retirement or have moved to other industries: contractors and end-users have reduced their technical staff and consequently have to learn complex material 'from scratch'. \r\n\r\nAs a result, many companies are finding that they are devoting unnecessary man hours to the discovery and explanation of basic principles, and having to explain these to clients who should already be aware of them. In addition, the lack of understanding by contractors and users of equipment characteristics and operating systems often results in a 'wrong fit' and a costly reliability problem. \r\n\r\nThe stakes can be high, and it against this background that Forsthoffer's Rotating Equipment Handbooks have been published. Each is the outcome of many years experience and is based on well-honed teaching material which is easily readable, understandable and actually enjoyable!\r\n\r\nThe result is a set of books which will enhance rotating equipment reliability and safety throughout the many industries where such equipment is vital to a successful business.\r\n\r\nThis is a five volume set. The volumes are:\r\n1: Fundamentals of Rotating Equipment\r\n2: Pumps\r\n3: Compressors\r\n4: Auxiliary Equipment\r\n5: Component Condition Monitoring/ Root Cause Analysis \r\n\r\n* A five volume set which is the distillation of many years of on-site training by a well-known US Engineer who also operates in the Middle East.\r\n\r\n* These are PRACTICAL books written in a succinct style and well illustrated throughout.\r\n\r\n* They concentrate on MAINTENANCE and RELIABILITY of machinery so as to reduce down time and cost","torrent":{"xt":"urn:btih:d9fcaede47f323e0335c9ba6a35011da4a7d3c6e","amp;dn":"Forsthoffer%27s+Rotating+Equipment+Handbook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9fcaede47f323e0335c9ba6a35011da4a7d3c6e","infoHashBuffer":{"type":"Buffer","data":[217,252,174,222,71,243,35,224,51,92,155,166,163,80,17,218,74,125,60,110]},"announce":[],"urlList":[]}}