{"title":"Face.of.Britain.by.Simon.Schama.s01e01.EN.SUB.x264.WEBRIP.[MPup]","uid":12527392,"size":1064185592,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:daac8f206ad8cd4d6404b4b8024376004d95a0ee&amp;dn=Face.of.Britain.by.Simon.Schama.s01e01.EN.SUB.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1444153568,"description":"Face of Britain by Simon Schama s01e01 EN SUB x264 WEBRIP [MPup] The Face of Power\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]1 of 5[/b]\r\n\r\nSimon Schama explores the history of British portraiture. Simon looks at the eternal power of portraiture and sees how it can foster loyalty and control.\r\n\r\n[img]http://extraimago.com/images/2015/10/04/f6ef278c8634cebd885daeea790817c6.jpg[/img]\r\n\r\nIn the first episode in the series, Simon Schama explores the eternal power of portraiture. Before we can walk, before we can talk, we become readers of faces, and throughout our lives face reading helps us to navigate the world. This primal engagement with the face makes portraiture one of the most compelling forms of art. Beginning with an exploration of how a portrait, commissioned to celebrate Winston Churchill's 80th birthday, ended in disaster for both artist and sitter, Schama discovers how portraits can involve a battle for control and - from the destruction of the faces of Christ and the Virgin during the Reformation, to Elizabeth I's fabulous feats of image making - demonstrates the importance of portraiture in fostering loyalty. Schama shows how royalists and parliamentarians fought over the image of the executed Charles I during the Civil War and how the aristocracy used portraiture to assert their dominion over the realm in the 18th century. Through the pioneering political cartoons of James Gillray, he explores how the powerful lost control of their image to the snigger of the streets. Simon looks at how photography allowed Queen Victoria to rebrand the monarchy as a modern family and discusses the role Margaret Thatcher's rigid control of her image played in launching her political career","torrent":{"xt":"urn:btih:daac8f206ad8cd4d6404b4b8024376004d95a0ee","amp;dn":"Face.of.Britain.by.Simon.Schama.s01e01.EN.SUB.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daac8f206ad8cd4d6404b4b8024376004d95a0ee","infoHashBuffer":{"type":"Buffer","data":[218,172,143,32,106,216,205,77,100,4,180,184,2,67,118,0,77,149,160,238]},"announce":[],"urlList":[]}}