{"title":"Rachel Sweet - Then He Kissed Me/Be My Baby  (2nafish)","uid":5293228,"size":112879620,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:db819c0e1e9d1a1316e46b2258b3732281d3a476&amp;dn=Rachel+Sweet+-+Then+He+Kissed+Me%2FBe+My+Baby++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1263967449,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n\nRachel Sweet - Then He Kissed Me/Be My Baby (Live-Beat Club) (2nafish)\n\n\n\nRachel Sweet (born July 28, 1962, Akron, Ohio, United States) is an American singer, writer and actress.\n\nShe began recording country music in 1976, but with little success. Switching to rock and roll, she signed to the British Stiff Records label and released her first album, Fool Around, in 1978. Sweet was backed by The Records on the Stiff Records tour in 1978. The album was a critical success, but sales were poor, although she did have some success with the single &quot;B-A-B-Y&quot;. She also generated some controversy for her Lolita-like image (predating similar controversies surrounding Britney Spears and others by many years). Her follow-up album, Protect the Innocent, was largely ignored by the public and the music media. She then signed to Columbia Records in 1981, releasing ... And Then He Kissed Me, which launched the hit single, &quot;Everlasting Love&quot;, a duet with Rex Smith.\n\nSweet only released one more album, 1982's Blame it on Love before retiring. She returned to music sporadically as she focused on her education, recording the title track to John Waters' film Hairspray and many of the songs for his musical Cry Baby. In 1989 and 1990, she hosted a show on The Comedy Channel (forerunner of Comedy Central) called The Sweet Life. She also recorded the theme song to the Nickelodeon series Clarissa Explains It All; the theme song was a reworking of the theme song for her show on The Comedy Channel, The Sweet Life. In 1992 appeared in a minor role as George Costanza's cousin on an episode of Seinfeld, &quot;The Contest.&quot; She has since focused on establishing an acting, writing, and producing career.\n\nIn 1982, she had a starring role in a low-budget film musical titled Rock 'n' Roll Hotel, which also featured Judd Nelson. It was filmed in Richmond, Virginia, at the then-inoperative Jefferson Hotel, site of the staircase that inspired the scene in Gone With the Wind. The Sweet film was never released to theaters, but was eventually finished by Sweet and her father and shown on Home Box Office.\n\nIn 1992 Rhino Records released Fool Around: The Best of Rachel Sweet. The CD compilation included tracks from all the previous releases as well as the theme to Hairspray.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:db819c0e1e9d1a1316e46b2258b3732281d3a476","amp;dn":"Rachel+Sweet+-+Then+He+Kissed+Me%2FBe+My+Baby++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db819c0e1e9d1a1316e46b2258b3732281d3a476","infoHashBuffer":{"type":"Buffer","data":[219,129,156,14,30,157,26,19,22,228,107,34,88,179,115,34,129,211,164,118]},"announce":[],"urlList":[]}}