{"title":"The Upperfloor--tUF-38480 Mia Austin, Aiden Starr and Mickey Mod","uid":12402709,"size":3008213504,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:dc5978bafc1ce7e5fe60fedf015be5876f576122&amp;dn=The+Upperfloor--tUF-38480+Mia+Austin%2C+Aiden+Starr+and+Mickey+Mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":100,"time":1442049620,"description":"Fresh Pussy Slave Degraded and Brutally Fucked\n\nSep 11, 2015 - Performers: Aiden Starr ,  Mickey Mod  and  Mia Austin \n\n\nMed and HD MP4 + Pics.\n\n\nIt is Mia Austin's great misfortune that her sister slave couldn't take the heat and left her to serve a full orgy, an evil Governess and a horny Butler all by her lonesome. This tight bodied and gorgeous little submissiove slut is more than up to snuff, and takes all the pain and all the pleasure we can dish out. Her perfect fresh pussy clamped while she made to degrade herself and wimper like a puppy in front of a laughing crowd. Her hungry pussy calls to the Governess' sadistic sensibilities, and soon she tied in a pile driver squirting on her own face with the Butler's fist in her tight cunt. Mia cums uncontrollably and painfully, begging for mercy and thanking The House in turn. \n\nDespite her slutty fuck skills, Mia gives way too polite of a blow job and is knocked off the dick by The Governess who shows her how to give a true whore's blow job. Mia crawls under the Governess' cunt like a hungry puppy and starts licking her ass and moaning until The Steward takes pity on her pussy and makes her cum all over the carpet. Fresh from her lesson she swallows cock, drools, and screams as an orgy of horny guests cheer her on. \n\nThe Governess is not done with this slut and ties her in a brutally tight standing position so she can helplessly watch the Governess fuck all the hard cock while she gets none. Let is never be said that Aiden is not kind. She made sure to clean her pussy off the Butler's cock and spit it in Mia's face before fisting her relentlessly into several painful orgasms. \n\nFinally this little pain puppy has earned herself a ride on the Butler's hard dick and makes much use of the challenge, eyes crossed and slamming down on the Butler's cock while the Governess' tortures her sensitive nipple with tight metal clamps. Thrown onto her back and lapping at the Governess' cunt while she takes her own ride on Butler, Mia begs to have a clit shocked with the zapper and impresses even the Governess with her final pile driver fuck before coaxing a load out of the Butler.\n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=38480&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot.jsp?shootId=38480&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n18 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers :-)","torrent":{"xt":"urn:btih:dc5978bafc1ce7e5fe60fedf015be5876f576122","amp;dn":"The+Upperfloor--tUF-38480+Mia+Austin%2C+Aiden+Starr+and+Mickey+Mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc5978bafc1ce7e5fe60fedf015be5876f576122","infoHashBuffer":{"type":"Buffer","data":[220,89,120,186,252,28,231,229,254,96,254,223,1,91,229,135,111,87,97,34]},"announce":[],"urlList":[]}}