{"title":"The Bloody Albooz ","uid":12355427,"size":795990678,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:dcea32844bebb47bd509e5b86a42ba9a29f3a66a&amp;dn=The+Bloody+Albooz+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":158,"time":1441469597,"description":"The Bloody Alboz is the second album by Albanian rapper, Unikkatil. Released on November 5, 2005, the album features appearances from famous Albanian rappers, Presioni, Jetoni, Klepto, Milot.\n\nIn this folder is also included the album : Shihemi N'perkujtime (2004) which is the first album of Unikkatil.\n\nIt's included also the album :Armiqt Suprem (2006) which is the third album of Unikkatil.\n\nIt's included also the album: Kanuni I Katilit (2008) which is the fourth album and the last one of Unikkatil ,for the moment.\n\nUnikkatil is preparing to launch the fifth album in coming months.\n\nIn this folder are also included 82 single songs by : Unikkatil,Presioni, Jetoni, Klepto, Milot, Cyanide, Buja, Kobra aka Helmuesi, Vz,D.M.K and other Albanian rappers.\n\nIt should be mentioned that Unikkatil hasn't ani song with video, all of his songs are with images. \n\nIt is one of the singers that has broken every record for album sale. For only one week he has sold over 20.000 copies of his first album ( Shihemi N'perkujtime)\n\n With the song &quot;Red and Black&quot; video during the first 24 hours it has been  commented by 100,000 people. \n\nAlso the song &quot;U qova vorri prej vorri&quot; after 24 hours of laucned, the video was clicked over 1,500,000 times, which is a big hit for an Albanian rapper.\n\nUnikkatil is known one one the first rapper in Albanian scene.\n\nAlso TBA ( THE BLOODY ALBOOZ) in 2012 had made one concert in the stadium of Pristina , the capital city of Kosovo, where over 25000 people attended on one of the biggest concert  ever made on Kosovo","torrent":{"xt":"urn:btih:dcea32844bebb47bd509e5b86a42ba9a29f3a66a","amp;dn":"The+Bloody+Albooz+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcea32844bebb47bd509e5b86a42ba9a29f3a66a","infoHashBuffer":{"type":"Buffer","data":[220,234,50,132,75,235,180,123,213,9,229,184,106,66,186,154,41,243,166,106]},"announce":[],"urlList":[]}}