{"title":"Stossel.2015.10.02.Playing.The.Victim","uid":12603016,"size":329763679,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dda665874635aeb0ddbb5880d79a271a52e407e1&amp;dn=Stossel.2015.10.02.Playing.The.Victim&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BBreach","files":1,"time":1445351020,"description":"_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nJohn F. Stossel is an American consumer reporter, investigative journalist, author, libertarian columnist, and former co-anchor for the ABC News show 20/20. In this show he looks at consumer-focused topics, such as civil liberties, the business of health care, and free trade\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nThe Cult of Victims\r\nJohn Stossel | September 30, 2015\r\n\r\nThe world has enough real problems without declaring everyone a &quot;victim.&quot;\r\n\r\nBill Clinton says Hillary is a victim of a right-wing conspiracy.\r\n\r\nLindsay Lohan, when jailed for driving drunk and breaking parole, says she's a victim of cruel and unusual punishment.\r\n\r\nMichael Sam says his NFL career would have gone better had he not come out as gay.\r\n\r\nA Philadelphia dentist caught groping his patients' breasts said he is a victim of frotteurism, a disease that compels you to fondle breasts. Really.\r\n\r\nPeople benefit by playing the victim.\r\n\r\nActivists look for people they can declare victims, to bring attention to their causes.\r\n\r\nThe New York Times once called the Super Bowl the &quot;Abuse Bowl,&quot; claiming that during the game many more women are abused than usual because their men get crazed watching violence. CBS called Super Bowl Sunday a &quot;day of dread.&quot; The Boston Globe claimed a study showed calls to anti-violence emergency lines go up 40 percent during the game.\r\n\r\n\r\nThen Ken Ringle of the Washington Post tried to trace those claims.\r\n\r\nThe Globe reporter admitted she never saw the study in question but got the numbers from the left-wing group Fairness and Accuracy in Reporting. FAIR said they got them from a psychiatrist on &quot;Good Morning America.&quot; That psychiatrist referred callers to another psychiatrist, who said, &quot;I haven't been any more successful than you in tracking down any of this.&quot;\r\n\r\n\r\nThe &quot;Super Bowl victim&quot; claim was bunk.\r\n\r\nSometimes I feel like a victim. I stutter. Had today's disability laws existed when I began work, would I have fought to overcome my stuttering? Maybe not. I might have sued my employer, demanding they &quot;accommodate my disability&quot; by giving me a non-speaking job. Maybe I would have just stopped working and collected a disability check.\r\n\r\nI also felt like a victim the day I taped a TV report on how pro-wrestling is fake, and a wrestler beat me up, hitting me on both ears.\r\n\r\nWeeks afterward, loud noises hurt my ears. Someone then said that that the wrestler's boss, Vince McMahon, told him to hit me, so I sued McMahon.\r\n\r\nAs part of the lawsuit, McMahon's lawyers demanded I see a certain doctor, who told me, &quot;Your ear pain is a  jurosomatic illness.&quot;\r\n\r\n&quot;What's that?&quot; I said.\r\n\r\nHe answered, &quot;Jurosomatic ... like psychosomatic. You hold onto your ear pain because you're involved in a lawsuit.&quot;\r\n\r\nI was furious. I screamed at him, &quot;You haven't even examined me, and you make this accusation?&quot;","torrent":{"xt":"urn:btih:dda665874635aeb0ddbb5880d79a271a52e407e1","amp;dn":"Stossel.2015.10.02.Playing.The.Victim","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda665874635aeb0ddbb5880d79a271a52e407e1","infoHashBuffer":{"type":"Buffer","data":[221,166,101,135,70,53,174,176,221,187,88,128,215,154,39,26,82,228,7,225]},"announce":[],"urlList":[]}}