{"title":"Parking.Wars.2015.s01e03.EN.SUB.WEBRIP.[MPup]","uid":12522878,"size":527122851,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:de96f042930d9c164ad3b93757ca24c6a804785a&amp;dn=Parking.Wars.2015.s01e03.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1443936324,"description":"Parking.Wars.2015.s01e03.EN.SUB.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 896x504\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]3 of 3[/b]\r\n\r\nLast year eight million parking tickets were issued in the UK, an average of 1,200 every hour, or one every four seconds. With councils making 350 million pounds from parking fines alone, parking is big business in Britain and very contentious.\r\n\r\nIn Bristol, Darth Vader is spotted confusing the council, and Hereford's civil enforcement officers witness unpleasant behaviour.\r\n\r\n[img]http://extraimago.com/images/2015/10/01/a2dbf4f0f33f0287bb6d1a2679f0c144.jpg[/img]\r\n\r\nBattles over parking occur every day on our streets – in this series we meet the warriors on both sides of the yellow lines.\r\n \r\nWe join Civil Enforcement Officers patrolling the small city of Hereford and witness some rather unexpected behaviour. For one officer after an unpleasant encounter, her perpetrator is taken to court. We see the incident and its outcome.     \r\n \r\nDown the road in Bristol, it’s the world of ballet that gets caught up in the latest installation of controlled parking zones sweeping the city. We hear from 97-year-old ballet school owner Angela Redgrave whilst in other parts of the town, Darth Vader is seen using his force to confuse the council trying to prevent the necessary new signage to be installed. \r\n \r\nIn Derby, car-less Mrs Gilby has devoted her life to keeping the residents’ car park of her flats clear of unwanted visitors.\r\n \r\nThe thirty experienced lawyers who work at the Traffic Penalty Tribunal have seen and heard a wide array of people and their parking problems. Ranging from unreasonableness, to stupidity, to the Aliens – the cases are an insight into how passionate we all our about our rights when it comes to parking","torrent":{"xt":"urn:btih:de96f042930d9c164ad3b93757ca24c6a804785a","amp;dn":"Parking.Wars.2015.s01e03.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de96f042930d9c164ad3b93757ca24c6a804785a","infoHashBuffer":{"type":"Buffer","data":[222,150,240,66,147,13,156,22,74,211,185,55,87,202,36,198,168,4,120,90]},"announce":[],"urlList":[]}}