{"title":"Extra Golden - Ok-Oyot System (2006) [EAC-FLAC]","uid":12577271,"size":323735744,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e2412d3c3c1a4bd26bf1660bb479a11aaf3656a4&amp;dn=Extra+Golden+-+Ok-Oyot+System+%282006%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pucholoco","files":19,"time":1444914151,"description":"Extra Golden - Ok-Oyot System (2006) \r\n            EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 296 Mb\r\n                   Full Artwork @ 300 dpi (jpg) -&gt; 27 Mb\r\n\r\n\r\nOk-Oyot System is a wonderful collaboration between Americans Ian Eagleson and Alex Minoff of Golden and Kenyans Otieno Jagwasi and Onyango Wuod Omari of Orchestra Extra Solar Africa. \r\n\r\nThe sessions grew out of Eagleson's doctoral work on the Benga music of Kenya and Nairobi, but this isn't really an attempt at playing true Benga music. There's certainly an African feel throughout the album, but you can hear that everyone brought a little bit to the table. &quot;Ilando Gima Onge&quot; and &quot;Nyajondere&quot; (the only track written without Eagleson and Minoff) are the closest to straight-up Afro-pop, but even &quot;It's Not Easy,&quot; which has more of a rock sound, and &quot;Tussin and Fightin'&quot; (both recorded without Jagwasi and Omari) have vaguely African guitar.\r\n\r\nIn fact, those were songs Minoff and Eagleson had been working on prior to working with Jagwasi and Omari, but they found a way to transform the songs into more of an African sound for this project. Other pieces were equally collaborative, like &quot;Ok-Oyot System&quot; which mixes both Kenyan and English to great effect and features some wonderful guitar tones. &quot;Ok-Oyot&quot; translates to &quot;It's not easy,&quot; and the songs all touch on various difficult aspects of living a life. \r\n\r\nHowever, the music itself retains the lightness and a certain joy common to so much African music. Like some of the finest vintage highlife recordings, there's a rawness to these performances that adds that extra kick, and the players come up with some fantastic guitar sounds while they dance around each other and the groove (and check out the hi hat work on &quot;Osama Rach&quot;). \r\n\r\nWith no song under five minutes, there's ample time for guitar interplay but the songs never overstay their welcome. It's too bad more cross-cultural collaborations don't come off as naturally as this. Unfortunately, the passing of Otieno Jagwasi in May of 2005 probably put an end to Extra Golden, but Ok-Oyot System is an excellent album that will serve as a tribute to his memory.\r\n\r\n\r\n--------------------------------------------------------------------------------\r\nTracklist:\r\n--------------------------------------------------------------------------------\r\n\r\n01 - Ilando Gima Onge\r\n02 - It's Not Easy\r\n03 - Ok-Oyot System\r\n04 - Osama Rach\r\n05 - Tussin And Fightin'\r\n06 - Nyajondere\r\n\r\n\r\n*2006 Thrill Jockey | THRILL 153\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:e2412d3c3c1a4bd26bf1660bb479a11aaf3656a4","amp;dn":"Extra+Golden+-+Ok-Oyot+System+%282006%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2412d3c3c1a4bd26bf1660bb479a11aaf3656a4","infoHashBuffer":{"type":"Buffer","data":[226,65,45,60,60,26,75,210,107,241,102,11,180,121,161,26,175,54,86,164]},"announce":[],"urlList":[]}}