{"title":"Lisa Chaplin - De getijdewachters. NL Ebook. DMT","uid":12589572,"size":1714480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e245b70cc52f7b3485245864506c53a5a4ccb218&amp;dn=Lisa+Chaplin+-+De+getijdewachters.+NL+Ebook.+DMT+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mc3dom","files":4,"time":1445079402,"description":"Lisa Chaplin - De getijdewachters. NL Ebook. DMT \r\n\r\nAfbeelding\r\n\r\nAuteur: Lisa Chaplin \r\nPagina's: 492\r\nTaal: Dutch/Nederlands\r\nUitgever: Karakter B.V\r\nJaar van uitgifte: 2015\r\nGenre: Roman\r\n\r\nSamenvatting\r\n\r\nEen meeslepende roman, die op waarheid is gebaseerd, over het fascinerende verhaal van een jonge vrouw die haar leven op het \r\nspel moet zetten als spionne om Napoleons invasie van Groot-Brittannië tegen te houden in de winter van 1803. Lisbeth verloochent \r\nhaar adellijke familie, haar geboorteland Engeland en haar erfrecht om te trouwen met de liefde van haar leven. Als ze de oversteek \r\nnaar Frankrijk eenmaal gemaakt heeft, komt ze erachter dat haar Fransman zeer gewelddadig is en meer interesse heeft in de politieke \r\ngeheimen van haar vader dan in haar. Ze ontmoet Duncan, bekend als de leider van de Getijdewachters, een doorgewinterde spion die \r\nLisbeths vader heeft beloofd op haar te letten terwijl hij de Franse kustregio afzoekt naar bewijs dat Napoleon een vloot aan het bouwen \r\nis om Groot-Brittannië aan te vallen. De excentrieke Amerikaanse uitvinder Robert Fulton maakt een verbeterde versie van ‘de schildpad’ – \r\nde eerste echte onderzeeboot – en creëert een nieuw type wapen dat hij aan de Franse marine wil verkopen. Maar als zijn warme relatie \r\nmet Napoleon bekoelt en de deal afketst, accepteert hij bescherming en een helpende hand van de Getijdewachters om zich aan de Franse \r\nkant van het Kanaal te vestigen. Hij weigert hun echter inzage in zijn geheime vinding. Terwijl het Franse leger zich verschanst en alle \r\ntoegangswegen naar het kustplaatsje afsluit, moeten de Getijdewachters hun handen zien te leggen op de onderzeeboot en op iemand \r\ndie hem kan bedienen om zo Napoleons geheime wapen te ontwrichten. En hierbij krijgt Lisbeth de kans haar vaderland te dienen.\r\n\r\nMet dank aan de originele poster !! \r\n\r\nDeze review wordt u aangeboden door\r\n\r\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:e245b70cc52f7b3485245864506c53a5a4ccb218","amp;dn":"Lisa+Chaplin+-+De+getijdewachters.+NL+Ebook.+DMT+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e245b70cc52f7b3485245864506c53a5a4ccb218","infoHashBuffer":{"type":"Buffer","data":[226,69,183,12,197,47,123,52,133,36,88,100,80,108,83,165,164,204,178,24]},"announce":[],"urlList":[]}}