{"title":"Spill - Stockholm Syndrome (2012)","uid":12583689,"size":253794810,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e3418dcb7b3eb464970275427db5caea99871cb7&amp;dn=Spill+-+Stockholm+Syndrome+%282012%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mariorg","files":11,"time":1444989189,"description":"Al Maslakh Records: MSLKH 13 \nhttp://www.almaslakh.org/catalog_mslkh13.php\r\n\r\n* Magda Mayas: piano\r\n* Tony Buck: drums\r\n \nhttp://www.magdamayas.jimdo.com/ \nhttp://www.tony-buck.com/ \nhttp://www.thenecks.com/\r\n\r\nTrack 1 recorded live by Teemu Korpipää at Kiasma Theatre, Helsinki, on the\r\n        12th of November 2010 during the Äänen Lumo Festival For New Sounds.\r\nTrack 2 recorded live at Nasjonal Jazz Scene, Oslo, on the\r\n        20th of October 2010.\r\n\r\n\r\nReviews\r\n~~~~~~~\r\n\r\nBy Adam Strohm \nhttp://www.dustedmagazine.com/reviews/7124\r\n\r\n[...]\r\n\r\nThe two 2010 performances that make up Stockholm Syndrome are similar in\r\ncharacter. Both tracks feature Mayas and Buck largely eschewing the\r\nconventional sound of their instruments, playing a scattered, kitchen-sink\r\nvariety of improvisation. Mayas pays little attention to the black and white\r\nkeys of her instrument; instead, she plays its innards, creating shiny\r\ncrescendos with scrapes of its wires and plucking prepared strings, or even,\r\nfrom the sound of it, letting loose objects rattle about in the instrument’s\r\nbody. Buck’s credited as playing drums, but it’s rare for long stretches that\r\none hears an easily identifiable drum. Buck’s arsenal focuses more on bells,\r\ncymbals, and other tools of clank and clatter. It’s at Stockholm Syndrome‘s\r\nmost chaotic moments that the drums and piano sound most like themselves, but\r\neven then, there’s something amiss in the ruckus, an off-kilter quality to the\r\nmusic’s boil. Even at full tilt, the album moves with an erratic gait.\r\n\r\nThe music comes on like an intermittent rain, the sort of spring shower that\r\ncan go from a sprinkle to a deluge and back again in the span of a few minutes,\r\nits fluctuations in intensity occurring quickly, and without warning. Stockholm\r\nSyndrome has little magnetism; it’s an album that requires a concerted ear, and\r\nis inconsistent in its rewards. At times, the individual sounds that Buck and\r\nMayas are making are more interesting than the whole they create in tandem, and\r\nthe music can move so quickly that its best moments are quickly dashed against\r\nthe rocks while Mayas and Buck move on to something new. Like a debate waged in\r\nmade-up languages, improv of this sort can be frustratingly difficult to pin\r\ndown, but that can be part of the appeal.\r\n\r\n--\r\n\r\nBy Richard Pinnell \nhttp://www.thewatchfulear.com/?p=7056\r\n\r\nBy Thomas Millroth \nhttp://www.soundofmusic.nu/recension/magda-mayas-tony-buck-spill-stockholm-syndrome\r\n\r\nPar Guillaume Belhomme (fr)","torrent":{"xt":"urn:btih:e3418dcb7b3eb464970275427db5caea99871cb7","amp;dn":"Spill+-+Stockholm+Syndrome+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3418dcb7b3eb464970275427db5caea99871cb7","infoHashBuffer":{"type":"Buffer","data":[227,65,141,203,123,62,180,100,151,2,117,66,125,181,202,234,153,135,28,183]},"announce":[],"urlList":[]}}