{"title":"Hackers","uid":5292546,"size":4400793600,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e3f31be6ecc26ea4096615fde8672c2959bcd15f&amp;dn=Hackers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dante.Xaiver","files":-1,"time":1263942754,"description":"Untouched DVD5\nNTSC\nDolby English 5.1\nDolby French Stereo\nEnglish French Spanish Subtitles\n16x9 Widescreen\n\nIn 1988, Seattle youth Dade &quot;Zero-Cool&quot; Murphy (Jonny Lee Miller) is arrested and charged, at the age of 11, with crashing 1,507 \n\nsystems in one day and causing a single-day 7-point drop in the New York Stock Exchange. Upon conviction, he is banned from owning \n\nor operating computers or touch-tone telephones until his 18th birthday.\n\nShortly before Dade turns 18, his mother (now divorced) takes a new job in New York City. Upon turning 18, Dade calls a local \n\ntelevision station, dupes the security guard into giving him the modem's phone number (using a tactic known as social engineering) \n\nand successfully hacks into the station's computer network, changing the current tv program to an episode of The Outer Limits. \n\nHowever, Dade is &quot;attacked&quot; by a hacker on the same network, (who goes by the handle &quot;Acid Burn&quot;) and is eventually kicked off. \n\nDuring the conversation, Dade identifies himself by the new alias, Crash Override.\n\nDade enrolls in the prestigious Stuyvesant High School, where he meets the beautiful Kate Libby (Angelina Jolie), who is \n\nresponsible for taking him on a tour of the school. After being told of a &quot;pool on the roof&quot; (which results in Dade and several \n\nother students being locked on the roof during a rainstorm) a feud erupts between Dade and Kate. Their eventual hacking duel, \n\nwhich spans most of the movie, is judged by Kate and Dade's mutual friends in the hacking community, The Phantom Phreak, Cereal \n\nKiller and Lord Nikon.\n\nThe real trouble erupts when Joey Pardella (Jesse Bradford), the younger, novice hacker of the group, successfully breaks into an \n\noil company supercomputer to prove to the rest of the group that he is an elite hacker. In order to validate this feat, he \n\ndownloads part of a garbage file. Unfortunately, the company's IT staff detects this unauthorized entry into their systems and \n\nsummons computer security officer Eugene &quot;The Plague&quot; Belford (Fisher Stevens) to deal with the problem. He realizes that the file \n\nthat is being downloaded can prove that The Plague is stealing money from the company via salami slicing. The Plague enlists the \n\nUS Secret Service to recover the file by claiming that it is the code to a computer virus that will capsize the company's oil \n\ntanker fleet.\n\nWhat follows is a frantic race against The Plague and the Secret Service to exonerate the hackers before Belford can unleash the \n\nvirus causing a worldwide ecological disaster.\t\t","torrent":{"xt":"urn:btih:e3f31be6ecc26ea4096615fde8672c2959bcd15f","amp;dn":"Hackers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3f31be6ecc26ea4096615fde8672c2959bcd15f","infoHashBuffer":{"type":"Buffer","data":[227,243,27,230,236,194,110,164,9,102,21,253,232,103,44,41,89,188,209,95]},"announce":[],"urlList":[]}}