{"title":"Railworks TS2016 DTG NJT ALP-46 Loco Add-On","uid":12587002,"size":114756219,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e4285018bac20a158e1428288b3aea2de612421a&amp;dn=Railworks+TS2016+DTG+NJT+ALP-46+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TS2015","files":1,"time":1445037539,"description":"With a 1,000-mile route system, much of which is electrified with overhead A.C. catenary, commuter carrier NJ Transit is one of North America’s primary employers of electric locomotives. Seeking a new fleet of state-of-the art electrics, NJ Transit contracted with Adtranz (now part of Bombardier) in Kassel, Germany to construct 29 electric locomotives designed based on the Deutsche-Bahn Class-101 electric. Classified as ALP-46s on NJ Transit, the electrics (NJT 4600-4628) began arriving in 2001 and each packed 7,100-horsepower into a stylish 64-foot-long, dual-cab carbody. Riding Flexifloat trucks in a B-B wheel arrangement and with a drive system that incorporates a transformer, two traction converters, and MITRAC electronic control systems, the ALP-46s comfortably handle 10-car NJT consists at 100 mph. \r\n\r\nWearing NJT’s striking livery designed by Cesar Vergara, the ALP-46s regularly serve on multiple NJ Transit routes, including the Amtrak-owned Northeast Corridor between New York Penn Station and Trenton, New Jersey; the North Jersey Coast Line; and NJT’s Morristown Line. Efficient and powerful, the ALP-46 is a superb and authentic locomotive for service on Train Simulator’s NJCL route. \r\n\r\nThe ALP-46 includes a range of advanced features including NJT’s in-cab signal system and is accompanied by NJT’s Comet IV commuter coach and a drivable Comet V cab-car for push-pull operations. It also features three career scenario for the North Jersey Coast Line route. \r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT OF TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:e4285018bac20a158e1428288b3aea2de612421a","amp;dn":"Railworks+TS2016+DTG+NJT+ALP-46+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4285018bac20a158e1428288b3aea2de612421a","infoHashBuffer":{"type":"Buffer","data":[228,40,80,24,186,194,10,21,142,20,40,40,139,58,234,45,230,18,66,26]},"announce":[],"urlList":[]}}