{"title":"Virtua Squad 2 PC","uid":5285694,"size":546319354,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e51f4cbd04de9524c2b790eb150f1e828c54e932&amp;dn=Virtua+Squad+2+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ngp2789","files":3,"time":1263711744,"description":"Released in 1995 to arcades everywhere, Virtua Cop 2 eventually was ported over to the PC in 1997 under the name Virtua Squad 2. Continuing from where the first game left off, Virtua Squad 2 has players controlling members of the Virtua City Police Department once again as they go fight crime in Virtua City.\n\nAfter the defeat of EVL Inc. at the end of the first game, Virtua City was at peace and all of EVL Inc.'s members were either dead or locked away in prison. One year later, however, mysterious criminal activity starts popping up all over Virtua City; including an attempted robbery of one of Virtua City's biggest jewelry stores. Looks like EVL Inc. is being reborn again!\n\n==============\nINSTALL NOTES\n==============\n\nWhen I installed this on my Windows XP laptop, it installed perfectly without any compatibility mode needed. If it does not work for you the first time, try setting both the installer on the CD and the game shortcut to &quot;Windows 98/ME&quot; compatibility mode. On Windows Vista and Windows 7, don't forget to run the installer and game with administrative rights if it does not work properly for you the first time!\n\nEnjoy the release of Virtua Squad 2!\n\nNGP2789","torrent":{"xt":"urn:btih:e51f4cbd04de9524c2b790eb150f1e828c54e932","amp;dn":"Virtua+Squad+2+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e51f4cbd04de9524c2b790eb150f1e828c54e932","infoHashBuffer":{"type":"Buffer","data":[229,31,76,189,4,222,149,36,194,183,144,235,21,15,30,130,140,84,233,50]},"announce":[],"urlList":[]}}