{"title":"Audio Bible - King James Version - Alexander Scourby","uid":12587266,"size":648036817,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e7ef43f9de72cf583b7aacfea41438d10419c5d0&amp;dn=+Audio+Bible+-+King+James+Version+-+Alexander+Scourby++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sharaudio","files":1194,"time":1445043288,"description":"Audio Bible - King James Version - Alexander Scourby  \r\n\r\n&quot;Alexandra Scourby has the Greatest Voice Ever Recorded and is the Worlds Best Audio-Book Narrator.&quot; Chicago Tribune\r\n\r\nNovember 13 1913 - February 22 1985\r\n\r\nAlexandra Scourby PortraitThe precise, mellifluous voice of Alexander Scourby, trained in Shakespearean roles in the 1930's and perfected in radio dramatic parts in the 1940's, became a well-known sound on Broadway, in motion pictures, and on television, where as Harriet Van Horne has observed, he is &quot;the most sensitive and knowing narrator in the business.&quot; His most appreciative audience, however, is found among the nearly 80,000 borrowers of Talking Books, the recordings of literature produced under the supervision of the Division for the Blind of the Library of Congress for the use of the legally blind. Scourby, during his lifetime recorded over 500 books for the blind and has described his recording of Audio books as, &quot;the one work that really means something to me. &quot;Nelson Coon, a former regional librarian in the Library of Congress observed in the letters column of the Saturday Review (September 9, 1961): &quot;The dependence on and satisfaction in the Voice of Alexander Scourby among the blind is something you would not believe unless you had been a librarian.&quot; However, the Audio Book that Alexander Scourby was most proud of was his narration of the Holy Bible. Millions of records, cassettes, CD's, DVD's and now digital downloads have been sold. The bestselling book has become one of the best selling audio narration of all times and to this very day is still recognized as the very best narrator of the Bible. Since the first recording of the Bible in 1953, his gifted voice has brought, and continues to bring, comfort, joy and inspiration to untold millions all over the world and that has earned him the well deserved title as &quot;The Voice of the Bible&quot;. Although Scourby recorded over 500 different books, he considered the Bible to be his most important. He describes why in the following statement:\r\n\r\n&quot;The Bible is the one book that I am most proud of. It has the power to inspire, encourage and change the lives of people who hear it. I know this because over the years, many people have written me thanking me for recording the Bible. I have been greatly humbled and moved by the many letters I received from people around the world telling me how God used the Bible narrations to comfort and encourage them during a difficult period. Others stated their lives, or the lives of their loved ones, was changed simply by listening to the Bible. Others stated that they were even healed as they listened to the Bible. I really stand in awe in pondering that nothing else I have done during my entire life time has had such a powerful and positive impact on people as my recordings of the Bible. I offer you the most rewarding gift you will ever have an opportunity to give someone you love ... the recording of THE KING JAMES BIBLE ...the world's most important book and a gift of a lifetime for anyone who receives it.&quot;\r\n\r\nIt’s very seldom that someone can continue to touch the lives of millions every day well after their death, but Alexander Scourby has done exactly that since his death in February of 1985, as his one of a kind voice continues to reach out and touch the lives of millions through his narrations of the King James Bible.\r\n\r\n\r\nAudio Bible sites\r\n \nhttps://www.worldslastchance.com/the-kjv-audio-bible.html\r\n\r\n \nhttp://mp3.bibleforums.org/kjv/?C=S;O=D\r\n\r\n \nhttp://server.firefighters.org/kjv.asp","torrent":{"xt":"urn:btih:e7ef43f9de72cf583b7aacfea41438d10419c5d0","amp;dn":"+Audio+Bible+-+King+James+Version+-+Alexander+Scourby++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7ef43f9de72cf583b7aacfea41438d10419c5d0","infoHashBuffer":{"type":"Buffer","data":[231,239,67,249,222,114,207,88,59,122,172,254,164,20,56,209,4,25,197,208]},"announce":[],"urlList":[]}}