{"title":"Chemistry And Technology Of Thermosetting Polymers In Constructi","uid":12404101,"size":11348799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e827f33b77011f67a24c0417cb5053a7b4f056b9&amp;dn=Chemistry+And+Technology+Of+Thermosetting+Polymers+In+Constructi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1442067871,"description":"Chemistry And Technology Of Thermosetting Polymers In Construction Applications (Kluwer Academic, 1998).pdf\n\nPolymeric products are used widely in the construction industry, because they offer a range of desirable performance properties not available from traditional materials. Development of these products continues in a number of major research and development programmes within the construction materials sector, aimed at improving the performance, durability and applicational properties of these materials. It seems certain that their use will increase as their overall performance is developed and as the industry becomes more familiar with the techniques required to apply these materials and the benefits they offer. The purpose of this book is to familiarise the reader with the range of thermosetting polymeric materials available for construction applications, and to provide sound information on the properties and applications of these important materials. Professional engineers involved in the specification, application and testing of these materials will find this book a compact, authoritative and comprehensive source of information on these materials. Chemists and technologists involved in developing new or improved formulations will find in this book much to inform their work, particularly in the important area of applicational properties","torrent":{"xt":"urn:btih:e827f33b77011f67a24c0417cb5053a7b4f056b9","amp;dn":"Chemistry+And+Technology+Of+Thermosetting+Polymers+In+Constructi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e827f33b77011f67a24c0417cb5053a7b4f056b9","infoHashBuffer":{"type":"Buffer","data":[232,39,243,59,119,1,31,103,162,76,4,23,203,80,83,167,180,240,86,185]},"announce":[],"urlList":[]}}