{"title":"Mountain Men Season 1","uid":12336859,"size":3568921924,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ea0533946641a4cb23d13e2a3992c849df04a67c&amp;dn=Mountain+Men+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ArchiveJ","files":8,"time":1441248823,"description":"Eustace Conway resides on a parcel of land in the Blue Ridge Mountains of North Carolina that he calls Turtle Island. There, he hosts people to whom he teaches basic wilderness survival skills. Additionally, he works using ancient techniques to harvest firewood to earn an income. Threatened by a lien against his land, Conway fights to maintain ownership.[4]\n\nMarty Meierotto resides in the small Alaskan town of Two Rivers with his wife Dominique and daughter Noah. Once a month Marty flies his Piper PA-18A-150 Super Cub aircraft with tundra tires to his cabin on the Black River in the Alaska North Slope. While there, he uses a snowmobile to tend to his animal traps that he uses to collect furs.\n\nTom Oar, a former rodeo cowboy, resides near the Yaak River in northwestern Montana with his wife Nancy and their dog Ellie. Facing a seven-month winter season, the pair work hard, with the help of their neighbors, to prepare.[5]\n\nRich Lewis, a mountain lion hunter, resides in Montana's Ruby Valley with his wife Diane. He pursues his passion for tracking mountain lions there with the help of a team of hounds.[6]\n\nGeorge Michaud, a fur trapper, camps along the Snake River and Teton Range in Idaho.[7]\n\nCharlie Tucker, a fur trapper, resides in Maine's Great North Woods.[8]\n\nKyle Bell, a hunter and outfitter by trade, runs his hunts over 45,000 acres of rugged landscape and resides in New Mexico's Cimarron Valley with his ten-year-old son, Ben.[9]\n\nMorgan Beasley resides in the Alaska Range","torrent":{"xt":"urn:btih:ea0533946641a4cb23d13e2a3992c849df04a67c","amp;dn":"Mountain+Men+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea0533946641a4cb23d13e2a3992c849df04a67c","infoHashBuffer":{"type":"Buffer","data":[234,5,51,148,102,65,164,203,35,209,62,42,57,146,200,73,223,4,166,124]},"announce":[],"urlList":[]}}