{"title":"SpongeBob SquarePants The Complete Series [HD Definitive Edition","uid":12352188,"size":55407276314,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eb86299fe20a3051fdc53246e625800072060600&amp;dn=SpongeBob+SquarePants+The+Complete+Series+%5BHD+Definitive+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roflcopter2110","files":396,"time":1441440260,"description":"So...if you are reading this - no doubt you want your Nostalgia back. You want it back in high quality. \n\n\nWhat was your SOLE INSPIRATION for this set?\n\n--- My inspiration? My beautiful wife Heatherlee - she inspired me to buy all the DVD sets to get her one of our all-time favorite show in High Definition. \n\nI decided to give back to the wonderful online community in her honor.\n\nThe community of online peer sharing has given so much to me, opened so many doors not possible - and I wanted to keep giving back. This is not my first share on here (even though it is with a different username which I lost the password to). \n\n\nWhat ELSE Inspired You to make the BEST SpongeBob SquarePants Collection on the Internet Thus Far?\n\n\n-- Simple....other people's Incompetence.... \n\nThe sheer amount of stupidity with people in trying to collect a decent SpongeBob torrent that was A. In High DVD Quality and B. Organized with XBMC listing (TheTVDB.com) which would provide plot summaries per episode amounted to nothing but them showing their utter failure as uploaders. The torrents were low 300x288 quality squares...mostly pixelated - not DVD quality at all. Insulting mostly to a great cartoon (minus Season 7 in my experience somewhat). The lack of seeders...the lack of proper organization and decency of HIGH QUALITY files was appalling.\n\n\nNEWSFLASH: When it's already a 480p cartoon, don't make it 288 interlaced (utter failure).\n\n\nMORE INFORMATION ABOUT THIS TORRENT:\n\n- SEASON 7 was not my rip. Sorry. That season is awful and I refused to buy it on DVD. Instead I found a very decent DVD Rip of it from back in the day. It's good despite slight pixelation of characters around their border ...a bit of oversharpness if you ask me. Either way it's fine.\n\n- Season 8 (this was done according to XBMC/TheTVDB listing.). The REAL canon SEASON 8 is labeled SEASON 9 in this torrent\n\n- Season 10 is actually SEASON 9 (most episodes are FULL HD episodes from either a direct Web Download and 2 HULU rips). As for the &quot;HULU Rips&quot; - I ripped them myself and can attest their quality is EXACT to the {spam link removed}...minus perhaps the TINIEST unnoticeable amount of detail.\n\n- Two of the hulu rips are in 1440p/23.937 (sorry but I refused to down-encode it to 720p for loss of quality...especially considering Windows Media Capture Codec is picky when down-sizing to 720p [two of the hulu rips]. This and I was too lazy to make my resolution 720p on my monitor. Either way the file difference is probably ~150MB at best per file more in comparison so it's not a space issue).\n\n\n- MOST OF THE SHORTS ARE INCLUDED in a separate folder - all in very high quality (minus 2 or so)\n\n\nYou're all VERY welcome. ;)","torrent":{"xt":"urn:btih:eb86299fe20a3051fdc53246e625800072060600","amp;dn":"SpongeBob+SquarePants+The+Complete+Series+%5BHD+Definitive+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb86299fe20a3051fdc53246e625800072060600","infoHashBuffer":{"type":"Buffer","data":[235,134,41,159,226,10,48,81,253,197,50,70,230,37,128,0,114,6,6,0]},"announce":[],"urlList":[]}}