{"title":"Heckabomb v2.0.5","uid":12524020,"size":450393757,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ecf419c951c9cd5dc7313ed3be9803fad66e58f4&amp;dn=Heckabomb+v2.0.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Androider","files":2,"time":1443985164,"description":"Heckabomb is a twin-stick shooter with varied levels based in a circular arena and a host of upgradeable stats including bullet spread, rate of fire, turbo boosters and magnetic collectors. \r\n\r\nThere are six varied add-on weapons too, including a chain-lightning gun, bullet-reflecting satellites and a rapid-fire swirly thing! (a legal requirement of any arcade shooter) Loads of different of enemies, including huge boss warships, missile batteries, tractor beams and a deadly enemy ace pilot will challenge your arcade reflexes and endurance.\r\n\r\n • Twin-stick (controller or mouse+keys)\r\n • Visually intense, massive explosions, huge debris clouds, trails everywhere\r\n • Spectacular arcade soundtrack\r\n • Campaign mode, Survival Mode, Hardcore Mode, AI Duel Challenge\r\n • Online hiscores\r\n\r\nAs featured in SHIELD Hub. Play it on NVIDIA SHIELD.\r\n\r\nYour planet is dead\r\n\r\nThe Heckabomber is a doomsday weapon, the only thing that survived the destruction of your home planet by the alien armada. Loaded with devastating planet-destroying bombs, you'll fight across the Universe. Seek out enemy worlds to obliterate, crush their defenders, crack their planet and harvest the remains for construction materials to upgrade your ship and continue your rampage.\r\n\r\nAsteroids\r\n\r\nAsteroids exist throughout the Universe and are often the leftovers of planet formation. With Heckabombs detonating across the galaxy, asteroids are often the leftovers of planet destruction too! Mining them for resources allows you to build new weapons, upgrade equipment and resupply smartbombs.\r\n\r\nEvery second level you'll race to harvest asteroids before the blast wave reaches you from the planet you just blew up!\r\n\r\nPlanets\r\n\r\nAfter charging up on ship upgrades, you'll take on aggressive enemy ships, crash through their defensive lines and try to get close enough to their planet to drop a single, devastating Heckabomb onto it.\r\n\r\nEnemies come in various shapes and sizes from tiny fast-moving divebombers to massive lumbering tractor-beam transports that'll try to pin you down for other enemies to shoot.\r\n\r\nWarships\r\n\r\nEvery 10th level, you'll face increasingly huge enemy Warships. Each one carries a unique bonus upgrade that you can only get if you choose to engage the Warship rather than steer clear of it's deadly weapons and fighter launch bay.\r\n\r\nHardcore\r\n\r\nIn Hardcore mode you get no continues and enemy accuracy, rate of fire and bullet speed all increase substantially. One life only, extra challenging fights, vie for a place on the elite hiscore table.\r\n\r\nCasual\r\n\r\nCasual mode unlocks when you complete just one level of the main campaign. It offers a lot less challenge and a lot more salvage loot, making for a relaxing shoot-em-up ride up through the game as far as the first Warship encounter. Practice your moves in relative safety, or just watch the pretty explosions.\r\n\r\nSurvival\r\n\r\nUnlocking the bonus Survival Mode gives you a huge upgrade budget to customize your ship just once then hurls you into an endless battle against increasingly ferocious odds and a limitless armada of enemy Warships.\r\n\r\nDuel\r\n\r\nFace the elite enemy ace pilot in the campaign and you'll unlock the bonus Duel Mode where you can challenge the ace alone (with his 5 elite henchmen... hey, he is a bad guy!)\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.allicorn.heckabomb\r\n\r\n\r\nInstructions:\r\n\r\n1.Copy 'com.allicorn.heckabomb' folder to 'sdcard/Android/obb'\r\n2.Install APK\r\n3.Launch the game","torrent":{"xt":"urn:btih:ecf419c951c9cd5dc7313ed3be9803fad66e58f4","amp;dn":"Heckabomb+v2.0.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecf419c951c9cd5dc7313ed3be9803fad66e58f4","infoHashBuffer":{"type":"Buffer","data":[236,244,25,201,81,201,205,93,199,49,62,211,190,152,3,250,214,110,88,244]},"announce":[],"urlList":[]}}