{"title":"Things v1.2.9","uid":5298719,"size":9630359,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:edc7621c7b3df9ca6b144f2367e42a8d19ac8f0c&amp;dn=Things+v1.2.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Iso_Soul","files":2,"time":1264150055,"description":"Product Description:\nTask management has never been this easy.\n\nOrganize your tasks in an elegant and intuitive way. Things combines powerful features with simplicity through the use of tags and its intelligent filter bar. A Leopard style source list allows for quick and easy focusing. Together with a beautiful user interface, Things aims at the seemingly impossible: making task management both easy and fun.\n\nOur screencast is a great introduction. Learn from our users why Things is different either on i use this or Newsvine.\n\nThe big picture. A Leopard style source list lets you easily focus without ever switching view modes or wrapping your head around filter criteria.\nA magical tag bar automatically appears when needed and adapts to the currently displayed list. It lets you drill down even the longest list of To-Dos. Hierarchical tags? We got you covered!\nTeamwork. Things offers convenient collaboration features. Easily delegate tasks to members of your team. (This is work in progress.)\nNo columns! Whether it's multiple tags, dates or notes, To-Do items display their information on an as needed basis. No more space wasted by empty or irrelevant column cells!\nOut of your head, out of your way. A quick entry HUD lets you enter any idea the moment it hits you. Never let the thought of an unfinished business distract you again.\nThings even supports GTD, so if you're familiar and comfortable with GTD concepts, you'll feel right at home.\n\nWhat's New?\n--&gt; Fixed a regression related to the Today list sync conflict issue.\n--&gt; Fixed an issue where items completed between 12/27/2009 and 12/31/2009 were shown in the Logbook as completed in 2010.\n--&gt; Added support for emptying the Trash immediately. Hold down the option key while choosing the &quot;Empty Trash...&quot; menu command.\n--&gt; Fixed an issue where the title of a to-do could have multiple lines when entered via Quicksilver.\n--&gt; Additional fixes for the issue where Things sometimes started with an empty window and remained unresponsive for some time.\n--&gt; Fixed a bug that could result in missing search results when searching for tags that contain subtags.\n--&gt; Localization. Added missing translations for Tags window.\n--&gt; Localization. Japanese localization fixes.\n--&gt; Localization. French localization fixes.\n\nInstallation:\n--&gt; Open folder &amp; unzip file\n--&gt; Drag app to your applications folder\n--&gt; Use keygen to register program\n--&gt; Done!\n\nENJOY!!    \n--&gt; IsolatedSoul5591","torrent":{"xt":"urn:btih:edc7621c7b3df9ca6b144f2367e42a8d19ac8f0c","amp;dn":"Things+v1.2.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc7621c7b3df9ca6b144f2367e42a8d19ac8f0c","infoHashBuffer":{"type":"Buffer","data":[237,199,98,28,123,61,249,202,107,20,79,35,103,228,42,141,25,172,143,12]},"announce":[],"urlList":[]}}