{"title":"Minions (2015) HDRip XviD.mkv","uid":12511607,"size":702052665,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2ac6b7e69c7b821167347c9af0de6ad0a988d27&amp;dn=Minions+%282015%29+HDRip+XviD.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FiMee3ko","files":1,"time":1443567587,"description":"Minions (2015)\r\nPG  |  91 min  |  Animation, Comedy, Family  |  10 July 2015 (USA)\r\n6.6 Your rating:   -/10   Ratings: 6.6/10 from 74,727 users   Metascore: 56/100 \r\nReviews: 233 user | 261 critic | 35 from Metacritic.com\r\nMinions Stuart, Kevin and Bob are recruited by Scarlett Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.\r\n\r\nDirectors: Kyle Balda, Pierre Coffin\r\nWriter: Brian Lynch\r\nStars: Sandra Bullock, Jon Hamm, Michael Keaton\r\n\r\nUser Reviews\r\n\r\n \r\nOne in a Minion\r\n26 June 2015 | by coreyjdenford (England) – See all my reviews\r\nThis is my review of the lighthearted fun for all the family Minions (spoiler free). This film is set way before the time when the Minions meet Gru (Steve Carrell from Despicable me 1 &amp;2). With a comedic edge the film will probably keep you laughing for ages. There were moments when I was just crying with laughter. \r\n\r\nThe Minions (Piere Coffin, voice) are basically on a quest to find the perfect boss/master the minions in their silly yet hysterical ways try their hardest to keep a master for just longer than a week but it goes horribly wrong for them. The three main Minions (on the poster) are Kevin, Bob and Stuart set off on a journey to find their new master in 1968 (42 years BG, Before Gru) Kevin is the smartest Minion, Stuart is the most ambitious and finally Bob is the cutest and plus the one that is the most clumsy. \r\n\r\nMinions is a silly yet hilarious prequel to Despicable Me which as you all know is the story of Gru and the Minions. There are three reasons on why I that this film is a must see. \r\n\r\n1. Original plot and storyline: This film has an original which basically starts off with the Minions evolution and basically explains more about how the Minions came along in their own funny ways as told by narrator Geoffrey Rush.\r\n\r\n2. Dialogue: The dialogue is hilarious because it starts off with the Minion language but it isn't off putting it's funny and sometimes witty but there is human dialogue as well. Voices by Sandra Bullock, Steve Coogan, Michael Keaton etc. \r\n\r\n3. The Minion: The Minions are the main part of the story (obviously) but the Minions are witty and well probably the most hilarious characters in any animation.\r\n\r\nOverall this film was really enjoyable and really put a massive smile on my face and it filled the entire cinema with laughter. This is fun for all the family a must see hilarious animation that will put a smile on your face and will keep you laughing from start to finish. This film was especially good in 3D. 9/10 One in a Minion","torrent":{"xt":"urn:btih:f2ac6b7e69c7b821167347c9af0de6ad0a988d27","amp;dn":"Minions+%282015%29+HDRip+XviD.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2ac6b7e69c7b821167347c9af0de6ad0a988d27","infoHashBuffer":{"type":"Buffer","data":[242,172,107,126,105,199,184,33,22,115,71,201,175,13,230,173,10,152,141,39]},"announce":[],"urlList":[]}}