{"title":"law abiding citizen 720p 5.1 audio.mp4","uid":5297739,"size":3839781096,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f314d15dad47685afa3bedf67f39322c284643d8&amp;dn=law+abiding+citizen+720p+5.1+audio.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fuq3dyamomz","files":1,"time":1264114304,"description":"this is  my first torrent so anything helpful would greatly appreciated. this is law abiding citizen in mp4 format 720p 5.1 audio. it is meant to be played on the ps3 but will work with anything that plays mp4 vids. i would have used a different format but when i was converting it, it would have been bigger than 4gb and anythingover 4 is worthless when working with fat32 so enjoy hopefully everything is fine \n\n\nClyde Shelton is an upstanding family man whose wife and daughter are brutally murdered during a home invasion. When the killers are caught, Nick Rice, a hotshot young Philadelphia prosecutor, is assigned to the case. Over his objections, Nick is forced by his boss to offer one of the suspects a light sentence in exchange for testifying against his accomplice. Fast forward ten years. The man who got away with murder is found dead and Clyde Shelton coolly admits his guilt. Then he issues a warning to Nick: Either fix the flawed justice system that failed his family, or key players in the trial will die. Soon Shelton follows through on his threats, orchestrating from his jail cell a string of spectacularly diabolical assassinations that can be neither predicted nor prevented. Philadelphia is gripped with fear as Shelton's high-profile targets are slain one after another and the authorities are powerless to halt his reign of terror. Only Nick can stop the killing, and to do so he must outwit this brilliant sociopath in a harrowing contest of wills in which even the smallest misstep means death. With his own family now in Shelton's crosshairs, Nick finds himself in a desperate race against time facing a deadly adversary who seems always to be one step ahead.\nProduction Status: \tReleased\nLogline: \tA district attorney finds himself at odds with a criminal mastermind that virtually controls a city from the confines of his prison cell.\nGenres: \tThriller\nRunning Time: \t2 hr. 2 min.\nRelease Date: \tOctober 16th, 2009 (wide)\nMPAA Rating: \tR for strong bloody brutal violence and torture, a scene of rape and pervasive language.\nDistributors: \t\nOverture Films\nProduction Co.: \t\nThe Film Department, Warp Film, Evil Twins\nFinanciers: \t\nThe Film Department\nU.S. Box Office: \t$73,106,880\nFilming Locations: \t\nDetroit, Michigan, USA\nPhiladelphia, Pennsylvania, USA\nProduced in: \tUnited States","torrent":{"xt":"urn:btih:f314d15dad47685afa3bedf67f39322c284643d8","amp;dn":"law+abiding+citizen+720p+5.1+audio.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f314d15dad47685afa3bedf67f39322c284643d8","infoHashBuffer":{"type":"Buffer","data":[243,20,209,93,173,71,104,90,250,59,237,246,127,57,50,44,40,70,67,216]},"announce":[],"urlList":[]}}