{"title":"Lawrence.Of.Arabia.1962.1080p.BluRay.x264.DTS-SARTRE","uid":12614705,"size":8992345274,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:f48890144d25e8d8594e393ffa7e77a4278f7b75&amp;dn=Lawrence.Of.Arabia.1962.1080p.BluRay.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sartre7","files":17,"time":1445502779,"description":"This sweeping, highly literate historical epic covers the Allies' mideastern campaign during World War I as seen through the eyes of the enigmatic T. E. Lawrence (Peter O'Toole, in the role that made him a star). After a prologue showing us Lawrence's ultimate fate, we flash back to Cairo in 1917. A bored general staffer, Lawrence talks his way into a transfer to Arabia. Once in the desert, he befriends Sherif Ali Ben El Kharish (Omar Sharif, making one of the most spectacular entrances in movie history) and draws up plans to aid the Arabs in their rebellion against the Turks. No one is ever able to discern Lawrence's motives in this matter: Prince Feisal (Alec Guinness) dismisses him as yet another &quot;desert-loving Englishman,&quot; and his British superiors assume that he's either arrogant or mad. Using a combination of diplomacy and bribery, Lawrence unites the rival Arab factions of Feisal and Auda Abu Tayi (Anthony Quinn). \r\n\r\nAfter successfully completing his mission, Lawrence becomes an unwitting pawn of the Allies, as represented by Gen. Allenby (Jack Hawkins) and Dryden (Claude Rains), who decide to keep using Lawrence to secure Arab cooperation against the Imperial Powers. While on a spying mission to Deraa, Lawrence is captured and tortured by a sadistic Turkish Bey (Jose Ferrer). In the heat of the next battle, a wild-eyed Lawrence screams &quot;No prisoners!&quot; and fights more ruthlessly than ever. \r\n\r\nScreenwriters Robert Bolt and Michael Wilson used T. E. Lawrence's own self-published memoir The Seven Pillars of Wisdom as their principal source, although some of the characters are composites, and many of the &quot;historical&quot; incidents are of unconfirmed origin. Two years in the making (you can see O'Toole's weight fluctuate from scene to scene), the movie, lensed in Spain and Jordan, ended up costing a then-staggering $13 million and won seven Academy Awards, including Best Picture and Best Director. \r\n\r\nThe 1962 Royal Premiere in London was virtually the last time that David Lean's director's cut was seen: 20 minutes were edited from the film's general release, and 15 more from the 1971 reissue. This abbreviated version was all that was available for public exhibition until a massive 1989 restoration, at 216 minutes that returned several of Lean's favorite scenes while removing others with which he had never been satisfied.\r\n\r\n\r\n\r\n\r\nSTARS.........: Peter O'Toole, Omar Sharif, Alec Guinness, Anthony Quinn\r\nDIRECTOR......: David Lean\r\nWRITERS.......: T.E. Lawrence (Writings), Robert Bolt (Screenplay)\r\nGENRE.........: Adventure | Biography | Drama\r\nRATING........: 8.4/10  152,703 votes\r\nMETASCORE.....: 100\r\nIMDB link.....: http://www.imdb.com/title/tt0056172\r\nRUNTIME.......: 3h 47mn\r\nSIZE..........: 8.34GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x876 (1080p)\r\nBITRATE.......: 4500 Kbps (3-Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: English DTS 5.1 768 kbps\r\nSOURCE........: Lawrence.Of.Arabia.1962.BluRay.1080p.DTS-HDMA.REMUX-FraMeSToR\r\nSUBTITLES.....: ARA, ENG, FRE, HIN, PER, POR-BRA, SPA \r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2014-11-14\r\n\r\n\r\n\r\n\r\n \nhttp://imagizer.imageshack.com/img538/6903/vDesZk.jpg  \nhttp://imagizer.imageshack.com/img673/4619/AUJH5u.jpg  \nhttp://imagizer.imageshack.com/img540/7645/pb7nGz.jpg  \nhttp://imagizer.imageshack.com/img909/4264/ETG3SZ.jpg  \nhttp://imagizer.imageshack.com/img673/9620/1R59wa.jpg","torrent":{"xt":"urn:btih:f48890144d25e8d8594e393ffa7e77a4278f7b75","amp;dn":"Lawrence.Of.Arabia.1962.1080p.BluRay.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f48890144d25e8d8594e393ffa7e77a4278f7b75","infoHashBuffer":{"type":"Buffer","data":[244,136,144,20,77,37,232,216,89,78,57,63,250,126,119,164,39,143,123,117]},"announce":[],"urlList":[]}}