{"title":"Beautiful Filipino girl gets a surprise creampie without warning","uid":12329861,"size":511003325,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f8110b6c85deac2460d58f5b4d5812bfb71b3b13&amp;dn=Beautiful+Filipino+girl+gets+a+surprise+creampie+without+warning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TKTh3K1ng","files":1,"time":1441168096,"description":"Screenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/8kQ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/8kQ&lt;/a&gt;\n\n\nAnother episode from teenfilipina in which we have this gorgeous woman from Philippines getting a very early creampie she did not want rather expect. She's simply outstanding, perfect body *almost* with a nice pair of boobs that you'd want to bury your face in all day. Her name is Chelle and she strips from top to bottom, oils up her self and waits for the blowjob session. The unfortunate part of this video is that the man has a very tiny fucking cock which I assume no woman would want to suck or fuck. \n\nAfter she finishes blowing him the sex begins with her on top of him riding his cock so good. Within a matter of approximately 25 seconds from that time, the guy ejaculates a thick load of cum right inside her without warning. She gets a feeling somethings up and immediately stops and looks down to see if he had cum already. She sees the cum oozing down on the mans dick and he tries to convince her that he did not creampie her. This silly Filipino girl tries to continue and the next thing you know she sees a protein shot drip out of her snatch and couldn't believe it LOL :laugh: !. Chelle ended up interrupting the shoot cleaning her snatch with a towel. Later on she gets fucked doggie style with a cumshot right on her ass. Enjoy !\n\nP.S I'd really like to know what they were talking about after she realized he came in her","torrent":{"xt":"urn:btih:f8110b6c85deac2460d58f5b4d5812bfb71b3b13","amp;dn":"Beautiful+Filipino+girl+gets+a+surprise+creampie+without+warning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8110b6c85deac2460d58f5b4d5812bfb71b3b13","infoHashBuffer":{"type":"Buffer","data":[248,17,11,108,133,222,172,36,96,213,143,91,77,88,18,191,183,27,59,19]},"announce":[],"urlList":[]}}