{"title":"Cooking for Crowds: 40th Anniversary Edition","uid":12589714,"size":5134189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9094c938bf1d6df63b950279c6f84b174d1a40b&amp;dn=Cooking+for+Crowds%3A+40th+Anniversary+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mdusanjay","files":1,"time":1445081785,"description":"Cooking for Crowds: 40th Anniversary Edition by Merry E. White\r\n\r\nOverview: When Cooking for Crowds was first published in 1974, home cooks in America were just waking up to the great foods the rest of the world was eating, from pesto and curries to Ukrainian pork and baklava. Now Merry White's indispensable classic is back in print for a new generation of readers to savor, and her international recipes are as crowd-pleasing as ever--whether you are hosting a large party numbering in the dozens, or a more intimate gathering of family and friends.\r\n\r\nIn this delightful cookbook, White shares all the ingenious tricks she learned as a young Harvard graduate student earning her way through school as a caterer to European scholars, heads of state, and cosmopolitans like Jacqueline Kennedy Onassis. With the help of her friend Julia Child, the cook just down the block in Cambridge, White surmounted unforeseen obstacles and epic-sized crises in the kitchen, along the way developing the surefire strategies described here. All of these recipes can be prepared in your kitchen using ordinary pots, pans, and utensils. For each tantalizing recipe, White gives portions for serving groups of six, twelve, twenty, and fifty","torrent":{"xt":"urn:btih:f9094c938bf1d6df63b950279c6f84b174d1a40b","amp;dn":"Cooking+for+Crowds%3A+40th+Anniversary+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9094c938bf1d6df63b950279c6f84b174d1a40b","infoHashBuffer":{"type":"Buffer","data":[249,9,76,147,139,241,214,223,99,185,80,39,156,111,132,177,116,209,164,11]},"announce":[],"urlList":[]}}