{"title":"Corbin Fisher - - - Kyle Gets Fucked ((MictrmbL))","uid":5289856,"size":213669995,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:f9e4a1018b9939b4db4b1a709fba41abd90d9c9e&amp;dn=Corbin+Fisher+-+-+-+Kyle+Gets+Fucked+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mictrmbl","files":2,"time":1263862532,"description":"From the vaults of Corbin Fisher:\n\n\nI have a bit of a confession to make. Whenever I first film a guy that has a stunning body, I almost immediately picture them bottoming. An image of them having another one of our guys give it to them in the ass is one of the first things that pops in to my head when we sign up a new model that has a great build. Does that make me bad? :)\n\nSo as you can imagine, it wasn't long after I first met Kyle that the wheels started turning in my head and I found myself picturing just what it'd look like seeing those rippling muscles flex and contract and move while he was getting drilled from behind. This young man's physique is certainly one of the most impressive ones on the site, and though it might seem a bit selfish, him taking it up the butt right in front of me was something I set to work on having happen right from the get to. Aren't you glad I bring a camera along with me for these things? hehe.\n\nIt's only fair that, after getting to top Mason, Kyle returns the favor by giving his hole up to a CF veteran and favorite - Dirk. Being the ever-horny straight boy, Dirk's always more than happy to plug a hole when it's offered up to him (especially as he knows his own butt is safe when he's tasked to top!) and so everything was lined up just right for a hot shoot when I paired up these two studs and let them have at it!","torrent":{"xt":"urn:btih:f9e4a1018b9939b4db4b1a709fba41abd90d9c9e","amp;dn":"Corbin+Fisher+-+-+-+Kyle+Gets+Fucked+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9e4a1018b9939b4db4b1a709fba41abd90d9c9e","infoHashBuffer":{"type":"Buffer","data":[249,228,161,1,139,153,57,180,219,75,26,112,159,186,65,171,217,13,156,158]},"announce":[],"urlList":[]}}