{"title":"Paul Stanley - Live To Win (Live)  (2nafish)","uid":5299320,"size":107122692,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fb4b43d81ae9981c1f74bd3251f213b9a3eb9100&amp;dn=Paul+Stanley+-+Live+To+Win+%28Live%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1264168793,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo or titles.\n\n\nLive to Win is the second solo album from Kiss vocalist, guitarist and co-founder Paul Stanley, released on October 24, 2006.\n\nThe album's title track was featured on the South Park episode &quot;Make Love, Not Warcraft&quot;, approximately three weeks (twenty days) prior to the album's release.\n\nStanley last released a solo album in 1978, Paul Stanley, which was officially released as a Kiss album. Comparing the two albums, Stanley said &quot;It's not 1978 anymore... It's certainly the same mentality, and certainly I'm a better singer today. My perspective and where I'm at in my life at this point, and what I've experienced and seen, brings something else to the table that wasn't there then. But I still look back on that album as a really great snapshot of who I was and what I was doing then.&quot;\n\nStanley supported the album's release with a club tour in the fall of 2006.\n\nIn October and November 2006, Stanley embarked on a theater tour in support of Live to Win. His touring band was the house band from the CBS TV show, Rock Star. The band appeared on both seasons of the show - Rock Star: INXS and Rock Star: Supernova. The band was composed of Paul Mirkovich (keyboards), Jim McGorman (guitar), Rafael Moreira (lead guitar), Nate Morton (drums), and Sasha Krivtsov (bass). In April 2007, Stanley extended the tour to include Australia, playing in Coolangatta, Wollongong, Newcastle, Sydney, Melbourne, Perth and Adelaide. Portions of the tour were filmed for an as-yet-unreleased documentary titled Paul Stanley: Live to Dream by the Chicago-based Film Foetus. The band's performance at the House of Blues in Chicago, IL, was captured on film and released in 2008 on DVD and digital audio download formats as One Live Kiss.\n\nIn 2008, Stanley sang a duet with Sarah Brightman, &quot;I Will Be with You&quot;, on her Symphony album.\n\nStanley Eisen (born January 20, 1952), better known by his stage name Paul Stanley, is an American hard rock guitarist, and singer, best known for being the rhythm guitarist and frontman of the rock band Kiss. He is the writer or co-writer of most of the band's highest-charting hits, including &quot;Rock and Roll All Nite,&quot; &quot;Detroit Rock City,&quot; &quot;Hard Luck Woman,&quot; &quot;I Was Made for Lovin' You,&quot; &quot;Crazy Crazy Nights&quot; and &quot;Forever.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fb4b43d81ae9981c1f74bd3251f213b9a3eb9100","amp;dn":"Paul+Stanley+-+Live+To+Win+%28Live%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb4b43d81ae9981c1f74bd3251f213b9a3eb9100","infoHashBuffer":{"type":"Buffer","data":[251,75,67,216,26,233,152,28,31,116,189,50,81,242,19,185,163,235,145,0]},"announce":[],"urlList":[]}}