{"title":"Hustle S06E03 HDTV H.264","uid":5289821,"size":668178063,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb69ed3323cddaeb23a8ef81e084f7d44cd11676&amp;dn=Hustle+S06E03+HDTV+H.264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Topunit","files":-1,"time":1263860781,"description":"Albert is in Chinatown to close a deal with Phil and his brother-in-law, Charlie. However, Czech Charlie is a notorious hard-man and not one to ever consider conning, so when Phil collapses and dies, Albert decides to cut his losses and leave the con. But Charlie isn't pulling out. He wants his brother's cash by the end of the week or else! Can the team con half a million to save Albert's bacon?\n\nFirst they need a mark, and quick! Fortunately, Sean has found Luke Baincross; a wannabe playboy with a huge country mansion. Baincross Hall houses an Indian art collection, including a life-sized gold tiger worth ten million pounds. Luke was planning to sell it to finance his third divorce but the estate's trust has forbidden it. Emma is sent in to capture his attention with the hope they can steal the tiger, have Luke fake an insurance claim and pay the team a fee of half a million.\n\nThey convince Luke to lend it to a major museum to make it easier to steal and more convincing to the insurer. He loves the idea - it makes him money, gets him great publicity and he gets one over on the infuriating museum curator.\n\nThe gang set to work on a recce of the museum - escorted by the curator, Ms Baboor. She assures them that the museum's vault is the most secure 200 square feet in London. The team are left with the challenge of making sure that the tiger ends up in the gallery and not the impenetrable vault, but with Mickey having no plan B, they may be skating on thin ice...\n\nVideo\nLength: 1 hour\nFrame width/height: 832x468\nData rate: 1402kbps\nTotal bitrate: 1527kbps\nFrame rate: 25 frames/second\n\nAudio\nBitrate: 125kbps\nChannels: 2 (stereo)\nAudio sample rate: 48 kHz","torrent":{"xt":"urn:btih:fb69ed3323cddaeb23a8ef81e084f7d44cd11676","amp;dn":"Hustle+S06E03+HDTV+H.264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb69ed3323cddaeb23a8ef81e084f7d44cd11676","infoHashBuffer":{"type":"Buffer","data":[251,105,237,51,35,205,218,235,35,168,239,129,224,132,247,212,76,209,22,118]},"announce":[],"urlList":[]}}