{"title":"Gay Porn - Eurocreme - Straight Boy.avi","uid":12385625,"size":1479941856,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fc4cb7737bbb7cd3cdfc861ffafcfea1e0cb0945&amp;dn=Gay+Porn+-+Eurocreme+-+Straight+Boy.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hotpornupz","files":1,"time":1441821153,"description":"Cover: &lt;a href=&quot;\nhttp://www.directupload.net/file/d/4105/l7kqm5jd_jpg.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.directupload.net/file/d/4105/l7kqm5jd_jpg.htm&lt;/a&gt;\n\nScreens: &lt;a href=&quot;\nhttp://www.directupload.net/file/d/4105/ae392xy3_jpg.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.directupload.net/file/d/4105/ae392xy3_jpg.htm&lt;/a&gt;\n\n\n\nStudio: Eurocreme\nGenres: Anal, Oral, Twinks, Group\nCast: Zak Hazzard,\nShane Stone,\nLuckas Layton,\nBailey Onice,\nJordan B,\nJustin D'Angelo,\nDan Roberts,\nNathan Cox,\nMatt Hughes,\nOllie Richards,\nBrett Carter\n\nRelease Year: 2008\nFormat: avi\nDuration: 1:38:55\nVideo: 960x540, XviD, 1747kbps\nAudio: 187kbps\n\n\nChasing after the straight boy, Andy has a school boy crush and can't work out how to get him, unlike some of his friends! Matt Hughes and his 11 inch dick is the type of straight lad everyone wants fucking them, and he's not shy about it either! Full of group sex, spit roasting and cum soaked twinks; StraightBoy will get you craving massive meat more than ever!!\nOne:\nAwesome Foursome!! Starting off the film perfectly, we're treated to an amazing group session with the smoothest twinks in all of London!! Waking up with morning hard-on's, all four are soon at it on the sofas, sharing rock hard cocks and having them thrust past their hot lips and down tight throats, you can almost taste the sexual tension as we watch their delicious butts gets pounded , both bottom boys getting a feel of each dick ram into them all the way inside. Lead star Andy is the cute blond kid, nice and skinny and able to take cock like aplete pro, watch out for the cumshots as you'll either be running for cover or licking the screen as it sprays everywhere, soaking them from head to toe!!\nScene Two:\nSecret threesome!! The group sex continues as Ricky sneaks out the way of his boyfriend and jumps down to meet up with two of his fuck buddies at work. Dying to get his cock serviced, all three are right at it from the very beginning, stripping themselves naked and getting Dan bent double. Ricky shoves his already solid meat into his mouth as Just kneels to taste that peachy smooth ass, licking his tight young hole and getting it ready to be stretched over his thick throbbing cock. Spit roasting the horny boy and fucking hard on the couch, he's covered in spunk from every angle as all cheeky Ricky splatters over his heaving chest from above.\nScene Three:\nCute Nathan gets fucked by 11 inches!! Taking back straight boy Matt to their place after a night out, Ricky and Nathan have only one thing on their mind, and it's his huge dick resting beneath his pants!! Flicking on the straight porn, this couple tease and work their growing cocks and get Matt to join in the wanking. Getting ever hornier, cock are soon sucked and it's not long before great bottom boy Nathan loosens his ass with Ricky before Matt really stretches his hole with every inch sliding deep inside!! Making Nathan take both dicks at each end, he's a cock hungry lad who can't get enough and loves spunk just as much, getting both of them to shoot over him, mixing with his own load on his saturated young body.\nScene Four:\nIntense sweaty fucking!! Ollie and Brett enjoy one of the most intense scenes when they hook up, Brett's massively thick cock and peachy ass gets used to perfection as Ollie grinds his long cock into him. Pounding hard and fast, he gets just as much of a workout as Brett's hole!! With lots of positions and rough cock slamming, both lads get sweaty, and when they shoot, it's dripping off their hot young bodies. Hungry for spunk, Brett gets Ollie to dump his load all over his face, lapping up every available drop before sharing a kiss, getting Ollie to taste his own as it rests on Brett's sweet lips.\nScene Five:\nMatt and Andy finally get it on!! Confessing his crush, skinny blond twink Andy lets Matt in on his secret, and he's totally flattered. Moving out, there's nothing to lose with a bit of big dick fun, and Andy gladly obliges!! Matt's rock hard dick proves just what a weapon it is as he lets loose on Andy and fucks his ass as hard as ever, slamming it home again and again, flipping the boy over and over as he gets his fill of ass, and Andy gets filled with dick! Spurting whilst Matt grinds hard, his face is then the target of streams of cum","torrent":{"xt":"urn:btih:fc4cb7737bbb7cd3cdfc861ffafcfea1e0cb0945","amp;dn":"Gay+Porn+-+Eurocreme+-+Straight+Boy.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc4cb7737bbb7cd3cdfc861ffafcfea1e0cb0945","infoHashBuffer":{"type":"Buffer","data":[252,76,183,115,123,187,124,211,205,252,134,31,250,252,254,161,224,203,9,69]},"announce":[],"urlList":[]}}