{"title":"TVO - Big Ideas, Jan 16, 2010: Wade Davis on disappearing cultur","uid":5286802,"size":189242663,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fc8e28d1ce3694262971095fe133d3178dbb6f14&amp;dn=TVO+-+Big+Ideas%2C+Jan+16%2C+2010%3A+Wade+Davis+on+disappearing+cultur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Temptation","files":1,"time":1263752734,"description":"[b]TVO - Big Ideas - January 16, 2010: Wade Davis on disappearing cultures[/b]\n\nAnthropologist and author, Wade Davis, delivers the 2009 Massey Lecture [i]The Wayfinders: Why Ancient Wisdom Matters in the Modern World[/i]. Davis explores the importance of the myriad and diverse cultures of the world and the impact on all of us when a culture disappears.\n\nFor more information on this episode, including information on the guests and various other resources and links, visit the [url=http://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?bi?1263679200000]episode webpage[/url]\n\n-----\n\nNote:  This is an iPod video podcast that is available for free download from the website.  Quality is good.  Audio podcast (mp3 format) is also available for free download.  \n\nType: m4v file\nSize: 180MB\nRuntime: 00:55:34\nVideo: MPEG4 Video (H264) 320x240 \nAudio: AAC 32000Hz mono 48Kbps \n\nDownload this episode using the attached torrent file or download it directly using this link: &lt;a href=&quot;\nhttp://feeds.tvo.org/~r/tvobigideasVideo/~5/slhIDCi2L04/834143_01011414_01564717_320x240_404k.m4v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://feeds.tvo.org/~r/tvobigideasVideo/~5/slhIDCi2L04/834143_01011414_01564717_320x240_404k.m4v&lt;/a&gt;\n\nYou can also watch a flash video of this lecture through your web-browser here: &lt;a href=&quot;\nhttp://www.tvo.org/TVO/WebObjects/TVO.woa?video?BI_Lecture_20100116_834143_WDavis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvo.org/TVO/WebObjects/TVO.woa?video?BI_Lecture_20100116_834143_WDavis&lt;/a&gt;\n\n-----\n\n[b]TVO - Big Ideas[/b]\n\nTELEVISION FOR PASSIONATE THINKERS\n\n[quote]I had never seen your program before, in fact I had never even heard of it. I was fortunate enough to tune in today ... Nothing is quite as nourishing as food for thought.\n-Brian, Big Ideas viewer[/quote]\n\n[quote]I have been off and on social assistance for several years. When I watch your show, I really am in university (a place I badly miss) and I don't feel so poor.\n-Gillian, Big Ideas viewer[/quote]\n\n[quote]... Were it not for Big Ideas to bring this to our attention we would be clueless. You are doing important work and those of us that are fortunate enough to catch your program, greatly appreciate your efforts.\n-Gary, Big Ideas viewer[/quote]\n\nBIG IDEAS, now in its eighth season, has an increasingly loyal following, exemplified by viewers such as Brian, Gillian and Gary. The program started in a late, late-night time slot with - among other offerings - the literary lectures by Robert Adams. It is now an established part of our weekend schedule, airing at 4pm on Saturday, with a repeat broadcast on Sunday, also at 4:00 pm. As TVO's educational mandate grew, so did the concept for BIG IDEAS, explains producer Wodek Szemberg: &quot;We have recognized from the passionate viewer response that there was a real niche for this kind of unapologetically intellectual programming.&quot; BIG IDEAS podcasts are among the most popular TVO web offerings.\n\n&quot;BIG IDEAS is a showcase of ideas that shape our public debates. At their best the lectures featured on the program expose us to the differing ways of defining what matters and how that affects our understanding of the world as it is and as it is likely to be,&quot; adds Szemberg. &quot;Each age has a set of questions by which it defines itself. If, 50 years from now, someone came across a list of BIG IDEAS shows, they would have a pretty good idea of what people thought about and debated in the early 2000s.&quot;\n\nBy nature of its lecture format, pacing and inquisitive approach, it is the antithesis of the prevailing sound-bite television norm. Engaging, articulate speakers stand behind lecterns across the province addressing audiences - a stark, on-air aesthetic running counter to fast edits and whizzy sound effects. The simple, bold concept, a victory of substance over style, has found an appreciative following. The success of this public television offering is testimony to our viewers need for nothing but intelligent discussion with perhaps a dash of personality and humour. At a time when much television programming induces in many viewers feelings of guilt, BIG IDEAS is as guilt-free television experience as it is possible to imagine.\n\nBIG IDEAS offers a variety of thought-provoking topics which range across politics, culture, economics, art history, science.... The program has introduced Ontario viewers to the impressive brainpower of people like Niall Ferguson on American empire, Daniel Libeskind on architecture, Robert Fisk on the Middle East, George Steiner on the demise of literacy, Camille Paglia on aesthetic education, Tariq Ramadan on being a Western Muslim, Noam Chomsky on U.S. politics, Leon Kass on dying, Janice Stein on accountability and governance.\n\nThe public face of the program is Andrew Moodie, who assumed the hosting duties for BIG IDEAS on January 7, 2006. You may recognize him as one of the three jurors who helped us to come up with the 10 finalists in 2005's Best Lecturer Competition, or you may know him as a gifted actor and playwright.\n\nTVO's [b]Big Ideas[/b] website:  &lt;a href=&quot;\nhttp://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?bigideas&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?bigideas&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fc8e28d1ce3694262971095fe133d3178dbb6f14","amp;dn":"TVO+-+Big+Ideas%2C+Jan+16%2C+2010%3A+Wade+Davis+on+disappearing+cultur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc8e28d1ce3694262971095fe133d3178dbb6f14","infoHashBuffer":{"type":"Buffer","data":[252,142,40,209,206,54,148,38,41,113,9,95,225,51,211,23,141,187,111,20]},"announce":[],"urlList":[]}}