{"title":"Building.Cars.Live.s01e01.EN.SUB.960x540.WEBRIP.[MPup]","uid":12606576,"size":1137110151,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe139a8c6cc498fc329cec69f4dbb2f25961b946&amp;dn=Building.Cars.Live.s01e01.EN.SUB.960x540.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1445393209,"description":"Building.Cars.Live.s01e01.EN.SUB.960x540.WEBRIP.[MPup]\r\n\r\nSize: 960x540* [small]This weird size was all I could rip from the BBC[/small]\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]1 of 2[/b]\r\n\r\nBuckle up for an incredible journey into the fascinating secret world of the car factory. Every 68 seconds a brand new car drives off the production line at the MINI Plant in Oxford. In this series, James May, Kate Humble and Ant Anstead go live behind the scenes to bring us this modern miracle in real time. Over two nights they will reveal the science, engineering and people that keep us all on the road, and see a car built from start to finish in a little over 24 hours.\r\n\r\nIn the first episode, James makes friends with an army of diligent robots and busts the myth that British manufacturing is dead. Kate heads to Norway to discover why the electric car is king of the Norwegian road and Ant explores the history and heritage of one of the most iconic cars ever built. With access all areas live on the factory floor, the team will see exactly how a car is born - a car that tomorrow will be driven off the line ready for life on the open road.\r\n\r\n[img]http://extraimago.com/images/2015/10/20/f37175ba2eefd08d9753753f78cb2734.jpg[/img]\r\n\r\nBuckle up for an incredible journey into the fascinating secret world of the car factory, which will see BBC Two getting under the bonnet of the UK car industry.\r\n\r\nEvery 20 seconds a brand new car rolls off the production line somewhere in Britain* and James May, Kate Humble and Ant Anstead are live behind the scenes at one of the biggest and busiest car factories in the country - the MINI Plant in Oxford. Over two nights they’ll reveal the science, engineering and people that keep us all on the road and see a car built from start to finish in a little over 24 hours.\r\n\r\nBuilding Cars Live will also step outside the factory to explore the evolution of global mass production, bust the myth that British manufacturing is dead and see how design becomes reality.\r\n\r\nIn this first programme James makes friends with an army of diligent robots, Kate heads to Norway to discover why the electric car is king of the Norwegian road and Ant explores the history and heritage of one of the most iconic cars ever built. With access all areas on the factory floor, the team will see exactly how a car is born - a car that tomorrow will be driven off the line, ready for life on the open road.\r\n\r\n*Source, The Society of Motor Manufacturers and Traders (SMMT)","torrent":{"xt":"urn:btih:fe139a8c6cc498fc329cec69f4dbb2f25961b946","amp;dn":"Building.Cars.Live.s01e01.EN.SUB.960x540.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe139a8c6cc498fc329cec69f4dbb2f25961b946","infoHashBuffer":{"type":"Buffer","data":[254,19,154,140,108,196,152,252,50,156,236,105,244,219,178,242,89,97,185,70]},"announce":[],"urlList":[]}}