{"title":"Sailor Moon Super S. cap. 143","uid":5296502,"size":223690752,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fea9a0685458e33b28f19837bc185932aa006b4f&amp;dn=Sailor+Moon+Super+S.+cap.+143&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sagleon","files":1,"time":1264080049,"description":"Resulta que aparece el circo en la ciudad y con ÃƒÂ©l el nuevo enemigo. Un Unicornio Pegaso se oculta en los sueÃƒÂ±os de Chibiusa y le PIDE uno esta ayuda, Porque unos malvados, Ojo de Pez, Ojo de HalcÃƒÂ³n y Ojo de Tigre, Estan Buscando al Pegaso para que con el porquÃƒÂ© el Ama Circonia Pueda apoderarse del mundo, , segÃƒÂºn parece, el Pegaso tiene un poder grandÃƒÂ­simo. Para AYUDARLE le da nuevos poderes tanto un Chibiusa como un conejo. Ojo de Tigre, Ojo de Pez y Ojo de HalcÃƒÂ³n EstÃƒÂ¡n buscando al Pegaso en los &quot;Espejos del alma&quot;, en donde se ven los sueÃƒÂ±os de la gente. El Ojo de Tigre ya ha mirado los sueÃƒÂ±os de Ray, y junto con el Ojo de HalcÃƒÂ³n TambiÃƒÂ©n ha mirado los de Carola. Luego el TrÃƒÂ­o Amazonas DEBIDO A sus continuos fracasos debÃƒÂ­a encontrar al pegaso, y Fueron a parar un Armando, Ojo de Pez se enamorÃƒÂ³ de ÃƒÂ©l y le quito sus sueÃƒÂ±os, pero tampoco Estaba en ÃƒÂ©l el pegaso. Ojo de Pez descubre que Chibiusa es la poseedora del Pegaso y manda un Ojo de HalcÃƒÂ³n por un conejo y le bastante sus sueÃƒÂ±os pero se equivoca de blanco y rompe los sueÃƒÂ±os de Bunny, por lo tanto la mata en el acto, tanto una como ella un Chibiusa. Ojo de HalcÃƒÂ³n tambien es herido. Pero para salvar a Bunny Ojo de Pez saca el poder de la Bola de Cristal que les convirtiÃƒÂ³ en humanos pero sin sueÃƒÂ±os, y salva a Bunny ya Chibiusa, quienes acaban con el monstruo. Entonces Pegaso, decidir Ayudar un dÃƒÂ¡ndoles El TrÃƒÂ­o Amazonas, el espejo de los sueÃƒÂ±os y una nueva vida. ","torrent":{"xt":"urn:btih:fea9a0685458e33b28f19837bc185932aa006b4f","amp;dn":"Sailor+Moon+Super+S.+cap.+143","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fea9a0685458e33b28f19837bc185932aa006b4f","infoHashBuffer":{"type":"Buffer","data":[254,169,160,104,84,88,227,59,40,241,152,55,188,24,89,50,170,0,107,79]},"announce":[],"urlList":[]}}